garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: DMAnSCNT
#define DMAnSCNT DMAnSCNT
extern volatile unsigned short          DMAnSCNT            __at(0x04A);
#ifndef _LIB_BUILD
asm("DMAnSCNT equ 04Ah");
#endif

// Register: DMAnSCNTL
#define DMAnSCNTL DMAnSCNTL
extern volatile unsigned char           DMAnSCNTL           __at(0x04A);
#ifndef _LIB_BUILD
asm("DMAnSCNTL equ 04Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT0                  :1;
        unsigned SCNT1                  :1;
        unsigned SCNT2                  :1;
        unsigned SCNT3                  :1;
        unsigned SCNT4                  :1;
        unsigned SCNT5                  :1;
        unsigned SCNT6                  :1;
        unsigned SCNT7                  :1;
    };
} DMAnSCNTLbits_t;
extern volatile DMAnSCNTLbits_t DMAnSCNTLbits __at(0x04A);
// bitfield macros
#define _DMAnSCNTL_SCNT_POSN                                0x0
#define _DMAnSCNTL_SCNT_POSITION                            0x0
#define _DMAnSCNTL_SCNT_SIZE                                0x8
#define _DMAnSCNTL_SCNT_LENGTH                              0x8
#define _DMAnSCNTL_SCNT_MASK                                0xFF
#define _DMAnSCNTL_SCNT0_POSN                               0x0
#define _DMAnSCNTL_SCNT0_POSITION                           0x0
#define _DMAnSCNTL_SCNT0_SIZE                               0x1
#define _DMAnSCNTL_SCNT0_LENGTH                             0x1
#define _DMAnSCNTL_SCNT0_MASK                               0x1
#define _DMAnSCNTL_SCNT1_POSN                               0x1
#define _DMAnSCNTL_SCNT1_POSITION                           0x1
#define _DMAnSCNTL_SCNT1_SIZE                               0x1
#define _DMAnSCNTL_SCNT1_LENGTH                             0x1
#define _DMAnSCNTL_SCNT1_MASK                               0x2
#define _DMAnSCNTL_SCNT2_POSN                               0x2
#define _DMAnSCNTL_SCNT2_POSITION                           0x2
#define _DMAnSCNTL_SCNT2_SIZE                               0x1
#define _DMAnSCNTL_SCNT2_LENGTH                             0x1
#define _DMAnSCNTL_SCNT2_MASK                               0x4
#define _DMAnSCNTL_SCNT3_POSN                               0x3
#define _DMAnSCNTL_SCNT3_POSITION                           0x3
#define _DMAnSCNTL_SCNT3_SIZE                               0x1
#define _DMAnSCNTL_SCNT3_LENGTH                             0x1
#define _DMAnSCNTL_SCNT3_MASK                               0x8
#define _DMAnSCNTL_SCNT4_POSN                               0x4
#define _DMAnSCNTL_SCNT4_POSITION                           0x4
#define _DMAnSCNTL_SCNT4_SIZE                               0x1
#define _DMAnSCNTL_SCNT4_LENGTH                             0x1
#define _DMAnSCNTL_SCNT4_MASK                               0x10
#define _DMAnSCNTL_SCNT5_POSN                               0x5
#define _DMAnSCNTL_SCNT5_POSITION                           0x5
#define _DMAnSCNTL_SCNT5_SIZE                               0x1
#define _DMAnSCNTL_SCNT5_LENGTH                             0x1
#define _DMAnSCNTL_SCNT5_MASK                               0x20
#define _DMAnSCNTL_SCNT6_POSN                               0x6
#define _DMAnSCNTL_SCNT6_POSITION                           0x6
#define _DMAnSCNTL_SCNT6_SIZE                               0x1
#define _DMAnSCNTL_SCNT6_LENGTH                             0x1
#define _DMAnSCNTL_SCNT6_MASK                               0x40
#define _DMAnSCNTL_SCNT7_POSN                               0x7
#define _DMAnSCNTL_SCNT7_POSITION                           0x7
#define _DMAnSCNTL_SCNT7_SIZE                               0x1
#define _DMAnSCNTL_SCNT7_LENGTH                             0x1
#define _DMAnSCNTL_SCNT7_MASK                               0x80

// Register: DMAnSCNTH
#define DMAnSCNTH DMAnSCNTH
extern volatile unsigned char           DMAnSCNTH           __at(0x04B);
#ifndef _LIB_BUILD
asm("DMAnSCNTH equ 04Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT8                  :1;
        unsigned SCNT9                  :1;
        unsigned SCNT10                 :1;
        unsigned SCNT11                 :1;
    };
} DMAnSCNTHbits_t;
extern volatile DMAnSCNTHbits_t DMAnSCNTHbits __at(0x04B);
// bitfield macros
#define _DMAnSCNTH_SCNT_POSN                                0x0
#define _DMAnSCNTH_SCNT_POSITION                            0x0
#define _DMAnSCNTH_SCNT_SIZE                                0x8
#define _DMAnSCNTH_SCNT_LENGTH                              0x8
#define _DMAnSCNTH_SCNT_MASK                                0xFF
#define _DMAnSCNTH_SCNT8_POSN                               0x0
#define _DMAnSCNTH_SCNT8_POSITION                           0x0
#define _DMAnSCNTH_SCNT8_SIZE                               0x1
#define _DMAnSCNTH_SCNT8_LENGTH                             0x1
#define _DMAnSCNTH_SCNT8_MASK                               0x1
#define _DMAnSCNTH_SCNT9_POSN                               0x1
#define _DMAnSCNTH_SCNT9_POSITION                           0x1
#define _DMAnSCNTH_SCNT9_SIZE                               0x1
#define _DMAnSCNTH_SCNT9_LENGTH                             0x1
#define _DMAnSCNTH_SCNT9_MASK                               0x2
#define _DMAnSCNTH_SCNT10_POSN                              0x2
#define _DMAnSCNTH_SCNT10_POSITION                          0x2
#define _DMAnSCNTH_SCNT10_SIZE                              0x1
#define _DMAnSCNTH_SCNT10_LENGTH                            0x1
#define _DMAnSCNTH_SCNT10_MASK                              0x4
#define _DMAnSCNTH_SCNT11_POSN                              0x3
#define _DMAnSCNTH_SCNT11_POSITION                          0x3
#define _DMAnSCNTH_SCNT11_SIZE                              0x1
#define _DMAnSCNTH_SCNT11_LENGTH                            0x1
#define _DMAnSCNTH_SCNT11_MASK                              0x8

// Register: DMAnSPTR
#define DMAnSPTR DMAnSPTR
#ifndef __CCI__
extern volatile __uint24                DMAnSPTR            __at(0x04C);
#endif
#ifndef _LIB_BUILD
asm("DMAnSPTR equ 04Ch");
#endif

// Register: DMAnSPTRL
#define DMAnSPTRL DMAnSPTRL
extern volatile unsigned char           DMAnSPTRL           __at(0x04C);
#ifndef _LIB_BUILD
asm("DMAnSPTRL equ 04Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR0                  :1;
        unsigned SPTR1                  :1;
        unsigned SPTR2                  :1;
        unsigned SPTR3                  :1;
        unsigned SPTR4                  :1;
        unsigned SPTR5                  :1;
        unsigned SPTR6                  :1;
        unsigned SPTR7                  :1;
    };
} DMAnSPTRLbits_t;
extern volatile DMAnSPTRLbits_t DMAnSPTRLbits __at(0x04C);
// bitfield macros
#define _DMAnSPTRL_SPTR_POSN                                0x0
#define _DMAnSPTRL_SPTR_POSITION                            0x0
#define _DMAnSPTRL_SPTR_SIZE                                0x8
#define _DMAnSPTRL_SPTR_LENGTH                              0x8
#define _DMAnSPTRL_SPTR_MASK                                0xFF
#define _DMAnSPTRL_SPTR0_POSN                               0x0
#define _DMAnSPTRL_SPTR0_POSITION                           0x0
#define _DMAnSPTRL_SPTR0_SIZE                               0x1
#define _DMAnSPTRL_SPTR0_LENGTH                             0x1
#define _DMAnSPTRL_SPTR0_MASK                               0x1
#define _DMAnSPTRL_SPTR1_POSN                               0x1
#define _DMAnSPTRL_SPTR1_POSITION                           0x1
#define _DMAnSPTRL_SPTR1_SIZE                               0x1
#define _DMAnSPTRL_SPTR1_LENGTH                             0x1
#define _DMAnSPTRL_SPTR1_MASK                               0x2
#define _DMAnSPTRL_SPTR2_POSN                               0x2
#define _DMAnSPTRL_SPTR2_POSITION                           0x2
#define _DMAnSPTRL_SPTR2_SIZE                               0x1
#define _DMAnSPTRL_SPTR2_LENGTH                             0x1
#define _DMAnSPTRL_SPTR2_MASK                               0x4
#define _DMAnSPTRL_SPTR3_POSN                               0x3
#define _DMAnSPTRL_SPTR3_POSITION                           0x3
#define _DMAnSPTRL_SPTR3_SIZE                               0x1
#define _DMAnSPTRL_SPTR3_LENGTH                             0x1
#define _DMAnSPTRL_SPTR3_MASK                               0x8
#define _DMAnSPTRL_SPTR4_POSN                               0x4
#define _DMAnSPTRL_SPTR4_POSITION                           0x4
#define _DMAnSPTRL_SPTR4_SIZE                               0x1
#define _DMAnSPTRL_SPTR4_LENGTH                             0x1
#define _DMAnSPTRL_SPTR4_MASK                               0x10
#define _DMAnSPTRL_SPTR5_POSN                               0x5
#define _DMAnSPTRL_SPTR5_POSITION                           0x5
#define _DMAnSPTRL_SPTR5_SIZE                               0x1
#define _DMAnSPTRL_SPTR5_LENGTH                             0x1
#define _DMAnSPTRL_SPTR5_MASK                               0x20
#define _DMAnSPTRL_SPTR6_POSN                               0x6
#define _DMAnSPTRL_SPTR6_POSITION                           0x6
#define _DMAnSPTRL_SPTR6_SIZE                               0x1
#define _DMAnSPTRL_SPTR6_LENGTH                             0x1
#define _DMAnSPTRL_SPTR6_MASK                               0x40
#define _DMAnSPTRL_SPTR7_POSN                               0x7
#define _DMAnSPTRL_SPTR7_POSITION                           0x7
#define _DMAnSPTRL_SPTR7_SIZE                               0x1
#define _DMAnSPTRL_SPTR7_LENGTH                             0x1
#define _DMAnSPTRL_SPTR7_MASK                               0x80

// Register: DMAnSPTRH
#define DMAnSPTRH DMAnSPTRH
extern volatile unsigned char           DMAnSPTRH           __at(0x04D);
#ifndef _LIB_BUILD
asm("DMAnSPTRH equ 04Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR8                  :1;
        unsigned SPTR9                  :1;
        unsigned SPTR10                 :1;
        unsigned SPTR11                 :1;
        unsigned SPTR12                 :1;
        unsigned SPTR13                 :1;
        unsigned SPTR14                 :1;
        unsigned SPTR15                 :1;
    };
} DMAnSPTRHbits_t;
extern volatile DMAnSPTRHbits_t DMAnSPTRHbits __at(0x04D);
// bitfield macros
#define _DMAnSPTRH_SPTR_POSN                                0x0
#define _DMAnSPTRH_SPTR_POSITION                            0x0
#define _DMAnSPTRH_SPTR_SIZE                                0x8
#define _DMAnSPTRH_SPTR_LENGTH                              0x8
#define _DMAnSPTRH_SPTR_MASK                                0xFF
#define _DMAnSPTRH_SPTR8_POSN                               0x0
#define _DMAnSPTRH_SPTR8_POSITION                           0x0
#define _DMAnSPTRH_SPTR8_SIZE                               0x1
#define _DMAnSPTRH_SPTR8_LENGTH                             0x1
#define _DMAnSPTRH_SPTR8_MASK                               0x1
#define _DMAnSPTRH_SPTR9_POSN                               0x1
#define _DMAnSPTRH_SPTR9_POSITION                           0x1
#define _DMAnSPTRH_SPTR9_SIZE                               0x1
#define _DMAnSPTRH_SPTR9_LENGTH                             0x1
#define _DMAnSPTRH_SPTR9_MASK                               0x2
#define _DMAnSPTRH_SPTR10_POSN                              0x2
#define _DMAnSPTRH_SPTR10_POSITION                          0x2
#define _DMAnSPTRH_SPTR10_SIZE                              0x1
#define _DMAnSPTRH_SPTR10_LENGTH                            0x1
#define _DMAnSPTRH_SPTR10_MASK                              0x4
#define _DMAnSPTRH_SPTR11_POSN                              0x3
#define _DMAnSPTRH_SPTR11_POSITION                          0x3
#define _DMAnSPTRH_SPTR11_SIZE                              0x1
#define _DMAnSPTRH_SPTR11_LENGTH                            0x1
#define _DMAnSPTRH_SPTR11_MASK                              0x8
#define _DMAnSPTRH_SPTR12_POSN                              0x4
#define _DMAnSPTRH_SPTR12_POSITION                          0x4
#define _DMAnSPTRH_SPTR12_SIZE                              0x1
#define _DMAnSPTRH_SPTR12_LENGTH                            0x1
#define _DMAnSPTRH_SPTR12_MASK                              0x10
#define _DMAnSPTRH_SPTR13_POSN                              0x5
#define _DMAnSPTRH_SPTR13_POSITION                          0x5
#define _DMAnSPTRH_SPTR13_SIZE                              0x1
#define _DMAnSPTRH_SPTR13_LENGTH                            0x1
#define _DMAnSPTRH_SPTR13_MASK                              0x20
#define _DMAnSPTRH_SPTR14_POSN                              0x6
#define _DMAnSPTRH_SPTR14_POSITION                          0x6
#define _DMAnSPTRH_SPTR14_SIZE                              0x1
#define _DMAnSPTRH_SPTR14_LENGTH                            0x1
#define _DMAnSPTRH_SPTR14_MASK                              0x40
#define _DMAnSPTRH_SPTR15_POSN                              0x7
#define _DMAnSPTRH_SPTR15_POSITION                          0x7
#define _DMAnSPTRH_SPTR15_SIZE                              0x1
#define _DMAnSPTRH_SPTR15_LENGTH                            0x1
#define _DMAnSPTRH_SPTR15_MASK                              0x80

// Register: DMAnSPTRU
#define DMAnSPTRU DMAnSPTRU
extern volatile unsigned char           DMAnSPTRU           __at(0x04E);
#ifndef _LIB_BUILD
asm("DMAnSPTRU equ 04Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR16                 :1;
        unsigned SPTR17                 :1;
        unsigned SPTR18                 :1;
        unsigned SPTR19                 :1;
        unsigned SPTR20                 :1;
        unsigned SPTR21                 :1;
    };
} DMAnSPTRUbits_t;
extern volatile DMAnSPTRUbits_t DMAnSPTRUbits __at(0x04E);
// bitfield macros
#define _DMAnSPTRU_SPTR_POSN                                0x0
#define _DMAnSPTRU_SPTR_POSITION                            0x0
#define _DMAnSPTRU_SPTR_SIZE                                0x8
#define _DMAnSPTRU_SPTR_LENGTH                              0x8
#define _DMAnSPTRU_SPTR_MASK                                0xFF
#define _DMAnSPTRU_SPTR16_POSN                              0x0
#define _DMAnSPTRU_SPTR16_POSITION                          0x0
#define _DMAnSPTRU_SPTR16_SIZE                              0x1
#define _DMAnSPTRU_SPTR16_LENGTH                            0x1
#define _DMAnSPTRU_SPTR16_MASK                              0x1
#define _DMAnSPTRU_SPTR17_POSN                              0x1
#define _DMAnSPTRU_SPTR17_POSITION                          0x1
#define _DMAnSPTRU_SPTR17_SIZE                              0x1
#define _DMAnSPTRU_SPTR17_LENGTH                            0x1
#define _DMAnSPTRU_SPTR17_MASK                              0x2
#define _DMAnSPTRU_SPTR18_POSN                              0x2
#define _DMAnSPTRU_SPTR18_POSITION                          0x2
#define _DMAnSPTRU_SPTR18_SIZE                              0x1
#define _DMAnSPTRU_SPTR18_LENGTH                            0x1
#define _DMAnSPTRU_SPTR18_MASK                              0x4
#define _DMAnSPTRU_SPTR19_POSN                              0x3
#define _DMAnSPTRU_SPTR19_POSITION                          0x3
#define _DMAnSPTRU_SPTR19_SIZE                              0x1
#define _DMAnSPTRU_SPTR19_LENGTH                            0x1
#define _DMAnSPTRU_SPTR19_MASK                              0x8
#define _DMAnSPTRU_SPTR20_POSN                              0x4
#define _DMAnSPTRU_SPTR20_POSITION                          0x4
#define _DMAnSPTRU_SPTR20_SIZE                              0x1
#define _DMAnSPTRU_SPTR20_LENGTH                            0x1
#define _DMAnSPTRU_SPTR20_MASK                              0x10
#define _DMAnSPTRU_SPTR21_POSN                              0x5
#define _DMAnSPTRU_SPTR21_POSITION                          0x5
#define _DMAnSPTRU_SPTR21_SIZE                              0x1
#define _DMAnSPTRU_SPTR21_LENGTH                            0x1
#define _DMAnSPTRU_SPTR21_MASK                              0x20

// Register: DMAnSSZ
#define DMAnSSZ DMAnSSZ
extern volatile unsigned short          DMAnSSZ             __at(0x04F);
#ifndef _LIB_BUILD
asm("DMAnSSZ equ 04Fh");
#endif

// Register: DMAnSSZL
#define DMAnSSZL DMAnSSZL
extern volatile unsigned char           DMAnSSZL            __at(0x04F);
#ifndef _LIB_BUILD
asm("DMAnSSZL equ 04Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned SSZ0                   :1;
        unsigned SSZ1                   :1;
        unsigned SSZ2                   :1;
        unsigned SSZ3                   :1;
        unsigned SSZ4                   :1;
        unsigned SSZ5                   :1;
        unsigned SSZ6                   :1;
        unsigned SSZ7                   :1;
    };
} DMAnSSZLbits_t;
extern volatile DMAnSSZLbits_t DMAnSSZLbits __at(0x04F);
// bitfield macros
#define _DMAnSSZL_SSZ_POSN                                  0x0
#define _DMAnSSZL_SSZ_POSITION                              0x0
#define _DMAnSSZL_SSZ_SIZE                                  0x8
#define _DMAnSSZL_SSZ_LENGTH                                0x8
#define _DMAnSSZL_SSZ_MASK                                  0xFF
#define _DMAnSSZL_SSZ0_POSN                                 0x0
#define _DMAnSSZL_SSZ0_POSITION                             0x0
#define _DMAnSSZL_SSZ0_SIZE                                 0x1
#define _DMAnSSZL_SSZ0_LENGTH                               0x1
#define _DMAnSSZL_SSZ0_MASK                                 0x1
#define _DMAnSSZL_SSZ1_POSN                                 0x1
#define _DMAnSSZL_SSZ1_POSITION                             0x1
#define _DMAnSSZL_SSZ1_SIZE                                 0x1
#define _DMAnSSZL_SSZ1_LENGTH                               0x1
#define _DMAnSSZL_SSZ1_MASK                                 0x2
#define _DMAnSSZL_SSZ2_POSN                                 0x2
#define _DMAnSSZL_SSZ2_POSITION                             0x2
#define _DMAnSSZL_SSZ2_SIZE                                 0x1
#define _DMAnSSZL_SSZ2_LENGTH                               0x1
#define _DMAnSSZL_SSZ2_MASK                                 0x4
#define _DMAnSSZL_SSZ3_POSN                                 0x3
#define _DMAnSSZL_SSZ3_POSITION                             0x3
#define _DMAnSSZL_SSZ3_SIZE                                 0x1
#define _DMAnSSZL_SSZ3_LENGTH                               0x1
#define _DMAnSSZL_SSZ3_MASK                                 0x8
#define _DMAnSSZL_SSZ4_POSN                                 0x4
#define _DMAnSSZL_SSZ4_POSITION                             0x4
#define _DMAnSSZL_SSZ4_SIZE                                 0x1
#define _DMAnSSZL_SSZ4_LENGTH                               0x1
#define _DMAnSSZL_SSZ4_MASK                                 0x10
#define _DMAnSSZL_SSZ5_POSN                                 0x5
#define _DMAnSSZL_SSZ5_POSITION                             0x5
#define _DMAnSSZL_SSZ5_SIZE                                 0x1
#define _DMAnSSZL_SSZ5_LENGTH                               0x1
#define _DMAnSSZL_SSZ5_MASK                                 0x20
#define _DMAnSSZL_SSZ6_POSN                                 0x6
#define _DMAnSSZL_SSZ6_POSITION                             0x6
#define _DMAnSSZL_SSZ6_SIZE                                 0x1
#define _DMAnSSZL_SSZ6_LENGTH                               0x1
#define _DMAnSSZL_SSZ6_MASK                                 0x40
#define _DMAnSSZL_SSZ7_POSN                                 0x7
#define _DMAnSSZL_SSZ7_POSITION                             0x7
#define _DMAnSSZL_SSZ7_SIZE                                 0x1
#define _DMAnSSZL_SSZ7_LENGTH                               0x1
#define _DMAnSSZL_SSZ7_MASK                                 0x80

// Register: DMAnSSZH
#define DMAnSSZH DMAnSSZH
extern volatile unsigned char           DMAnSSZH            __at(0x050);
#ifndef _LIB_BUILD
asm("DMAnSSZH equ 050h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned SSZ8                   :1;
        unsigned SSZ9                   :1;
        unsigned SSZ10                  :1;
        unsigned SSZ11                  :1;
    };
} DMAnSSZHbits_t;
