garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: CRCOUTL
#define CRCOUTL CRCOUTL
extern volatile unsigned char           CRCOUTL             __at(0x064);
#ifndef _LIB_BUILD
asm("CRCOUTL equ 064h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT0                   :1;
        unsigned OUT1                   :1;
        unsigned OUT2                   :1;
        unsigned OUT3                   :1;
        unsigned OUT4                   :1;
        unsigned OUT5                   :1;
        unsigned OUT6                   :1;
        unsigned OUT7                   :1;
    };
} CRCOUTLbits_t;
extern volatile CRCOUTLbits_t CRCOUTLbits __at(0x064);
// bitfield macros
#define _CRCOUTL_OUT_POSN                                   0x0
#define _CRCOUTL_OUT_POSITION                               0x0
#define _CRCOUTL_OUT_SIZE                                   0x8
#define _CRCOUTL_OUT_LENGTH                                 0x8
#define _CRCOUTL_OUT_MASK                                   0xFF
#define _CRCOUTL_OUT0_POSN                                  0x0
#define _CRCOUTL_OUT0_POSITION                              0x0
#define _CRCOUTL_OUT0_SIZE                                  0x1
#define _CRCOUTL_OUT0_LENGTH                                0x1
#define _CRCOUTL_OUT0_MASK                                  0x1
#define _CRCOUTL_OUT1_POSN                                  0x1
#define _CRCOUTL_OUT1_POSITION                              0x1
#define _CRCOUTL_OUT1_SIZE                                  0x1
#define _CRCOUTL_OUT1_LENGTH                                0x1
#define _CRCOUTL_OUT1_MASK                                  0x2
#define _CRCOUTL_OUT2_POSN                                  0x2
#define _CRCOUTL_OUT2_POSITION                              0x2
#define _CRCOUTL_OUT2_SIZE                                  0x1
#define _CRCOUTL_OUT2_LENGTH                                0x1
#define _CRCOUTL_OUT2_MASK                                  0x4
#define _CRCOUTL_OUT3_POSN                                  0x3
#define _CRCOUTL_OUT3_POSITION                              0x3
#define _CRCOUTL_OUT3_SIZE                                  0x1
#define _CRCOUTL_OUT3_LENGTH                                0x1
#define _CRCOUTL_OUT3_MASK                                  0x8
#define _CRCOUTL_OUT4_POSN                                  0x4
#define _CRCOUTL_OUT4_POSITION                              0x4
#define _CRCOUTL_OUT4_SIZE                                  0x1
#define _CRCOUTL_OUT4_LENGTH                                0x1
#define _CRCOUTL_OUT4_MASK                                  0x10
#define _CRCOUTL_OUT5_POSN                                  0x5
#define _CRCOUTL_OUT5_POSITION                              0x5
#define _CRCOUTL_OUT5_SIZE                                  0x1
#define _CRCOUTL_OUT5_LENGTH                                0x1
#define _CRCOUTL_OUT5_MASK                                  0x20
#define _CRCOUTL_OUT6_POSN                                  0x6
#define _CRCOUTL_OUT6_POSITION                              0x6
#define _CRCOUTL_OUT6_SIZE                                  0x1
#define _CRCOUTL_OUT6_LENGTH                                0x1
#define _CRCOUTL_OUT6_MASK                                  0x40
#define _CRCOUTL_OUT7_POSN                                  0x7
#define _CRCOUTL_OUT7_POSITION                              0x7
#define _CRCOUTL_OUT7_SIZE                                  0x1
#define _CRCOUTL_OUT7_LENGTH                                0x1
#define _CRCOUTL_OUT7_MASK                                  0x80

// Register: CRCSHFTL
#define CRCSHFTL CRCSHFTL
extern volatile unsigned char           CRCSHFTL            __at(0x064);
#ifndef _LIB_BUILD
asm("CRCSHFTL equ 064h");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTL           __at(0x064);
#ifndef _LIB_BUILD
asm("CRCSHIFTL equ 064h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT0                 :1;
        unsigned SHIFT1                 :1;
        unsigned SHIFT2                 :1;
        unsigned SHIFT3                 :1;
        unsigned SHIFT4                 :1;
        unsigned SHIFT5                 :1;
        unsigned SHIFT6                 :1;
        unsigned SHIFT7                 :1;
    };
} CRCSHFTLbits_t;
extern volatile CRCSHFTLbits_t CRCSHFTLbits __at(0x064);
// bitfield macros
#define _CRCSHFTL_SHIFT_POSN                                0x0
#define _CRCSHFTL_SHIFT_POSITION                            0x0
#define _CRCSHFTL_SHIFT_SIZE                                0x8
#define _CRCSHFTL_SHIFT_LENGTH                              0x8
#define _CRCSHFTL_SHIFT_MASK                                0xFF
#define _CRCSHFTL_SHIFT0_POSN                               0x0
#define _CRCSHFTL_SHIFT0_POSITION                           0x0
#define _CRCSHFTL_SHIFT0_SIZE                               0x1
#define _CRCSHFTL_SHIFT0_LENGTH                             0x1
#define _CRCSHFTL_SHIFT0_MASK                               0x1
#define _CRCSHFTL_SHIFT1_POSN                               0x1
#define _CRCSHFTL_SHIFT1_POSITION                           0x1
#define _CRCSHFTL_SHIFT1_SIZE                               0x1
#define _CRCSHFTL_SHIFT1_LENGTH                             0x1
#define _CRCSHFTL_SHIFT1_MASK                               0x2
#define _CRCSHFTL_SHIFT2_POSN                               0x2
#define _CRCSHFTL_SHIFT2_POSITION                           0x2
#define _CRCSHFTL_SHIFT2_SIZE                               0x1
#define _CRCSHFTL_SHIFT2_LENGTH                             0x1
#define _CRCSHFTL_SHIFT2_MASK                               0x4
#define _CRCSHFTL_SHIFT3_POSN                               0x3
#define _CRCSHFTL_SHIFT3_POSITION                           0x3
#define _CRCSHFTL_SHIFT3_SIZE                               0x1
#define _CRCSHFTL_SHIFT3_LENGTH                             0x1
#define _CRCSHFTL_SHIFT3_MASK                               0x8
#define _CRCSHFTL_SHIFT4_POSN                               0x4
#define _CRCSHFTL_SHIFT4_POSITION                           0x4
#define _CRCSHFTL_SHIFT4_SIZE                               0x1
#define _CRCSHFTL_SHIFT4_LENGTH                             0x1
#define _CRCSHFTL_SHIFT4_MASK                               0x10
#define _CRCSHFTL_SHIFT5_POSN                               0x5
#define _CRCSHFTL_SHIFT5_POSITION                           0x5
#define _CRCSHFTL_SHIFT5_SIZE                               0x1
#define _CRCSHFTL_SHIFT5_LENGTH                             0x1
#define _CRCSHFTL_SHIFT5_MASK                               0x20
#define _CRCSHFTL_SHIFT6_POSN                               0x6
#define _CRCSHFTL_SHIFT6_POSITION                           0x6
#define _CRCSHFTL_SHIFT6_SIZE                               0x1
#define _CRCSHFTL_SHIFT6_LENGTH                             0x1
#define _CRCSHFTL_SHIFT6_MASK                               0x40
#define _CRCSHFTL_SHIFT7_POSN                               0x7
#define _CRCSHFTL_SHIFT7_POSITION                           0x7
#define _CRCSHFTL_SHIFT7_SIZE                               0x1
#define _CRCSHFTL_SHIFT7_LENGTH                             0x1
#define _CRCSHFTL_SHIFT7_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT0                 :1;
        unsigned SHIFT1                 :1;
        unsigned SHIFT2                 :1;
        unsigned SHIFT3                 :1;
        unsigned SHIFT4                 :1;
        unsigned SHIFT5                 :1;
        unsigned SHIFT6                 :1;
        unsigned SHIFT7                 :1;
    };
} CRCSHIFTLbits_t;
extern volatile CRCSHIFTLbits_t CRCSHIFTLbits __at(0x064);
// bitfield macros
#define _CRCSHIFTL_SHIFT_POSN                               0x0
#define _CRCSHIFTL_SHIFT_POSITION                           0x0
#define _CRCSHIFTL_SHIFT_SIZE                               0x8
#define _CRCSHIFTL_SHIFT_LENGTH                             0x8
#define _CRCSHIFTL_SHIFT_MASK                               0xFF
#define _CRCSHIFTL_SHIFT0_POSN                              0x0
#define _CRCSHIFTL_SHIFT0_POSITION                          0x0
#define _CRCSHIFTL_SHIFT0_SIZE                              0x1
#define _CRCSHIFTL_SHIFT0_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT0_MASK                              0x1
#define _CRCSHIFTL_SHIFT1_POSN                              0x1
#define _CRCSHIFTL_SHIFT1_POSITION                          0x1
#define _CRCSHIFTL_SHIFT1_SIZE                              0x1
#define _CRCSHIFTL_SHIFT1_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT1_MASK                              0x2
#define _CRCSHIFTL_SHIFT2_POSN                              0x2
#define _CRCSHIFTL_SHIFT2_POSITION                          0x2
#define _CRCSHIFTL_SHIFT2_SIZE                              0x1
#define _CRCSHIFTL_SHIFT2_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT2_MASK                              0x4
#define _CRCSHIFTL_SHIFT3_POSN                              0x3
#define _CRCSHIFTL_SHIFT3_POSITION                          0x3
#define _CRCSHIFTL_SHIFT3_SIZE                              0x1
#define _CRCSHIFTL_SHIFT3_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT3_MASK                              0x8
#define _CRCSHIFTL_SHIFT4_POSN                              0x4
#define _CRCSHIFTL_SHIFT4_POSITION                          0x4
#define _CRCSHIFTL_SHIFT4_SIZE                              0x1
#define _CRCSHIFTL_SHIFT4_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT4_MASK                              0x10
#define _CRCSHIFTL_SHIFT5_POSN                              0x5
#define _CRCSHIFTL_SHIFT5_POSITION                          0x5
#define _CRCSHIFTL_SHIFT5_SIZE                              0x1
#define _CRCSHIFTL_SHIFT5_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT5_MASK                              0x20
#define _CRCSHIFTL_SHIFT6_POSN                              0x6
#define _CRCSHIFTL_SHIFT6_POSITION                          0x6
#define _CRCSHIFTL_SHIFT6_SIZE                              0x1
#define _CRCSHIFTL_SHIFT6_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT6_MASK                              0x40
#define _CRCSHIFTL_SHIFT7_POSN                              0x7
#define _CRCSHIFTL_SHIFT7_POSITION                          0x7
#define _CRCSHIFTL_SHIFT7_SIZE                              0x1
#define _CRCSHIFTL_SHIFT7_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT7_MASK                              0x80

// Register: CRCXORL
#define CRCXORL CRCXORL
extern volatile unsigned char           CRCXORL             __at(0x064);
#ifndef _LIB_BUILD
asm("CRCXORL equ 064h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XOR                    :8;
    };
    struct {
        unsigned XOR0                   :1;
        unsigned XOR1                   :1;
        unsigned XOR2                   :1;
        unsigned XOR3                   :1;
        unsigned XOR4                   :1;
        unsigned XOR5                   :1;
        unsigned XOR6                   :1;
        unsigned XOR7                   :1;
    };
} CRCXORLbits_t;
extern volatile CRCXORLbits_t CRCXORLbits __at(0x064);
// bitfield macros
#define _CRCXORL_XOR_POSN                                   0x0
#define _CRCXORL_XOR_POSITION                               0x0
#define _CRCXORL_XOR_SIZE                                   0x8
#define _CRCXORL_XOR_LENGTH                                 0x8
#define _CRCXORL_XOR_MASK                                   0xFF
#define _CRCXORL_XOR0_POSN                                  0x0
#define _CRCXORL_XOR0_POSITION                              0x0
#define _CRCXORL_XOR0_SIZE                                  0x1
#define _CRCXORL_XOR0_LENGTH                                0x1
#define _CRCXORL_XOR0_MASK                                  0x1
#define _CRCXORL_XOR1_POSN                                  0x1
#define _CRCXORL_XOR1_POSITION                              0x1
#define _CRCXORL_XOR1_SIZE                                  0x1
#define _CRCXORL_XOR1_LENGTH                                0x1
#define _CRCXORL_XOR1_MASK                                  0x2
#define _CRCXORL_XOR2_POSN                                  0x2
#define _CRCXORL_XOR2_POSITION                              0x2
#define _CRCXORL_XOR2_SIZE                                  0x1
#define _CRCXORL_XOR2_LENGTH                                0x1
#define _CRCXORL_XOR2_MASK                                  0x4
#define _CRCXORL_XOR3_POSN                                  0x3
#define _CRCXORL_XOR3_POSITION                              0x3
#define _CRCXORL_XOR3_SIZE                                  0x1
#define _CRCXORL_XOR3_LENGTH                                0x1
#define _CRCXORL_XOR3_MASK                                  0x8
#define _CRCXORL_XOR4_POSN                                  0x4
#define _CRCXORL_XOR4_POSITION                              0x4
#define _CRCXORL_XOR4_SIZE                                  0x1
#define _CRCXORL_XOR4_LENGTH                                0x1
#define _CRCXORL_XOR4_MASK                                  0x10
#define _CRCXORL_XOR5_POSN                                  0x5
#define _CRCXORL_XOR5_POSITION                              0x5
#define _CRCXORL_XOR5_SIZE                                  0x1
#define _CRCXORL_XOR5_LENGTH                                0x1
#define _CRCXORL_XOR5_MASK                                  0x20
#define _CRCXORL_XOR6_POSN                                  0x6
#define _CRCXORL_XOR6_POSITION                              0x6
#define _CRCXORL_XOR6_SIZE                                  0x1
#define _CRCXORL_XOR6_LENGTH                                0x1
#define _CRCXORL_XOR6_MASK                                  0x40
#define _CRCXORL_XOR7_POSN                                  0x7
#define _CRCXORL_XOR7_POSITION                              0x7
#define _CRCXORL_XOR7_SIZE                                  0x1
#define _CRCXORL_XOR7_LENGTH                                0x1
#define _CRCXORL_XOR7_MASK                                  0x80

// Register: CRCOUTH
#define CRCOUTH CRCOUTH
extern volatile unsigned char           CRCOUTH             __at(0x065);
#ifndef _LIB_BUILD
asm("CRCOUTH equ 065h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT8                   :1;
        unsigned OUT9                   :1;
        unsigned OUT10                  :1;
        unsigned OUT11                  :1;
        unsigned OUT12                  :1;
        unsigned OUT13                  :1;
        unsigned OUT14                  :1;
        unsigned OUT15                  :1;
    };
} CRCOUTHbits_t;
extern volatile CRCOUTHbits_t CRCOUTHbits __at(0x065);
// bitfield macros
#define _CRCOUTH_OUT_POSN                                   0x0
#define _CRCOUTH_OUT_POSITION                               0x0
#define _CRCOUTH_OUT_SIZE                                   0x8
#define _CRCOUTH_OUT_LENGTH                                 0x8
#define _CRCOUTH_OUT_MASK                                   0xFF
#define _CRCOUTH_OUT8_POSN                                  0x0
#define _CRCOUTH_OUT8_POSITION                              0x0
#define _CRCOUTH_OUT8_SIZE                                  0x1
#define _CRCOUTH_OUT8_LENGTH                                0x1
#define _CRCOUTH_OUT8_MASK                                  0x1
#define _CRCOUTH_OUT9_POSN                                  0x1
#define _CRCOUTH_OUT9_POSITION                              0x1
#define _CRCOUTH_OUT9_SIZE                                  0x1
#define _CRCOUTH_OUT9_LENGTH                                0x1
#define _CRCOUTH_OUT9_MASK                                  0x2
#define _CRCOUTH_OUT10_POSN                                 0x2
#define _CRCOUTH_OUT10_POSITION                             0x2
#define _CRCOUTH_OUT10_SIZE                                 0x1
#define _CRCOUTH_OUT10_LENGTH                               0x1
#define _CRCOUTH_OUT10_MASK                                 0x4
#define _CRCOUTH_OUT11_POSN                                 0x3
#define _CRCOUTH_OUT11_POSITION                             0x3
#define _CRCOUTH_OUT11_SIZE                                 0x1
#define _CRCOUTH_OUT11_LENGTH                               0x1
#define _CRCOUTH_OUT11_MASK                                 0x8
#define _CRCOUTH_OUT12_POSN                                 0x4
#define _CRCOUTH_OUT12_POSITION                             0x4
#define _CRCOUTH_OUT12_SIZE                                 0x1
#define _CRCOUTH_OUT12_LENGTH                               0x1
#define _CRCOUTH_OUT12_MASK                                 0x10
#define _CRCOUTH_OUT13_POSN                                 0x5
#define _CRCOUTH_OUT13_POSITION                             0x5
#define _CRCOUTH_OUT13_SIZE                                 0x1
#define _CRCOUTH_OUT13_LENGTH                               0x1
#define _CRCOUTH_OUT13_MASK                                 0x20
#define _CRCOUTH_OUT14_POSN                                 0x6
#define _CRCOUTH_OUT14_POSITION                             0x6
#define _CRCOUTH_OUT14_SIZE                                 0x1
#define _CRCOUTH_OUT14_LENGTH                               0x1
#define _CRCOUTH_OUT14_MASK                                 0x40
#define _CRCOUTH_OUT15_POSN                                 0x7
#define _CRCOUTH_OUT15_POSITION                             0x7
#define _CRCOUTH_OUT15_SIZE                                 0x1
#define _CRCOUTH_OUT15_LENGTH                               0x1
#define _CRCOUTH_OUT15_MASK                                 0x80

// Register: CRCSHFTH
#define CRCSHFTH CRCSHFTH
extern volatile unsigned char           CRCSHFTH            __at(0x065);
#ifndef _LIB_BUILD
asm("CRCSHFTH equ 065h");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTH           __at(0x065);
#ifndef _LIB_BUILD
asm("CRCSHIFTH equ 065h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT8                 :1;
        unsigned SHIFT9                 :1;
        unsigned SHIFT10                :1;
        unsigned SHIFT11                :1;
        unsigned SHIFT12                :1;
        unsigned SHIFT13                :1;
        unsigned SHIFT14                :1;
        unsigned SHIFT15                :1;
    };
} CRCSHFTHbits_t;
extern volatile CRCSHFTHbits_t CRCSHFTHbits __at(0x065);
// bitfield macros
#define _CRCSHFTH_SHIFT_POSN                                0x0
#define _CRCSHFTH_SHIFT_POSITION                            0x0
#define _CRCSHFTH_SHIFT_SIZE                                0x8
#define _CRCSHFTH_SHIFT_LENGTH                              0x8
#define _CRCSHFTH_SHIFT_MASK                                0xFF
#define _CRCSHFTH_SHIFT8_POSN                               0x0
#define _CRCSHFTH_SHIFT8_POSITION                           0x0
#define _CRCSHFTH_SHIFT8_SIZE                               0x1
#define _CRCSHFTH_SHIFT8_LENGTH                             0x1
#define _CRCSHFTH_SHIFT8_MASK                               0x1
#define _CRCSHFTH_SHIFT9_POSN                               0x1
#define _CRCSHFTH_SHIFT9_POSITION                           0x1
#define _CRCSHFTH_SHIFT9_SIZE                               0x1
#define _CRCSHFTH_SHIFT9_LENGTH                             0x1
#define _CRCSHFTH_SHIFT9_MASK                               0x2
#define _CRCSHFTH_SHIFT10_POSN                              0x2
#define _CRCSHFTH_SHIFT10_POSITION                          0x2
#define _CRCSHFTH_SHIFT10_SIZE                              0x1
#define _CRCSHFTH_SHIFT10_LENGTH                            0x1
#define _CRCSHFTH_SHIFT10_MASK                              0x4
#define _CRCSHFTH_SHIFT11_POSN                              0x3
#define _CRCSHFTH_SHIFT11_POSITION                          0x3
#define _CRCSHFTH_SHIFT11_SIZE                              0x1
#define _CRCSHFTH_SHIFT11_LENGTH                            0x1
#define _CRCSHFTH_SHIFT11_MASK                              0x8
#define _CRCSHFTH_SHIFT12_POSN                              0x4
#define _CRCSHFTH_SHIFT12_POSITION                          0x4
#define _CRCSHFTH_SHIFT12_SIZE                              0x1
#define _CRCSHFTH_SHIFT12_LENGTH                            0x1
#define _CRCSHFTH_SHIFT12_MASK                              0x10
#define _CRCSHFTH_SHIFT13_POSN                              0x5
#define _CRCSHFTH_SHIFT13_POSITION                          0x5
#define _CRCSHFTH_SHIFT13_SIZE                              0x1
#define _CRCSHFTH_SHIFT13_LENGTH                            0x1
#define _CRCSHFTH_SHIFT13_MASK                              0x20
#define _CRCSHFTH_SHIFT14_POSN                              0x6
#define _CRCSHFTH_SHIFT14_POSITION                          0x6
#define _CRCSHFTH_SHIFT14_SIZE                              0x1
#define _CRCSHFTH_SHIFT14_LENGTH                            0x1
#define _CRCSHFTH_SHIFT14_MASK                              0x40
#define _CRCSHFTH_SHIFT15_POSN                              0x7
#define _CRCSHFTH_SHIFT15_POSITION                          0x7
#define _CRCSHFTH_SHIFT15_SIZE                              0x1
#define _CRCSHFTH_SHIFT15_LENGTH                            0x1
#define _CRCSHFTH_SHIFT15_MASK                              0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT8                 :1;
        unsigned SHIFT9                 :1;
        unsigned SHIFT10                :1;
        unsigned SHIFT11                :1;
        unsigned SHIFT12                :1;
        unsigned SHIFT13                :1;
        unsigned SHIFT14                :1;
        unsigned SHIFT15                :1;
    };
} CRCSHIFTHbits_t;
