garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: I3C2ERRIE1
#define I3C2ERRIE1 I3C2ERRIE1
extern volatile unsigned char           I3C2ERRIE1          __at(0x0C4);
#ifndef _LIB_BUILD
asm("I3C2ERRIE1 equ 0C4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXREIE                 :1;
        unsigned TXWEIE                 :1;
        unsigned MWLOEIE                :1;
        unsigned ABEIE                  :1;
    };
} I3C2ERRIE1bits_t;
extern volatile I3C2ERRIE1bits_t I3C2ERRIE1bits __at(0x0C4);
// bitfield macros
#define _I3C2ERRIE1_RXREIE_POSN                             0x0
#define _I3C2ERRIE1_RXREIE_POSITION                         0x0
#define _I3C2ERRIE1_RXREIE_SIZE                             0x1
#define _I3C2ERRIE1_RXREIE_LENGTH                           0x1
#define _I3C2ERRIE1_RXREIE_MASK                             0x1
#define _I3C2ERRIE1_TXWEIE_POSN                             0x1
#define _I3C2ERRIE1_TXWEIE_POSITION                         0x1
#define _I3C2ERRIE1_TXWEIE_SIZE                             0x1
#define _I3C2ERRIE1_TXWEIE_LENGTH                           0x1
#define _I3C2ERRIE1_TXWEIE_MASK                             0x2
#define _I3C2ERRIE1_MWLOEIE_POSN                            0x2
#define _I3C2ERRIE1_MWLOEIE_POSITION                        0x2
#define _I3C2ERRIE1_MWLOEIE_SIZE                            0x1
#define _I3C2ERRIE1_MWLOEIE_LENGTH                          0x1
#define _I3C2ERRIE1_MWLOEIE_MASK                            0x4
#define _I3C2ERRIE1_ABEIE_POSN                              0x3
#define _I3C2ERRIE1_ABEIE_POSITION                          0x3
#define _I3C2ERRIE1_ABEIE_SIZE                              0x1
#define _I3C2ERRIE1_ABEIE_LENGTH                            0x1
#define _I3C2ERRIE1_ABEIE_MASK                              0x8

// Register: I3C2BIDL
#define I3C2BIDL I3C2BIDL
extern volatile unsigned short          I3C2BIDL            __at(0x0C5);
#ifndef _LIB_BUILD
asm("I3C2BIDL equ 0C5h");
#endif

// Register: I3C2BIDLL
#define I3C2BIDLL I3C2BIDLL
extern volatile unsigned char           I3C2BIDLL           __at(0x0C5);
#ifndef _LIB_BUILD
asm("I3C2BIDLL equ 0C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIDLL                  :8;
    };
} I3C2BIDLLbits_t;
extern volatile I3C2BIDLLbits_t I3C2BIDLLbits __at(0x0C5);
// bitfield macros
#define _I3C2BIDLL_BIDLL_POSN                               0x0
#define _I3C2BIDLL_BIDLL_POSITION                           0x0
#define _I3C2BIDLL_BIDLL_SIZE                               0x8
#define _I3C2BIDLL_BIDLL_LENGTH                             0x8
#define _I3C2BIDLL_BIDLL_MASK                               0xFF

// Register: I3C2BIDLH
#define I3C2BIDLH I3C2BIDLH
extern volatile unsigned char           I3C2BIDLH           __at(0x0C6);
#ifndef _LIB_BUILD
asm("I3C2BIDLH equ 0C6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIDLH                  :8;
    };
} I3C2BIDLHbits_t;
extern volatile I3C2BIDLHbits_t I3C2BIDLHbits __at(0x0C6);
// bitfield macros
#define _I3C2BIDLH_BIDLH_POSN                               0x0
#define _I3C2BIDLH_BIDLH_POSITION                           0x0
#define _I3C2BIDLH_BIDLH_SIZE                               0x8
#define _I3C2BIDLH_BIDLH_LENGTH                             0x8
#define _I3C2BIDLH_BIDLH_MASK                               0xFF

// Register: I3C2BAVL
#define I3C2BAVL I3C2BAVL
extern volatile unsigned char           I3C2BAVL            __at(0x0C7);
#ifndef _LIB_BUILD
asm("I3C2BAVL equ 0C7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAVL                   :8;
    };
} I3C2BAVLbits_t;
extern volatile I3C2BAVLbits_t I3C2BAVLbits __at(0x0C7);
// bitfield macros
#define _I3C2BAVL_BAVL_POSN                                 0x0
#define _I3C2BAVL_BAVL_POSITION                             0x0
#define _I3C2BAVL_BAVL_SIZE                                 0x8
#define _I3C2BAVL_BAVL_LENGTH                               0x8
#define _I3C2BAVL_BAVL_MASK                                 0xFF

// Register: I3C2BTO
#define I3C2BTO I3C2BTO
extern volatile unsigned short          I3C2BTO             __at(0x0C8);
#ifndef _LIB_BUILD
asm("I3C2BTO equ 0C8h");
#endif

// Register: I3C2BTOL
#define I3C2BTOL I3C2BTOL
extern volatile unsigned char           I3C2BTOL            __at(0x0C8);
#ifndef _LIB_BUILD
asm("I3C2BTOL equ 0C8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOL                   :8;
    };
} I3C2BTOLbits_t;
extern volatile I3C2BTOLbits_t I3C2BTOLbits __at(0x0C8);
// bitfield macros
#define _I3C2BTOL_BTOL_POSN                                 0x0
#define _I3C2BTOL_BTOL_POSITION                             0x0
#define _I3C2BTOL_BTOL_SIZE                                 0x8
#define _I3C2BTOL_BTOL_LENGTH                               0x8
#define _I3C2BTOL_BTOL_MASK                                 0xFF

// Register: I3C2BTOH
#define I3C2BTOH I3C2BTOH
extern volatile unsigned char           I3C2BTOH            __at(0x0C9);
#ifndef _LIB_BUILD
asm("I3C2BTOH equ 0C9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOH                   :8;
    };
} I3C2BTOHbits_t;
extern volatile I3C2BTOHbits_t I3C2BTOHbits __at(0x0C9);
// bitfield macros
#define _I3C2BTOH_BTOH_POSN                                 0x0
#define _I3C2BTOH_BTOH_POSITION                             0x0
#define _I3C2BTOH_BTOH_SIZE                                 0x8
#define _I3C2BTOH_BTOH_LENGTH                               0x8
#define _I3C2BTOH_BTOH_MASK                                 0xFF

// Register: I3C2IBIMDB
#define I3C2IBIMDB I3C2IBIMDB
extern volatile unsigned char           I3C2IBIMDB          __at(0x0CA);
#ifndef _LIB_BUILD
asm("I3C2IBIMDB equ 0CAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIMDB                 :8;
    };
    struct {
        unsigned IBIMDB_4_0             :5;
        unsigned IBIMDB_7_5             :3;
    };
} I3C2IBIMDBbits_t;
extern volatile I3C2IBIMDBbits_t I3C2IBIMDBbits __at(0x0CA);
// bitfield macros
#define _I3C2IBIMDB_IBIMDB_POSN                             0x0
#define _I3C2IBIMDB_IBIMDB_POSITION                         0x0
#define _I3C2IBIMDB_IBIMDB_SIZE                             0x8
#define _I3C2IBIMDB_IBIMDB_LENGTH                           0x8
#define _I3C2IBIMDB_IBIMDB_MASK                             0xFF
#define _I3C2IBIMDB_IBIMDB_4_0_POSN                         0x0
#define _I3C2IBIMDB_IBIMDB_4_0_POSITION                     0x0
#define _I3C2IBIMDB_IBIMDB_4_0_SIZE                         0x5
#define _I3C2IBIMDB_IBIMDB_4_0_LENGTH                       0x5
#define _I3C2IBIMDB_IBIMDB_4_0_MASK                         0x1F
#define _I3C2IBIMDB_IBIMDB_7_5_POSN                         0x5
#define _I3C2IBIMDB_IBIMDB_7_5_POSITION                     0x5
#define _I3C2IBIMDB_IBIMDB_7_5_SIZE                         0x3
#define _I3C2IBIMDB_IBIMDB_7_5_LENGTH                       0x3
#define _I3C2IBIMDB_IBIMDB_7_5_MASK                         0xE0

// Register: I3C2RETRY
#define I3C2RETRY I3C2RETRY
extern volatile unsigned char           I3C2RETRY           __at(0x0CB);
#ifndef _LIB_BUILD
asm("I3C2RETRY equ 0CBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RETRY                  :8;
    };
} I3C2RETRYbits_t;
extern volatile I3C2RETRYbits_t I3C2RETRYbits __at(0x0CB);
// bitfield macros
#define _I3C2RETRY_RETRY_POSN                               0x0
#define _I3C2RETRY_RETRY_POSITION                           0x0
#define _I3C2RETRY_RETRY_SIZE                               0x8
#define _I3C2RETRY_RETRY_LENGTH                             0x8
#define _I3C2RETRY_RETRY_MASK                               0xFF

// Register: I3C2FEAT
#define I3C2FEAT I3C2FEAT
extern volatile unsigned char           I3C2FEAT            __at(0x0CC);
#ifndef _LIB_BUILD
asm("I3C2FEAT equ 0CCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HJCAP                  :1;
        unsigned HDRCAP                 :1;
    };
} I3C2FEATbits_t;
extern volatile I3C2FEATbits_t I3C2FEATbits __at(0x0CC);
// bitfield macros
#define _I3C2FEAT_HJCAP_POSN                                0x0
#define _I3C2FEAT_HJCAP_POSITION                            0x0
#define _I3C2FEAT_HJCAP_SIZE                                0x1
#define _I3C2FEAT_HJCAP_LENGTH                              0x1
#define _I3C2FEAT_HJCAP_MASK                                0x1
#define _I3C2FEAT_HDRCAP_POSN                               0x1
#define _I3C2FEAT_HDRCAP_POSITION                           0x1
#define _I3C2FEAT_HDRCAP_SIZE                               0x1
#define _I3C2FEAT_HDRCAP_LENGTH                             0x1
#define _I3C2FEAT_HDRCAP_MASK                               0x2

// Register: I3C2SADR
#define I3C2SADR I3C2SADR
extern volatile unsigned char           I3C2SADR            __at(0x0CD);
#ifndef _LIB_BUILD
asm("I3C2SADR equ 0CDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SADR                   :7;
    };
} I3C2SADRbits_t;
extern volatile I3C2SADRbits_t I3C2SADRbits __at(0x0CD);
// bitfield macros
#define _I3C2SADR_SADR_POSN                                 0x0
#define _I3C2SADR_SADR_POSITION                             0x0
#define _I3C2SADR_SADR_SIZE                                 0x7
#define _I3C2SADR_SADR_LENGTH                               0x7
#define _I3C2SADR_SADR_MASK                                 0x7F

// Register: I3C2DADR
#define I3C2DADR I3C2DADR
extern volatile unsigned char           I3C2DADR            __at(0x0CE);
#ifndef _LIB_BUILD
asm("I3C2DADR equ 0CEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DADR                   :7;
    };
} I3C2DADRbits_t;
extern volatile I3C2DADRbits_t I3C2DADRbits __at(0x0CE);
// bitfield macros
#define _I3C2DADR_DADR_POSN                                 0x0
#define _I3C2DADR_DADR_POSITION                             0x0
#define _I3C2DADR_DADR_SIZE                                 0x7
#define _I3C2DADR_DADR_LENGTH                               0x7
#define _I3C2DADR_DADR_MASK                                 0x7F

// Register: I3C2EC
#define I3C2EC I3C2EC
extern volatile unsigned char           I3C2EC              __at(0x0CF);
#ifndef _LIB_BUILD
asm("I3C2EC equ 0CFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIEN                  :1;
        unsigned CREN                   :1;
        unsigned EC2                    :1;
        unsigned HJEN                   :1;
        unsigned EC_7_4                 :4;
    };
} I3C2ECbits_t;
extern volatile I3C2ECbits_t I3C2ECbits __at(0x0CF);
// bitfield macros
#define _I3C2EC_IBIEN_POSN                                  0x0
#define _I3C2EC_IBIEN_POSITION                              0x0
#define _I3C2EC_IBIEN_SIZE                                  0x1
#define _I3C2EC_IBIEN_LENGTH                                0x1
#define _I3C2EC_IBIEN_MASK                                  0x1
#define _I3C2EC_CREN_POSN                                   0x1
#define _I3C2EC_CREN_POSITION                               0x1
#define _I3C2EC_CREN_SIZE                                   0x1
#define _I3C2EC_CREN_LENGTH                                 0x1
#define _I3C2EC_CREN_MASK                                   0x2
#define _I3C2EC_EC2_POSN                                    0x2
#define _I3C2EC_EC2_POSITION                                0x2
#define _I3C2EC_EC2_SIZE                                    0x1
#define _I3C2EC_EC2_LENGTH                                  0x1
#define _I3C2EC_EC2_MASK                                    0x4
#define _I3C2EC_HJEN_POSN                                   0x3
#define _I3C2EC_HJEN_POSITION                               0x3
#define _I3C2EC_HJEN_SIZE                                   0x1
#define _I3C2EC_HJEN_LENGTH                                 0x1
#define _I3C2EC_HJEN_MASK                                   0x8
#define _I3C2EC_EC_7_4_POSN                                 0x4
#define _I3C2EC_EC_7_4_POSITION                             0x4
#define _I3C2EC_EC_7_4_SIZE                                 0x4
#define _I3C2EC_EC_7_4_LENGTH                               0x4
#define _I3C2EC_EC_7_4_MASK                                 0xF0

// Register: I3C2MWL
#define I3C2MWL I3C2MWL
extern volatile unsigned short          I3C2MWL             __at(0x0D0);
#ifndef _LIB_BUILD
asm("I3C2MWL equ 0D0h");
#endif

// Register: I3C2MWLL
#define I3C2MWLL I3C2MWLL
extern volatile unsigned char           I3C2MWLL            __at(0x0D0);
#ifndef _LIB_BUILD
asm("I3C2MWLL equ 0D0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MWLL                   :8;
    };
} I3C2MWLLbits_t;
