garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile I3C2MWLLbits_t I3C2MWLLbits __at(0x0D0);
// bitfield macros
#define _I3C2MWLL_MWLL_POSN                                 0x0
#define _I3C2MWLL_MWLL_POSITION                             0x0
#define _I3C2MWLL_MWLL_SIZE                                 0x8
#define _I3C2MWLL_MWLL_LENGTH                               0x8
#define _I3C2MWLL_MWLL_MASK                                 0xFF

// Register: I3C2MWLH
#define I3C2MWLH I3C2MWLH
extern volatile unsigned char           I3C2MWLH            __at(0x0D1);
#ifndef _LIB_BUILD
asm("I3C2MWLH equ 0D1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MWLH                   :8;
    };
} I3C2MWLHbits_t;
extern volatile I3C2MWLHbits_t I3C2MWLHbits __at(0x0D1);
// bitfield macros
#define _I3C2MWLH_MWLH_POSN                                 0x0
#define _I3C2MWLH_MWLH_POSITION                             0x0
#define _I3C2MWLH_MWLH_SIZE                                 0x8
#define _I3C2MWLH_MWLH_LENGTH                               0x8
#define _I3C2MWLH_MWLH_MASK                                 0xFF

// Register: I3C2MRL
#define I3C2MRL I3C2MRL
extern volatile unsigned short          I3C2MRL             __at(0x0D2);
#ifndef _LIB_BUILD
asm("I3C2MRL equ 0D2h");
#endif

// Register: I3C2MRLL
#define I3C2MRLL I3C2MRLL
extern volatile unsigned char           I3C2MRLL            __at(0x0D2);
#ifndef _LIB_BUILD
asm("I3C2MRLL equ 0D2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRLL                   :8;
    };
} I3C2MRLLbits_t;
extern volatile I3C2MRLLbits_t I3C2MRLLbits __at(0x0D2);
// bitfield macros
#define _I3C2MRLL_MRLL_POSN                                 0x0
#define _I3C2MRLL_MRLL_POSITION                             0x0
#define _I3C2MRLL_MRLL_SIZE                                 0x8
#define _I3C2MRLL_MRLL_LENGTH                               0x8
#define _I3C2MRLL_MRLL_MASK                                 0xFF

// Register: I3C2MRLH
#define I3C2MRLH I3C2MRLH
extern volatile unsigned char           I3C2MRLH            __at(0x0D3);
#ifndef _LIB_BUILD
asm("I3C2MRLH equ 0D3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRLH                   :8;
    };
} I3C2MRLHbits_t;
extern volatile I3C2MRLHbits_t I3C2MRLHbits __at(0x0D3);
// bitfield macros
#define _I3C2MRLH_MRLH_POSN                                 0x0
#define _I3C2MRLH_MRLH_POSITION                             0x0
#define _I3C2MRLH_MRLH_SIZE                                 0x8
#define _I3C2MRLH_MRLH_LENGTH                               0x8
#define _I3C2MRLH_MRLH_MASK                                 0xFF

// Register: I3C2IBIPSZ
#define I3C2IBIPSZ I3C2IBIPSZ
extern volatile unsigned char           I3C2IBIPSZ          __at(0x0D4);
#ifndef _LIB_BUILD
asm("I3C2IBIPSZ equ 0D4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIPSZ                 :8;
    };
} I3C2IBIPSZbits_t;
extern volatile I3C2IBIPSZbits_t I3C2IBIPSZbits __at(0x0D4);
// bitfield macros
#define _I3C2IBIPSZ_IBIPSZ_POSN                             0x0
#define _I3C2IBIPSZ_IBIPSZ_POSITION                         0x0
#define _I3C2IBIPSZ_IBIPSZ_SIZE                             0x8
#define _I3C2IBIPSZ_IBIPSZ_LENGTH                           0x8
#define _I3C2IBIPSZ_IBIPSZ_MASK                             0xFF

// Register: I3C2PID0
#define I3C2PID0 I3C2PID0
extern volatile unsigned char           I3C2PID0            __at(0x0D5);
#ifndef _LIB_BUILD
asm("I3C2PID0 equ 0D5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned PID4                   :1;
        unsigned PID5                   :1;
        unsigned PID6                   :1;
        unsigned PID7                   :1;
    };
    struct {
        unsigned PID_7_0                :8;
    };
} I3C2PID0bits_t;
extern volatile I3C2PID0bits_t I3C2PID0bits __at(0x0D5);
// bitfield macros
#define _I3C2PID0_PID0_POSN                                 0x0
#define _I3C2PID0_PID0_POSITION                             0x0
#define _I3C2PID0_PID0_SIZE                                 0x1
#define _I3C2PID0_PID0_LENGTH                               0x1
#define _I3C2PID0_PID0_MASK                                 0x1
#define _I3C2PID0_PID1_POSN                                 0x1
#define _I3C2PID0_PID1_POSITION                             0x1
#define _I3C2PID0_PID1_SIZE                                 0x1
#define _I3C2PID0_PID1_LENGTH                               0x1
#define _I3C2PID0_PID1_MASK                                 0x2
#define _I3C2PID0_PID2_POSN                                 0x2
#define _I3C2PID0_PID2_POSITION                             0x2
#define _I3C2PID0_PID2_SIZE                                 0x1
#define _I3C2PID0_PID2_LENGTH                               0x1
#define _I3C2PID0_PID2_MASK                                 0x4
#define _I3C2PID0_PID3_POSN                                 0x3
#define _I3C2PID0_PID3_POSITION                             0x3
#define _I3C2PID0_PID3_SIZE                                 0x1
#define _I3C2PID0_PID3_LENGTH                               0x1
#define _I3C2PID0_PID3_MASK                                 0x8
#define _I3C2PID0_PID4_POSN                                 0x4
#define _I3C2PID0_PID4_POSITION                             0x4
#define _I3C2PID0_PID4_SIZE                                 0x1
#define _I3C2PID0_PID4_LENGTH                               0x1
#define _I3C2PID0_PID4_MASK                                 0x10
#define _I3C2PID0_PID5_POSN                                 0x5
#define _I3C2PID0_PID5_POSITION                             0x5
#define _I3C2PID0_PID5_SIZE                                 0x1
#define _I3C2PID0_PID5_LENGTH                               0x1
#define _I3C2PID0_PID5_MASK                                 0x20
#define _I3C2PID0_PID6_POSN                                 0x6
#define _I3C2PID0_PID6_POSITION                             0x6
#define _I3C2PID0_PID6_SIZE                                 0x1
#define _I3C2PID0_PID6_LENGTH                               0x1
#define _I3C2PID0_PID6_MASK                                 0x40
#define _I3C2PID0_PID7_POSN                                 0x7
#define _I3C2PID0_PID7_POSITION                             0x7
#define _I3C2PID0_PID7_SIZE                                 0x1
#define _I3C2PID0_PID7_LENGTH                               0x1
#define _I3C2PID0_PID7_MASK                                 0x80
#define _I3C2PID0_PID_7_0_POSN                              0x0
#define _I3C2PID0_PID_7_0_POSITION                          0x0
#define _I3C2PID0_PID_7_0_SIZE                              0x8
#define _I3C2PID0_PID_7_0_LENGTH                            0x8
#define _I3C2PID0_PID_7_0_MASK                              0xFF

// Register: I3C2PID1
#define I3C2PID1 I3C2PID1
extern volatile unsigned char           I3C2PID1            __at(0x0D6);
#ifndef _LIB_BUILD
asm("I3C2PID1 equ 0D6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID8                   :1;
        unsigned PID9                   :1;
        unsigned PID10                  :1;
        unsigned PID11                  :1;
        unsigned PID12                  :1;
        unsigned PID13                  :1;
        unsigned PID14                  :1;
        unsigned PID15                  :1;
    };
    struct {
        unsigned PID_11_8               :4;
        unsigned PID_15_12              :4;
    };
} I3C2PID1bits_t;
extern volatile I3C2PID1bits_t I3C2PID1bits __at(0x0D6);
// bitfield macros
#define _I3C2PID1_PID8_POSN                                 0x0
#define _I3C2PID1_PID8_POSITION                             0x0
#define _I3C2PID1_PID8_SIZE                                 0x1
#define _I3C2PID1_PID8_LENGTH                               0x1
#define _I3C2PID1_PID8_MASK                                 0x1
#define _I3C2PID1_PID9_POSN                                 0x1
#define _I3C2PID1_PID9_POSITION                             0x1
#define _I3C2PID1_PID9_SIZE                                 0x1
#define _I3C2PID1_PID9_LENGTH                               0x1
#define _I3C2PID1_PID9_MASK                                 0x2
#define _I3C2PID1_PID10_POSN                                0x2
#define _I3C2PID1_PID10_POSITION                            0x2
#define _I3C2PID1_PID10_SIZE                                0x1
#define _I3C2PID1_PID10_LENGTH                              0x1
#define _I3C2PID1_PID10_MASK                                0x4
#define _I3C2PID1_PID11_POSN                                0x3
#define _I3C2PID1_PID11_POSITION                            0x3
#define _I3C2PID1_PID11_SIZE                                0x1
#define _I3C2PID1_PID11_LENGTH                              0x1
#define _I3C2PID1_PID11_MASK                                0x8
#define _I3C2PID1_PID12_POSN                                0x4
#define _I3C2PID1_PID12_POSITION                            0x4
#define _I3C2PID1_PID12_SIZE                                0x1
#define _I3C2PID1_PID12_LENGTH                              0x1
#define _I3C2PID1_PID12_MASK                                0x10
#define _I3C2PID1_PID13_POSN                                0x5
#define _I3C2PID1_PID13_POSITION                            0x5
#define _I3C2PID1_PID13_SIZE                                0x1
#define _I3C2PID1_PID13_LENGTH                              0x1
#define _I3C2PID1_PID13_MASK                                0x20
#define _I3C2PID1_PID14_POSN                                0x6
#define _I3C2PID1_PID14_POSITION                            0x6
#define _I3C2PID1_PID14_SIZE                                0x1
#define _I3C2PID1_PID14_LENGTH                              0x1
#define _I3C2PID1_PID14_MASK                                0x40
#define _I3C2PID1_PID15_POSN                                0x7
#define _I3C2PID1_PID15_POSITION                            0x7
#define _I3C2PID1_PID15_SIZE                                0x1
#define _I3C2PID1_PID15_LENGTH                              0x1
#define _I3C2PID1_PID15_MASK                                0x80
#define _I3C2PID1_PID_11_8_POSN                             0x0
#define _I3C2PID1_PID_11_8_POSITION                         0x0
#define _I3C2PID1_PID_11_8_SIZE                             0x4
#define _I3C2PID1_PID_11_8_LENGTH                           0x4
#define _I3C2PID1_PID_11_8_MASK                             0xF
#define _I3C2PID1_PID_15_12_POSN                            0x4
#define _I3C2PID1_PID_15_12_POSITION                        0x4
#define _I3C2PID1_PID_15_12_SIZE                            0x4
#define _I3C2PID1_PID_15_12_LENGTH                          0x4
#define _I3C2PID1_PID_15_12_MASK                            0xF0

// Register: I3C2PID2
#define I3C2PID2 I3C2PID2
extern volatile unsigned char           I3C2PID2            __at(0x0D7);
#ifndef _LIB_BUILD
asm("I3C2PID2 equ 0D7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID16                  :1;
        unsigned PID17                  :1;
        unsigned PID18                  :1;
        unsigned PID19                  :1;
        unsigned PID20                  :1;
        unsigned PID21                  :1;
        unsigned PID22                  :1;
        unsigned PID23                  :1;
    };
    struct {
        unsigned PID_23_16              :8;
    };
} I3C2PID2bits_t;
extern volatile I3C2PID2bits_t I3C2PID2bits __at(0x0D7);
// bitfield macros
#define _I3C2PID2_PID16_POSN                                0x0
#define _I3C2PID2_PID16_POSITION                            0x0
#define _I3C2PID2_PID16_SIZE                                0x1
#define _I3C2PID2_PID16_LENGTH                              0x1
#define _I3C2PID2_PID16_MASK                                0x1
#define _I3C2PID2_PID17_POSN                                0x1
#define _I3C2PID2_PID17_POSITION                            0x1
#define _I3C2PID2_PID17_SIZE                                0x1
#define _I3C2PID2_PID17_LENGTH                              0x1
#define _I3C2PID2_PID17_MASK                                0x2
#define _I3C2PID2_PID18_POSN                                0x2
#define _I3C2PID2_PID18_POSITION                            0x2
#define _I3C2PID2_PID18_SIZE                                0x1
#define _I3C2PID2_PID18_LENGTH                              0x1
#define _I3C2PID2_PID18_MASK                                0x4
#define _I3C2PID2_PID19_POSN                                0x3
#define _I3C2PID2_PID19_POSITION                            0x3
#define _I3C2PID2_PID19_SIZE                                0x1
#define _I3C2PID2_PID19_LENGTH                              0x1
#define _I3C2PID2_PID19_MASK                                0x8
#define _I3C2PID2_PID20_POSN                                0x4
#define _I3C2PID2_PID20_POSITION                            0x4
#define _I3C2PID2_PID20_SIZE                                0x1
#define _I3C2PID2_PID20_LENGTH                              0x1
#define _I3C2PID2_PID20_MASK                                0x10
#define _I3C2PID2_PID21_POSN                                0x5
#define _I3C2PID2_PID21_POSITION                            0x5
#define _I3C2PID2_PID21_SIZE                                0x1
#define _I3C2PID2_PID21_LENGTH                              0x1
#define _I3C2PID2_PID21_MASK                                0x20
#define _I3C2PID2_PID22_POSN                                0x6
#define _I3C2PID2_PID22_POSITION                            0x6
#define _I3C2PID2_PID22_SIZE                                0x1
#define _I3C2PID2_PID22_LENGTH                              0x1
#define _I3C2PID2_PID22_MASK                                0x40
#define _I3C2PID2_PID23_POSN                                0x7
#define _I3C2PID2_PID23_POSITION                            0x7
#define _I3C2PID2_PID23_SIZE                                0x1
#define _I3C2PID2_PID23_LENGTH                              0x1
#define _I3C2PID2_PID23_MASK                                0x80
#define _I3C2PID2_PID_23_16_POSN                            0x0
#define _I3C2PID2_PID_23_16_POSITION                        0x0
#define _I3C2PID2_PID_23_16_SIZE                            0x8
#define _I3C2PID2_PID_23_16_LENGTH                          0x8
#define _I3C2PID2_PID_23_16_MASK                            0xFF

// Register: I3C2PID3
#define I3C2PID3 I3C2PID3
extern volatile unsigned char           I3C2PID3            __at(0x0D8);
#ifndef _LIB_BUILD
asm("I3C2PID3 equ 0D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID24                  :1;
        unsigned PID25                  :1;
        unsigned PID26                  :1;
        unsigned PID27                  :1;
        unsigned PID28                  :1;
        unsigned PID29                  :1;
        unsigned PID30                  :1;
        unsigned PID31                  :1;
    };
    struct {
        unsigned PID_31_24              :8;
    };
} I3C2PID3bits_t;
extern volatile I3C2PID3bits_t I3C2PID3bits __at(0x0D8);
// bitfield macros
#define _I3C2PID3_PID24_POSN                                0x0
#define _I3C2PID3_PID24_POSITION                            0x0
#define _I3C2PID3_PID24_SIZE                                0x1
#define _I3C2PID3_PID24_LENGTH                              0x1
#define _I3C2PID3_PID24_MASK                                0x1
#define _I3C2PID3_PID25_POSN                                0x1
#define _I3C2PID3_PID25_POSITION                            0x1
#define _I3C2PID3_PID25_SIZE                                0x1
#define _I3C2PID3_PID25_LENGTH                              0x1
#define _I3C2PID3_PID25_MASK                                0x2
#define _I3C2PID3_PID26_POSN                                0x2
#define _I3C2PID3_PID26_POSITION                            0x2
#define _I3C2PID3_PID26_SIZE                                0x1
#define _I3C2PID3_PID26_LENGTH                              0x1
#define _I3C2PID3_PID26_MASK                                0x4
#define _I3C2PID3_PID27_POSN                                0x3
#define _I3C2PID3_PID27_POSITION                            0x3
#define _I3C2PID3_PID27_SIZE                                0x1
#define _I3C2PID3_PID27_LENGTH                              0x1
#define _I3C2PID3_PID27_MASK                                0x8
#define _I3C2PID3_PID28_POSN                                0x4
#define _I3C2PID3_PID28_POSITION                            0x4
#define _I3C2PID3_PID28_SIZE                                0x1
#define _I3C2PID3_PID28_LENGTH                              0x1
#define _I3C2PID3_PID28_MASK                                0x10
#define _I3C2PID3_PID29_POSN                                0x5
#define _I3C2PID3_PID29_POSITION                            0x5
#define _I3C2PID3_PID29_SIZE                                0x1
#define _I3C2PID3_PID29_LENGTH                              0x1
#define _I3C2PID3_PID29_MASK                                0x20
#define _I3C2PID3_PID30_POSN                                0x6
#define _I3C2PID3_PID30_POSITION                            0x6
#define _I3C2PID3_PID30_SIZE                                0x1
#define _I3C2PID3_PID30_LENGTH                              0x1
#define _I3C2PID3_PID30_MASK                                0x40
#define _I3C2PID3_PID31_POSN                                0x7
#define _I3C2PID3_PID31_POSITION                            0x7
#define _I3C2PID3_PID31_SIZE                                0x1
#define _I3C2PID3_PID31_LENGTH                              0x1
#define _I3C2PID3_PID31_MASK                                0x80
#define _I3C2PID3_PID_31_24_POSN                            0x0
#define _I3C2PID3_PID_31_24_POSITION                        0x0
#define _I3C2PID3_PID_31_24_SIZE                            0x8
#define _I3C2PID3_PID_31_24_LENGTH                          0x8
#define _I3C2PID3_PID_31_24_MASK                            0xFF

