garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: I3C2PID4
#define I3C2PID4 I3C2PID4
extern volatile unsigned char           I3C2PID4            __at(0x0D9);
#ifndef _LIB_BUILD
asm("I3C2PID4 equ 0D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID32                  :1;
        unsigned PID33                  :1;
        unsigned PID34                  :1;
        unsigned PID35                  :1;
        unsigned PID36                  :1;
        unsigned PID37                  :1;
        unsigned PID38                  :1;
        unsigned PID39                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned PID_39_33              :7;
    };
} I3C2PID4bits_t;
extern volatile I3C2PID4bits_t I3C2PID4bits __at(0x0D9);
// bitfield macros
#define _I3C2PID4_PID32_POSN                                0x0
#define _I3C2PID4_PID32_POSITION                            0x0
#define _I3C2PID4_PID32_SIZE                                0x1
#define _I3C2PID4_PID32_LENGTH                              0x1
#define _I3C2PID4_PID32_MASK                                0x1
#define _I3C2PID4_PID33_POSN                                0x1
#define _I3C2PID4_PID33_POSITION                            0x1
#define _I3C2PID4_PID33_SIZE                                0x1
#define _I3C2PID4_PID33_LENGTH                              0x1
#define _I3C2PID4_PID33_MASK                                0x2
#define _I3C2PID4_PID34_POSN                                0x2
#define _I3C2PID4_PID34_POSITION                            0x2
#define _I3C2PID4_PID34_SIZE                                0x1
#define _I3C2PID4_PID34_LENGTH                              0x1
#define _I3C2PID4_PID34_MASK                                0x4
#define _I3C2PID4_PID35_POSN                                0x3
#define _I3C2PID4_PID35_POSITION                            0x3
#define _I3C2PID4_PID35_SIZE                                0x1
#define _I3C2PID4_PID35_LENGTH                              0x1
#define _I3C2PID4_PID35_MASK                                0x8
#define _I3C2PID4_PID36_POSN                                0x4
#define _I3C2PID4_PID36_POSITION                            0x4
#define _I3C2PID4_PID36_SIZE                                0x1
#define _I3C2PID4_PID36_LENGTH                              0x1
#define _I3C2PID4_PID36_MASK                                0x10
#define _I3C2PID4_PID37_POSN                                0x5
#define _I3C2PID4_PID37_POSITION                            0x5
#define _I3C2PID4_PID37_SIZE                                0x1
#define _I3C2PID4_PID37_LENGTH                              0x1
#define _I3C2PID4_PID37_MASK                                0x20
#define _I3C2PID4_PID38_POSN                                0x6
#define _I3C2PID4_PID38_POSITION                            0x6
#define _I3C2PID4_PID38_SIZE                                0x1
#define _I3C2PID4_PID38_LENGTH                              0x1
#define _I3C2PID4_PID38_MASK                                0x40
#define _I3C2PID4_PID39_POSN                                0x7
#define _I3C2PID4_PID39_POSITION                            0x7
#define _I3C2PID4_PID39_SIZE                                0x1
#define _I3C2PID4_PID39_LENGTH                              0x1
#define _I3C2PID4_PID39_MASK                                0x80
#define _I3C2PID4_PID_39_33_POSN                            0x1
#define _I3C2PID4_PID_39_33_POSITION                        0x1
#define _I3C2PID4_PID_39_33_SIZE                            0x7
#define _I3C2PID4_PID_39_33_LENGTH                          0x7
#define _I3C2PID4_PID_39_33_MASK                            0xFE

// Register: I3C2PID5
#define I3C2PID5 I3C2PID5
extern volatile unsigned char           I3C2PID5            __at(0x0DA);
#ifndef _LIB_BUILD
asm("I3C2PID5 equ 0DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID40                  :1;
        unsigned PID41                  :1;
        unsigned PID42                  :1;
        unsigned PID43                  :1;
        unsigned PID44                  :1;
        unsigned PID45                  :1;
        unsigned PID46                  :1;
        unsigned PID47                  :1;
    };
    struct {
        unsigned PID_47_40              :8;
    };
} I3C2PID5bits_t;
extern volatile I3C2PID5bits_t I3C2PID5bits __at(0x0DA);
// bitfield macros
#define _I3C2PID5_PID40_POSN                                0x0
#define _I3C2PID5_PID40_POSITION                            0x0
#define _I3C2PID5_PID40_SIZE                                0x1
#define _I3C2PID5_PID40_LENGTH                              0x1
#define _I3C2PID5_PID40_MASK                                0x1
#define _I3C2PID5_PID41_POSN                                0x1
#define _I3C2PID5_PID41_POSITION                            0x1
#define _I3C2PID5_PID41_SIZE                                0x1
#define _I3C2PID5_PID41_LENGTH                              0x1
#define _I3C2PID5_PID41_MASK                                0x2
#define _I3C2PID5_PID42_POSN                                0x2
#define _I3C2PID5_PID42_POSITION                            0x2
#define _I3C2PID5_PID42_SIZE                                0x1
#define _I3C2PID5_PID42_LENGTH                              0x1
#define _I3C2PID5_PID42_MASK                                0x4
#define _I3C2PID5_PID43_POSN                                0x3
#define _I3C2PID5_PID43_POSITION                            0x3
#define _I3C2PID5_PID43_SIZE                                0x1
#define _I3C2PID5_PID43_LENGTH                              0x1
#define _I3C2PID5_PID43_MASK                                0x8
#define _I3C2PID5_PID44_POSN                                0x4
#define _I3C2PID5_PID44_POSITION                            0x4
#define _I3C2PID5_PID44_SIZE                                0x1
#define _I3C2PID5_PID44_LENGTH                              0x1
#define _I3C2PID5_PID44_MASK                                0x10
#define _I3C2PID5_PID45_POSN                                0x5
#define _I3C2PID5_PID45_POSITION                            0x5
#define _I3C2PID5_PID45_SIZE                                0x1
#define _I3C2PID5_PID45_LENGTH                              0x1
#define _I3C2PID5_PID45_MASK                                0x20
#define _I3C2PID5_PID46_POSN                                0x6
#define _I3C2PID5_PID46_POSITION                            0x6
#define _I3C2PID5_PID46_SIZE                                0x1
#define _I3C2PID5_PID46_LENGTH                              0x1
#define _I3C2PID5_PID46_MASK                                0x40
#define _I3C2PID5_PID47_POSN                                0x7
#define _I3C2PID5_PID47_POSITION                            0x7
#define _I3C2PID5_PID47_SIZE                                0x1
#define _I3C2PID5_PID47_LENGTH                              0x1
#define _I3C2PID5_PID47_MASK                                0x80
#define _I3C2PID5_PID_47_40_POSN                            0x0
#define _I3C2PID5_PID_47_40_POSITION                        0x0
#define _I3C2PID5_PID_47_40_SIZE                            0x8
#define _I3C2PID5_PID_47_40_LENGTH                          0x8
#define _I3C2PID5_PID_47_40_MASK                            0xFF

