garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile TU16BPRTbits_t TU16BPRTbits __at(0x145);
// bitfield macros
#define _TU16BPRT_PRT_POSN                                  0x0
#define _TU16BPRT_PRT_POSITION                              0x0
#define _TU16BPRT_PRT_SIZE                                  0x8
#define _TU16BPRT_PRT_LENGTH                                0x8
#define _TU16BPRT_PRT_MASK                                  0xFF
#define _TU16BPRT_PRT0_POSN                                 0x0
#define _TU16BPRT_PRT0_POSITION                             0x0
#define _TU16BPRT_PRT0_SIZE                                 0x1
#define _TU16BPRT_PRT0_LENGTH                               0x1
#define _TU16BPRT_PRT0_MASK                                 0x1
#define _TU16BPRT_PRT1_POSN                                 0x1
#define _TU16BPRT_PRT1_POSITION                             0x1
#define _TU16BPRT_PRT1_SIZE                                 0x1
#define _TU16BPRT_PRT1_LENGTH                               0x1
#define _TU16BPRT_PRT1_MASK                                 0x2
#define _TU16BPRT_PRT2_POSN                                 0x2
#define _TU16BPRT_PRT2_POSITION                             0x2
#define _TU16BPRT_PRT2_SIZE                                 0x1
#define _TU16BPRT_PRT2_LENGTH                               0x1
#define _TU16BPRT_PRT2_MASK                                 0x4
#define _TU16BPRT_PRT3_POSN                                 0x3
#define _TU16BPRT_PRT3_POSITION                             0x3
#define _TU16BPRT_PRT3_SIZE                                 0x1
#define _TU16BPRT_PRT3_LENGTH                               0x1
#define _TU16BPRT_PRT3_MASK                                 0x8
#define _TU16BPRT_PRT4_POSN                                 0x4
#define _TU16BPRT_PRT4_POSITION                             0x4
#define _TU16BPRT_PRT4_SIZE                                 0x1
#define _TU16BPRT_PRT4_LENGTH                               0x1
#define _TU16BPRT_PRT4_MASK                                 0x10
#define _TU16BPRT_PRT5_POSN                                 0x5
#define _TU16BPRT_PRT5_POSITION                             0x5
#define _TU16BPRT_PRT5_SIZE                                 0x1
#define _TU16BPRT_PRT5_LENGTH                               0x1
#define _TU16BPRT_PRT5_MASK                                 0x20
#define _TU16BPRT_PRT6_POSN                                 0x6
#define _TU16BPRT_PRT6_POSITION                             0x6
#define _TU16BPRT_PRT6_SIZE                                 0x1
#define _TU16BPRT_PRT6_LENGTH                               0x1
#define _TU16BPRT_PRT6_MASK                                 0x40
#define _TU16BPRT_PRT7_POSN                                 0x7
#define _TU16BPRT_PRT7_POSITION                             0x7
#define _TU16BPRT_PRT7_SIZE                                 0x1
#define _TU16BPRT_PRT7_LENGTH                               0x1
#define _TU16BPRT_PRT7_MASK                                 0x80
#define _TU16BPRT_TU16BPRT0_POSN                            0x0
#define _TU16BPRT_TU16BPRT0_POSITION                        0x0
#define _TU16BPRT_TU16BPRT0_SIZE                            0x1
#define _TU16BPRT_TU16BPRT0_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT0_MASK                            0x1
#define _TU16BPRT_TU16BPRT1_POSN                            0x1
#define _TU16BPRT_TU16BPRT1_POSITION                        0x1
#define _TU16BPRT_TU16BPRT1_SIZE                            0x1
#define _TU16BPRT_TU16BPRT1_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT1_MASK                            0x2
#define _TU16BPRT_TU16BPRT2_POSN                            0x2
#define _TU16BPRT_TU16BPRT2_POSITION                        0x2
#define _TU16BPRT_TU16BPRT2_SIZE                            0x1
#define _TU16BPRT_TU16BPRT2_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT2_MASK                            0x4
#define _TU16BPRT_TU16BPRT3_POSN                            0x3
#define _TU16BPRT_TU16BPRT3_POSITION                        0x3
#define _TU16BPRT_TU16BPRT3_SIZE                            0x1
#define _TU16BPRT_TU16BPRT3_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT3_MASK                            0x8
#define _TU16BPRT_TU16BPRT4_POSN                            0x4
#define _TU16BPRT_TU16BPRT4_POSITION                        0x4
#define _TU16BPRT_TU16BPRT4_SIZE                            0x1
#define _TU16BPRT_TU16BPRT4_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT4_MASK                            0x10
#define _TU16BPRT_TU16BPRT5_POSN                            0x5
#define _TU16BPRT_TU16BPRT5_POSITION                        0x5
#define _TU16BPRT_TU16BPRT5_SIZE                            0x1
#define _TU16BPRT_TU16BPRT5_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT5_MASK                            0x20
#define _TU16BPRT_TU16BPRT6_POSN                            0x6
#define _TU16BPRT_TU16BPRT6_POSITION                        0x6
#define _TU16BPRT_TU16BPRT6_SIZE                            0x1
#define _TU16BPRT_TU16BPRT6_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT6_MASK                            0x40
#define _TU16BPRT_TU16BPRT7_POSN                            0x7
#define _TU16BPRT_TU16BPRT7_POSITION                        0x7
#define _TU16BPRT_TU16BPRT7_SIZE                            0x1
#define _TU16BPRT_TU16BPRT7_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT7_MASK                            0x80
#define _TU16BPRT_TU16BPR24_POSN                            0x0
#define _TU16BPRT_TU16BPR24_POSITION                        0x0
#define _TU16BPRT_TU16BPR24_SIZE                            0x1
#define _TU16BPRT_TU16BPR24_LENGTH                          0x1
#define _TU16BPRT_TU16BPR24_MASK                            0x1
#define _TU16BPRT_TU16BPR25_POSN                            0x1
#define _TU16BPRT_TU16BPR25_POSITION                        0x1
#define _TU16BPRT_TU16BPR25_SIZE                            0x1
#define _TU16BPRT_TU16BPR25_LENGTH                          0x1
#define _TU16BPRT_TU16BPR25_MASK                            0x2
#define _TU16BPRT_TU16BPR26_POSN                            0x2
#define _TU16BPRT_TU16BPR26_POSITION                        0x2
#define _TU16BPRT_TU16BPR26_SIZE                            0x1
#define _TU16BPRT_TU16BPR26_LENGTH                          0x1
#define _TU16BPRT_TU16BPR26_MASK                            0x4
#define _TU16BPRT_TU16BPR27_POSN                            0x3
#define _TU16BPRT_TU16BPR27_POSITION                        0x3
#define _TU16BPRT_TU16BPR27_SIZE                            0x1
#define _TU16BPRT_TU16BPR27_LENGTH                          0x1
#define _TU16BPRT_TU16BPR27_MASK                            0x8
#define _TU16BPRT_TU16BPR28_POSN                            0x4
#define _TU16BPRT_TU16BPR28_POSITION                        0x4
#define _TU16BPRT_TU16BPR28_SIZE                            0x1
#define _TU16BPRT_TU16BPR28_LENGTH                          0x1
#define _TU16BPRT_TU16BPR28_MASK                            0x10
#define _TU16BPRT_TU16BPR29_POSN                            0x5
#define _TU16BPRT_TU16BPR29_POSITION                        0x5
#define _TU16BPRT_TU16BPR29_SIZE                            0x1
#define _TU16BPRT_TU16BPR29_LENGTH                          0x1
#define _TU16BPRT_TU16BPR29_MASK                            0x20
#define _TU16BPRT_TU16BPR30_POSN                            0x6
#define _TU16BPRT_TU16BPR30_POSITION                        0x6
#define _TU16BPRT_TU16BPR30_SIZE                            0x1
#define _TU16BPRT_TU16BPR30_LENGTH                          0x1
#define _TU16BPRT_TU16BPR30_MASK                            0x40
#define _TU16BPRT_TU16BPR31_POSN                            0x7
#define _TU16BPRT_TU16BPR31_POSITION                        0x7
#define _TU16BPRT_TU16BPR31_SIZE                            0x1
#define _TU16BPRT_TU16BPR31_LENGTH                          0x1
#define _TU16BPRT_TU16BPR31_MASK                            0x80

