garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: TU16BCLK
#define TU16BCLK TU16BCLK
extern volatile unsigned char           TU16BCLK            __at(0x146);
#ifndef _LIB_BUILD
asm("TU16BCLK equ 0146h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned TU16BCLK0              :1;
        unsigned TU16BCLK1              :1;
        unsigned TU16BCLK2              :1;
        unsigned TU16BCLK3              :1;
        unsigned TU16BCLK4              :1;
    };
} TU16BCLKbits_t;
extern volatile TU16BCLKbits_t TU16BCLKbits __at(0x146);
// bitfield macros
#define _TU16BCLK_CLK_POSN                                  0x0
#define _TU16BCLK_CLK_POSITION                              0x0
#define _TU16BCLK_CLK_SIZE                                  0x8
#define _TU16BCLK_CLK_LENGTH                                0x8
#define _TU16BCLK_CLK_MASK                                  0xFF
#define _TU16BCLK_CLK0_POSN                                 0x0
#define _TU16BCLK_CLK0_POSITION                             0x0
#define _TU16BCLK_CLK0_SIZE                                 0x1
#define _TU16BCLK_CLK0_LENGTH                               0x1
#define _TU16BCLK_CLK0_MASK                                 0x1
#define _TU16BCLK_CLK1_POSN                                 0x1
#define _TU16BCLK_CLK1_POSITION                             0x1
#define _TU16BCLK_CLK1_SIZE                                 0x1
#define _TU16BCLK_CLK1_LENGTH                               0x1
#define _TU16BCLK_CLK1_MASK                                 0x2
#define _TU16BCLK_CLK2_POSN                                 0x2
#define _TU16BCLK_CLK2_POSITION                             0x2
#define _TU16BCLK_CLK2_SIZE                                 0x1
#define _TU16BCLK_CLK2_LENGTH                               0x1
#define _TU16BCLK_CLK2_MASK                                 0x4
#define _TU16BCLK_CLK3_POSN                                 0x3
#define _TU16BCLK_CLK3_POSITION                             0x3
#define _TU16BCLK_CLK3_SIZE                                 0x1
#define _TU16BCLK_CLK3_LENGTH                               0x1
#define _TU16BCLK_CLK3_MASK                                 0x8
#define _TU16BCLK_CLK4_POSN                                 0x4
#define _TU16BCLK_CLK4_POSITION                             0x4
#define _TU16BCLK_CLK4_SIZE                                 0x1
#define _TU16BCLK_CLK4_LENGTH                               0x1
#define _TU16BCLK_CLK4_MASK                                 0x10
#define _TU16BCLK_TU16BCLK0_POSN                            0x0
#define _TU16BCLK_TU16BCLK0_POSITION                        0x0
#define _TU16BCLK_TU16BCLK0_SIZE                            0x1
#define _TU16BCLK_TU16BCLK0_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK0_MASK                            0x1
#define _TU16BCLK_TU16BCLK1_POSN                            0x1
#define _TU16BCLK_TU16BCLK1_POSITION                        0x1
#define _TU16BCLK_TU16BCLK1_SIZE                            0x1
#define _TU16BCLK_TU16BCLK1_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK1_MASK                            0x2
#define _TU16BCLK_TU16BCLK2_POSN                            0x2
#define _TU16BCLK_TU16BCLK2_POSITION                        0x2
#define _TU16BCLK_TU16BCLK2_SIZE                            0x1
#define _TU16BCLK_TU16BCLK2_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK2_MASK                            0x4
#define _TU16BCLK_TU16BCLK3_POSN                            0x3
#define _TU16BCLK_TU16BCLK3_POSITION                        0x3
#define _TU16BCLK_TU16BCLK3_SIZE                            0x1
#define _TU16BCLK_TU16BCLK3_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK3_MASK                            0x8
#define _TU16BCLK_TU16BCLK4_POSN                            0x4
#define _TU16BCLK_TU16BCLK4_POSITION                        0x4
#define _TU16BCLK_TU16BCLK4_SIZE                            0x1
#define _TU16BCLK_TU16BCLK4_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK4_MASK                            0x10

// Register: TU16BERS
#define TU16BERS TU16BERS
extern volatile unsigned char           TU16BERS            __at(0x147);
#ifndef _LIB_BUILD
asm("TU16BERS equ 0147h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
        unsigned ERS4                   :1;
        unsigned ERS5                   :1;
    };
    struct {
        unsigned TU16BERS0              :1;
        unsigned TU16BERS1              :1;
        unsigned TU16BERS2              :1;
        unsigned TU16BERS3              :1;
        unsigned TU16BERS4              :1;
        unsigned TU16BERS5              :1;
    };
} TU16BERSbits_t;
extern volatile TU16BERSbits_t TU16BERSbits __at(0x147);
// bitfield macros
#define _TU16BERS_ERS_POSN                                  0x0
#define _TU16BERS_ERS_POSITION                              0x0
#define _TU16BERS_ERS_SIZE                                  0x8
#define _TU16BERS_ERS_LENGTH                                0x8
#define _TU16BERS_ERS_MASK                                  0xFF
#define _TU16BERS_ERS0_POSN                                 0x0
#define _TU16BERS_ERS0_POSITION                             0x0
#define _TU16BERS_ERS0_SIZE                                 0x1
#define _TU16BERS_ERS0_LENGTH                               0x1
#define _TU16BERS_ERS0_MASK                                 0x1
#define _TU16BERS_ERS1_POSN                                 0x1
#define _TU16BERS_ERS1_POSITION                             0x1
#define _TU16BERS_ERS1_SIZE                                 0x1
#define _TU16BERS_ERS1_LENGTH                               0x1
#define _TU16BERS_ERS1_MASK                                 0x2
#define _TU16BERS_ERS2_POSN                                 0x2
#define _TU16BERS_ERS2_POSITION                             0x2
#define _TU16BERS_ERS2_SIZE                                 0x1
#define _TU16BERS_ERS2_LENGTH                               0x1
#define _TU16BERS_ERS2_MASK                                 0x4
#define _TU16BERS_ERS3_POSN                                 0x3
#define _TU16BERS_ERS3_POSITION                             0x3
#define _TU16BERS_ERS3_SIZE                                 0x1
#define _TU16BERS_ERS3_LENGTH                               0x1
#define _TU16BERS_ERS3_MASK                                 0x8
#define _TU16BERS_ERS4_POSN                                 0x4
#define _TU16BERS_ERS4_POSITION                             0x4
#define _TU16BERS_ERS4_SIZE                                 0x1
#define _TU16BERS_ERS4_LENGTH                               0x1
#define _TU16BERS_ERS4_MASK                                 0x10
#define _TU16BERS_ERS5_POSN                                 0x5
#define _TU16BERS_ERS5_POSITION                             0x5
#define _TU16BERS_ERS5_SIZE                                 0x1
#define _TU16BERS_ERS5_LENGTH                               0x1
#define _TU16BERS_ERS5_MASK                                 0x20
#define _TU16BERS_TU16BERS0_POSN                            0x0
#define _TU16BERS_TU16BERS0_POSITION                        0x0
#define _TU16BERS_TU16BERS0_SIZE                            0x1
#define _TU16BERS_TU16BERS0_LENGTH                          0x1
#define _TU16BERS_TU16BERS0_MASK                            0x1
#define _TU16BERS_TU16BERS1_POSN                            0x1
#define _TU16BERS_TU16BERS1_POSITION                        0x1
#define _TU16BERS_TU16BERS1_SIZE                            0x1
#define _TU16BERS_TU16BERS1_LENGTH                          0x1
#define _TU16BERS_TU16BERS1_MASK                            0x2
#define _TU16BERS_TU16BERS2_POSN                            0x2
#define _TU16BERS_TU16BERS2_POSITION                        0x2
#define _TU16BERS_TU16BERS2_SIZE                            0x1
#define _TU16BERS_TU16BERS2_LENGTH                          0x1
#define _TU16BERS_TU16BERS2_MASK                            0x4
#define _TU16BERS_TU16BERS3_POSN                            0x3
#define _TU16BERS_TU16BERS3_POSITION                        0x3
#define _TU16BERS_TU16BERS3_SIZE                            0x1
#define _TU16BERS_TU16BERS3_LENGTH                          0x1
#define _TU16BERS_TU16BERS3_MASK                            0x8
#define _TU16BERS_TU16BERS4_POSN                            0x4
#define _TU16BERS_TU16BERS4_POSITION                        0x4
#define _TU16BERS_TU16BERS4_SIZE                            0x1
#define _TU16BERS_TU16BERS4_LENGTH                          0x1
#define _TU16BERS_TU16BERS4_MASK                            0x10
#define _TU16BERS_TU16BERS5_POSN                            0x5
#define _TU16BERS_TU16BERS5_POSITION                        0x5
#define _TU16BERS_TU16BERS5_SIZE                            0x1
#define _TU16BERS_TU16BERS5_LENGTH                          0x1
#define _TU16BERS_TU16BERS5_MASK                            0x20

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
extern volatile unsigned char           CCPTMRS0            __at(0x148);
#ifndef _LIB_BUILD
asm("CCPTMRS0 equ 0148h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1TSEL                 :2;
        unsigned C2TSEL                 :2;
    };
    struct {
        unsigned C1TSEL0                :1;
        unsigned C1TSEL1                :1;
        unsigned C2TSEL2                :1;
        unsigned C2TSEL3                :1;
    };
} CCPTMRS0bits_t;
extern volatile CCPTMRS0bits_t CCPTMRS0bits __at(0x148);
// bitfield macros
#define _CCPTMRS0_C1TSEL_POSN                               0x0
#define _CCPTMRS0_C1TSEL_POSITION                           0x0
#define _CCPTMRS0_C1TSEL_SIZE                               0x2
#define _CCPTMRS0_C1TSEL_LENGTH                             0x2
#define _CCPTMRS0_C1TSEL_MASK                               0x3
#define _CCPTMRS0_C2TSEL_POSN                               0x2
#define _CCPTMRS0_C2TSEL_POSITION                           0x2
#define _CCPTMRS0_C2TSEL_SIZE                               0x2
#define _CCPTMRS0_C2TSEL_LENGTH                             0x2
#define _CCPTMRS0_C2TSEL_MASK                               0xC
#define _CCPTMRS0_C1TSEL0_POSN                              0x0
#define _CCPTMRS0_C1TSEL0_POSITION                          0x0
#define _CCPTMRS0_C1TSEL0_SIZE                              0x1
#define _CCPTMRS0_C1TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL0_MASK                              0x1
#define _CCPTMRS0_C1TSEL1_POSN                              0x1
#define _CCPTMRS0_C1TSEL1_POSITION                          0x1
#define _CCPTMRS0_C1TSEL1_SIZE                              0x1
#define _CCPTMRS0_C1TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL1_MASK                              0x2
#define _CCPTMRS0_C2TSEL2_POSN                              0x2
#define _CCPTMRS0_C2TSEL2_POSITION                          0x2
#define _CCPTMRS0_C2TSEL2_SIZE                              0x1
#define _CCPTMRS0_C2TSEL2_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL2_MASK                              0x4
#define _CCPTMRS0_C2TSEL3_POSN                              0x3
#define _CCPTMRS0_C2TSEL3_POSITION                          0x3
#define _CCPTMRS0_C2TSEL3_SIZE                              0x1
#define _CCPTMRS0_C2TSEL3_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL3_MASK                              0x8

// Register: CCPR1
#define CCPR1 CCPR1
extern volatile unsigned short          CCPR1               __at(0x149);
#ifndef _LIB_BUILD
asm("CCPR1 equ 0149h");
#endif

// Register: CCPR1L
#define CCPR1L CCPR1L
extern volatile unsigned char           CCPR1L              __at(0x149);
#ifndef _LIB_BUILD
asm("CCPR1L equ 0149h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR1Lbits_t;
