garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile PWM2S1P1Hbits_t PWM2S1P1Hbits __at(0x16E);
// bitfield macros
#define _PWM2S1P1H_S1P1H_POSN                               0x0
#define _PWM2S1P1H_S1P1H_POSITION                           0x0
#define _PWM2S1P1H_S1P1H_SIZE                               0x8
#define _PWM2S1P1H_S1P1H_LENGTH                             0x8
#define _PWM2S1P1H_S1P1H_MASK                               0xFF

// Register: PWM2S1P2
#define PWM2S1P2 PWM2S1P2
extern volatile unsigned short          PWM2S1P2            __at(0x16F);
#ifndef _LIB_BUILD
asm("PWM2S1P2 equ 016Fh");
#endif

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
extern volatile unsigned char           PWM2S1P2L           __at(0x16F);
#ifndef _LIB_BUILD
asm("PWM2S1P2L equ 016Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2L                  :8;
    };
} PWM2S1P2Lbits_t;
extern volatile PWM2S1P2Lbits_t PWM2S1P2Lbits __at(0x16F);
// bitfield macros
#define _PWM2S1P2L_S1P2L_POSN                               0x0
#define _PWM2S1P2L_S1P2L_POSITION                           0x0
#define _PWM2S1P2L_S1P2L_SIZE                               0x8
#define _PWM2S1P2L_S1P2L_LENGTH                             0x8
#define _PWM2S1P2L_S1P2L_MASK                               0xFF

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
extern volatile unsigned char           PWM2S1P2H           __at(0x170);
#ifndef _LIB_BUILD
asm("PWM2S1P2H equ 0170h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2H                  :8;
    };
} PWM2S1P2Hbits_t;
extern volatile PWM2S1P2Hbits_t PWM2S1P2Hbits __at(0x170);
// bitfield macros
#define _PWM2S1P2H_S1P2H_POSN                               0x0
#define _PWM2S1P2H_S1P2H_POSITION                           0x0
#define _PWM2S1P2H_S1P2H_SIZE                               0x8
#define _PWM2S1P2H_S1P2H_LENGTH                             0x8
#define _PWM2S1P2H_S1P2H_MASK                               0xFF

// Register: CWG1CLK
#define CWG1CLK CWG1CLK
extern volatile unsigned char           CWG1CLK             __at(0x199);
#ifndef _LIB_BUILD
asm("CWG1CLK equ 0199h");
#endif
// aliases
extern volatile unsigned char           CWG1CLKCON          __at(0x199);
#ifndef _LIB_BUILD
asm("CWG1CLKCON equ 0199h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG1CS                 :1;
    };
} CWG1CLKbits_t;
extern volatile CWG1CLKbits_t CWG1CLKbits __at(0x199);
// bitfield macros
#define _CWG1CLK_CS_POSN                                    0x0
#define _CWG1CLK_CS_POSITION                                0x0
#define _CWG1CLK_CS_SIZE                                    0x1
#define _CWG1CLK_CS_LENGTH                                  0x1
#define _CWG1CLK_CS_MASK                                    0x1
#define _CWG1CLK_CWG1CS_POSN                                0x0
#define _CWG1CLK_CWG1CS_POSITION                            0x0
#define _CWG1CLK_CWG1CS_SIZE                                0x1
#define _CWG1CLK_CWG1CS_LENGTH                              0x1
#define _CWG1CLK_CWG1CS_MASK                                0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG1CS                 :1;
    };
} CWG1CLKCONbits_t;
extern volatile CWG1CLKCONbits_t CWG1CLKCONbits __at(0x199);
// bitfield macros
#define _CWG1CLKCON_CS_POSN                                 0x0
#define _CWG1CLKCON_CS_POSITION                             0x0
#define _CWG1CLKCON_CS_SIZE                                 0x1
#define _CWG1CLKCON_CS_LENGTH                               0x1
#define _CWG1CLKCON_CS_MASK                                 0x1
#define _CWG1CLKCON_CWG1CS_POSN                             0x0
#define _CWG1CLKCON_CWG1CS_POSITION                         0x0
#define _CWG1CLKCON_CWG1CS_SIZE                             0x1
#define _CWG1CLKCON_CWG1CS_LENGTH                           0x1
#define _CWG1CLKCON_CWG1CS_MASK                             0x1

// Register: CWG1ISM
#define CWG1ISM CWG1ISM
extern volatile unsigned char           CWG1ISM             __at(0x19A);
#ifndef _LIB_BUILD
asm("CWG1ISM equ 019Ah");
#endif
// aliases
extern volatile unsigned char           CWG1DAT             __at(0x19A);
#ifndef _LIB_BUILD
asm("CWG1DAT equ 019Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG1ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG1ISMbits_t;
extern volatile CWG1ISMbits_t CWG1ISMbits __at(0x19A);
// bitfield macros
#define _CWG1ISM_ISM_POSN                                   0x0
#define _CWG1ISM_ISM_POSITION                               0x0
#define _CWG1ISM_ISM_SIZE                                   0x8
#define _CWG1ISM_ISM_LENGTH                                 0x8
#define _CWG1ISM_ISM_MASK                                   0xFF
#define _CWG1ISM_CWG1ISM_POSN                               0x0
#define _CWG1ISM_CWG1ISM_POSITION                           0x0
#define _CWG1ISM_CWG1ISM_SIZE                               0x8
#define _CWG1ISM_CWG1ISM_LENGTH                             0x8
#define _CWG1ISM_CWG1ISM_MASK                               0xFF
#define _CWG1ISM_ISM0_POSN                                  0x0
#define _CWG1ISM_ISM0_POSITION                              0x0
#define _CWG1ISM_ISM0_SIZE                                  0x1
#define _CWG1ISM_ISM0_LENGTH                                0x1
#define _CWG1ISM_ISM0_MASK                                  0x1
#define _CWG1ISM_ISM1_POSN                                  0x1
#define _CWG1ISM_ISM1_POSITION                              0x1
#define _CWG1ISM_ISM1_SIZE                                  0x1
#define _CWG1ISM_ISM1_LENGTH                                0x1
#define _CWG1ISM_ISM1_MASK                                  0x2
#define _CWG1ISM_ISM2_POSN                                  0x2
#define _CWG1ISM_ISM2_POSITION                              0x2
#define _CWG1ISM_ISM2_SIZE                                  0x1
#define _CWG1ISM_ISM2_LENGTH                                0x1
#define _CWG1ISM_ISM2_MASK                                  0x4
#define _CWG1ISM_ISM3_POSN                                  0x3
#define _CWG1ISM_ISM3_POSITION                              0x3
#define _CWG1ISM_ISM3_SIZE                                  0x1
#define _CWG1ISM_ISM3_LENGTH                                0x1
#define _CWG1ISM_ISM3_MASK                                  0x8
#define _CWG1ISM_ISM4_POSN                                  0x4
#define _CWG1ISM_ISM4_POSITION                              0x4
#define _CWG1ISM_ISM4_SIZE                                  0x1
#define _CWG1ISM_ISM4_LENGTH                                0x1
#define _CWG1ISM_ISM4_MASK                                  0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG1ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
} CWG1DATbits_t;
extern volatile CWG1DATbits_t CWG1DATbits __at(0x19A);
// bitfield macros
#define _CWG1DAT_ISM_POSN                                   0x0
#define _CWG1DAT_ISM_POSITION                               0x0
#define _CWG1DAT_ISM_SIZE                                   0x8
#define _CWG1DAT_ISM_LENGTH                                 0x8
#define _CWG1DAT_ISM_MASK                                   0xFF
#define _CWG1DAT_CWG1ISM_POSN                               0x0
#define _CWG1DAT_CWG1ISM_POSITION                           0x0
#define _CWG1DAT_CWG1ISM_SIZE                               0x8
#define _CWG1DAT_CWG1ISM_LENGTH                             0x8
#define _CWG1DAT_CWG1ISM_MASK                               0xFF
#define _CWG1DAT_ISM0_POSN                                  0x0
#define _CWG1DAT_ISM0_POSITION                              0x0
#define _CWG1DAT_ISM0_SIZE                                  0x1
#define _CWG1DAT_ISM0_LENGTH                                0x1
#define _CWG1DAT_ISM0_MASK                                  0x1
#define _CWG1DAT_ISM1_POSN                                  0x1
#define _CWG1DAT_ISM1_POSITION                              0x1
#define _CWG1DAT_ISM1_SIZE                                  0x1
#define _CWG1DAT_ISM1_LENGTH                                0x1
#define _CWG1DAT_ISM1_MASK                                  0x2
#define _CWG1DAT_ISM2_POSN                                  0x2
#define _CWG1DAT_ISM2_POSITION                              0x2
#define _CWG1DAT_ISM2_SIZE                                  0x1
#define _CWG1DAT_ISM2_LENGTH                                0x1
#define _CWG1DAT_ISM2_MASK                                  0x4
#define _CWG1DAT_ISM3_POSN                                  0x3
#define _CWG1DAT_ISM3_POSITION                              0x3
#define _CWG1DAT_ISM3_SIZE                                  0x1
#define _CWG1DAT_ISM3_LENGTH                                0x1
#define _CWG1DAT_ISM3_MASK                                  0x8
#define _CWG1DAT_ISM4_POSN                                  0x4
#define _CWG1DAT_ISM4_POSITION                              0x4
#define _CWG1DAT_ISM4_SIZE                                  0x1
#define _CWG1DAT_ISM4_LENGTH                                0x1
#define _CWG1DAT_ISM4_MASK                                  0x10

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
extern volatile unsigned char           CWG1DBR             __at(0x19B);
#ifndef _LIB_BUILD
asm("CWG1DBR equ 019Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :8;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG1DBR                :8;
    };
    struct {
        unsigned CWG1DBR0               :1;
        unsigned CWG1DBR1               :1;
        unsigned CWG1DBR2               :1;
        unsigned CWG1DBR3               :1;
        unsigned CWG1DBR4               :1;
        unsigned CWG1DBR5               :1;
    };
} CWG1DBRbits_t;
extern volatile CWG1DBRbits_t CWG1DBRbits __at(0x19B);
// bitfield macros
#define _CWG1DBR_DBR_POSN                                   0x0
#define _CWG1DBR_DBR_POSITION                               0x0
#define _CWG1DBR_DBR_SIZE                                   0x8
#define _CWG1DBR_DBR_LENGTH                                 0x8
#define _CWG1DBR_DBR_MASK                                   0xFF
#define _CWG1DBR_DBR0_POSN                                  0x0
#define _CWG1DBR_DBR0_POSITION                              0x0
#define _CWG1DBR_DBR0_SIZE                                  0x1
#define _CWG1DBR_DBR0_LENGTH                                0x1
#define _CWG1DBR_DBR0_MASK                                  0x1
#define _CWG1DBR_DBR1_POSN                                  0x1
#define _CWG1DBR_DBR1_POSITION                              0x1
#define _CWG1DBR_DBR1_SIZE                                  0x1
#define _CWG1DBR_DBR1_LENGTH                                0x1
#define _CWG1DBR_DBR1_MASK                                  0x2
#define _CWG1DBR_DBR2_POSN                                  0x2
#define _CWG1DBR_DBR2_POSITION                              0x2
#define _CWG1DBR_DBR2_SIZE                                  0x1
#define _CWG1DBR_DBR2_LENGTH                                0x1
#define _CWG1DBR_DBR2_MASK                                  0x4
#define _CWG1DBR_DBR3_POSN                                  0x3
#define _CWG1DBR_DBR3_POSITION                              0x3
#define _CWG1DBR_DBR3_SIZE                                  0x1
#define _CWG1DBR_DBR3_LENGTH                                0x1
#define _CWG1DBR_DBR3_MASK                                  0x8
#define _CWG1DBR_DBR4_POSN                                  0x4
#define _CWG1DBR_DBR4_POSITION                              0x4
#define _CWG1DBR_DBR4_SIZE                                  0x1
#define _CWG1DBR_DBR4_LENGTH                                0x1
#define _CWG1DBR_DBR4_MASK                                  0x10
#define _CWG1DBR_DBR5_POSN                                  0x5
#define _CWG1DBR_DBR5_POSITION                              0x5
#define _CWG1DBR_DBR5_SIZE                                  0x1
#define _CWG1DBR_DBR5_LENGTH                                0x1
#define _CWG1DBR_DBR5_MASK                                  0x20
#define _CWG1DBR_CWG1DBR_POSN                               0x0
#define _CWG1DBR_CWG1DBR_POSITION                           0x0
#define _CWG1DBR_CWG1DBR_SIZE                               0x8
#define _CWG1DBR_CWG1DBR_LENGTH                             0x8
#define _CWG1DBR_CWG1DBR_MASK                               0xFF
#define _CWG1DBR_CWG1DBR0_POSN                              0x0
#define _CWG1DBR_CWG1DBR0_POSITION                          0x0
#define _CWG1DBR_CWG1DBR0_SIZE                              0x1
#define _CWG1DBR_CWG1DBR0_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR0_MASK                              0x1
#define _CWG1DBR_CWG1DBR1_POSN                              0x1
#define _CWG1DBR_CWG1DBR1_POSITION                          0x1
#define _CWG1DBR_CWG1DBR1_SIZE                              0x1
#define _CWG1DBR_CWG1DBR1_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR1_MASK                              0x2
#define _CWG1DBR_CWG1DBR2_POSN                              0x2
#define _CWG1DBR_CWG1DBR2_POSITION                          0x2
#define _CWG1DBR_CWG1DBR2_SIZE                              0x1
#define _CWG1DBR_CWG1DBR2_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR2_MASK                              0x4
#define _CWG1DBR_CWG1DBR3_POSN                              0x3
#define _CWG1DBR_CWG1DBR3_POSITION                          0x3
#define _CWG1DBR_CWG1DBR3_SIZE                              0x1
#define _CWG1DBR_CWG1DBR3_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR3_MASK                              0x8
#define _CWG1DBR_CWG1DBR4_POSN                              0x4
#define _CWG1DBR_CWG1DBR4_POSITION                          0x4
#define _CWG1DBR_CWG1DBR4_SIZE                              0x1
#define _CWG1DBR_CWG1DBR4_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR4_MASK                              0x10
#define _CWG1DBR_CWG1DBR5_POSN                              0x5
#define _CWG1DBR_CWG1DBR5_POSITION                          0x5
#define _CWG1DBR_CWG1DBR5_SIZE                              0x1
#define _CWG1DBR_CWG1DBR5_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR5_MASK                              0x20

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
extern volatile unsigned char           CWG1DBF             __at(0x19C);
#ifndef _LIB_BUILD
asm("CWG1DBF equ 019Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :8;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG1DBF                :8;
    };
    struct {
        unsigned CWG1DBF0               :1;
        unsigned CWG1DBF1               :1;
        unsigned CWG1DBF2               :1;
        unsigned CWG1DBF3               :1;
        unsigned CWG1DBF4               :1;
        unsigned CWG1DBF5               :1;
    };
} CWG1DBFbits_t;
