garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile CLCnSEL3bits_t CLCnSEL3bits __at(0x1AA);
// bitfield macros
#define _CLCnSEL3_D4S_POSN                                  0x0
#define _CLCnSEL3_D4S_POSITION                              0x0
#define _CLCnSEL3_D4S_SIZE                                  0x8
#define _CLCnSEL3_D4S_LENGTH                                0x8
#define _CLCnSEL3_D4S_MASK                                  0xFF
#define _CLCnSEL3_D4S0_POSN                                 0x0
#define _CLCnSEL3_D4S0_POSITION                             0x0
#define _CLCnSEL3_D4S0_SIZE                                 0x1
#define _CLCnSEL3_D4S0_LENGTH                               0x1
#define _CLCnSEL3_D4S0_MASK                                 0x1
#define _CLCnSEL3_D4S1_POSN                                 0x1
#define _CLCnSEL3_D4S1_POSITION                             0x1
#define _CLCnSEL3_D4S1_SIZE                                 0x1
#define _CLCnSEL3_D4S1_LENGTH                               0x1
#define _CLCnSEL3_D4S1_MASK                                 0x2
#define _CLCnSEL3_D4S2_POSN                                 0x2
#define _CLCnSEL3_D4S2_POSITION                             0x2
#define _CLCnSEL3_D4S2_SIZE                                 0x1
#define _CLCnSEL3_D4S2_LENGTH                               0x1
#define _CLCnSEL3_D4S2_MASK                                 0x4
#define _CLCnSEL3_D4S3_POSN                                 0x3
#define _CLCnSEL3_D4S3_POSITION                             0x3
#define _CLCnSEL3_D4S3_SIZE                                 0x1
#define _CLCnSEL3_D4S3_LENGTH                               0x1
#define _CLCnSEL3_D4S3_MASK                                 0x8
#define _CLCnSEL3_D4S4_POSN                                 0x4
#define _CLCnSEL3_D4S4_POSITION                             0x4
#define _CLCnSEL3_D4S4_SIZE                                 0x1
#define _CLCnSEL3_D4S4_LENGTH                               0x1
#define _CLCnSEL3_D4S4_MASK                                 0x10
#define _CLCnSEL3_D4S5_POSN                                 0x5
#define _CLCnSEL3_D4S5_POSITION                             0x5
#define _CLCnSEL3_D4S5_SIZE                                 0x1
#define _CLCnSEL3_D4S5_LENGTH                               0x1
#define _CLCnSEL3_D4S5_MASK                                 0x20

// Register: CLCnGLS0
#define CLCnGLS0 CLCnGLS0
extern volatile unsigned char           CLCnGLS0            __at(0x1AB);
#ifndef _LIB_BUILD
asm("CLCnGLS0 equ 01ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
} CLCnGLS0bits_t;
extern volatile CLCnGLS0bits_t CLCnGLS0bits __at(0x1AB);
// bitfield macros
#define _CLCnGLS0_G1D1N_POSN                                0x0
#define _CLCnGLS0_G1D1N_POSITION                            0x0
#define _CLCnGLS0_G1D1N_SIZE                                0x1
#define _CLCnGLS0_G1D1N_LENGTH                              0x1
#define _CLCnGLS0_G1D1N_MASK                                0x1
#define _CLCnGLS0_G1D1T_POSN                                0x1
#define _CLCnGLS0_G1D1T_POSITION                            0x1
#define _CLCnGLS0_G1D1T_SIZE                                0x1
#define _CLCnGLS0_G1D1T_LENGTH                              0x1
#define _CLCnGLS0_G1D1T_MASK                                0x2
#define _CLCnGLS0_G1D2N_POSN                                0x2
#define _CLCnGLS0_G1D2N_POSITION                            0x2
#define _CLCnGLS0_G1D2N_SIZE                                0x1
#define _CLCnGLS0_G1D2N_LENGTH                              0x1
#define _CLCnGLS0_G1D2N_MASK                                0x4
#define _CLCnGLS0_G1D2T_POSN                                0x3
#define _CLCnGLS0_G1D2T_POSITION                            0x3
#define _CLCnGLS0_G1D2T_SIZE                                0x1
#define _CLCnGLS0_G1D2T_LENGTH                              0x1
#define _CLCnGLS0_G1D2T_MASK                                0x8
#define _CLCnGLS0_G1D3N_POSN                                0x4
#define _CLCnGLS0_G1D3N_POSITION                            0x4
#define _CLCnGLS0_G1D3N_SIZE                                0x1
#define _CLCnGLS0_G1D3N_LENGTH                              0x1
#define _CLCnGLS0_G1D3N_MASK                                0x10
#define _CLCnGLS0_G1D3T_POSN                                0x5
#define _CLCnGLS0_G1D3T_POSITION                            0x5
#define _CLCnGLS0_G1D3T_SIZE                                0x1
#define _CLCnGLS0_G1D3T_LENGTH                              0x1
#define _CLCnGLS0_G1D3T_MASK                                0x20
#define _CLCnGLS0_G1D4N_POSN                                0x6
#define _CLCnGLS0_G1D4N_POSITION                            0x6
#define _CLCnGLS0_G1D4N_SIZE                                0x1
#define _CLCnGLS0_G1D4N_LENGTH                              0x1
#define _CLCnGLS0_G1D4N_MASK                                0x40
#define _CLCnGLS0_G1D4T_POSN                                0x7
#define _CLCnGLS0_G1D4T_POSITION                            0x7
#define _CLCnGLS0_G1D4T_SIZE                                0x1
#define _CLCnGLS0_G1D4T_LENGTH                              0x1
#define _CLCnGLS0_G1D4T_MASK                                0x80

// Register: CLCnGLS1
#define CLCnGLS1 CLCnGLS1
extern volatile unsigned char           CLCnGLS1            __at(0x1AC);
#ifndef _LIB_BUILD
asm("CLCnGLS1 equ 01ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G2D1N                  :1;
        unsigned G2D1T                  :1;
        unsigned G2D2N                  :1;
        unsigned G2D2T                  :1;
        unsigned G2D3N                  :1;
        unsigned G2D3T                  :1;
        unsigned G2D4N                  :1;
        unsigned G2D4T                  :1;
    };
} CLCnGLS1bits_t;
extern volatile CLCnGLS1bits_t CLCnGLS1bits __at(0x1AC);
// bitfield macros
#define _CLCnGLS1_G2D1N_POSN                                0x0
#define _CLCnGLS1_G2D1N_POSITION                            0x0
#define _CLCnGLS1_G2D1N_SIZE                                0x1
#define _CLCnGLS1_G2D1N_LENGTH                              0x1
#define _CLCnGLS1_G2D1N_MASK                                0x1
#define _CLCnGLS1_G2D1T_POSN                                0x1
#define _CLCnGLS1_G2D1T_POSITION                            0x1
#define _CLCnGLS1_G2D1T_SIZE                                0x1
#define _CLCnGLS1_G2D1T_LENGTH                              0x1
#define _CLCnGLS1_G2D1T_MASK                                0x2
#define _CLCnGLS1_G2D2N_POSN                                0x2
#define _CLCnGLS1_G2D2N_POSITION                            0x2
#define _CLCnGLS1_G2D2N_SIZE                                0x1
#define _CLCnGLS1_G2D2N_LENGTH                              0x1
#define _CLCnGLS1_G2D2N_MASK                                0x4
#define _CLCnGLS1_G2D2T_POSN                                0x3
#define _CLCnGLS1_G2D2T_POSITION                            0x3
#define _CLCnGLS1_G2D2T_SIZE                                0x1
#define _CLCnGLS1_G2D2T_LENGTH                              0x1
#define _CLCnGLS1_G2D2T_MASK                                0x8
#define _CLCnGLS1_G2D3N_POSN                                0x4
#define _CLCnGLS1_G2D3N_POSITION                            0x4
#define _CLCnGLS1_G2D3N_SIZE                                0x1
#define _CLCnGLS1_G2D3N_LENGTH                              0x1
#define _CLCnGLS1_G2D3N_MASK                                0x10
#define _CLCnGLS1_G2D3T_POSN                                0x5
#define _CLCnGLS1_G2D3T_POSITION                            0x5
#define _CLCnGLS1_G2D3T_SIZE                                0x1
#define _CLCnGLS1_G2D3T_LENGTH                              0x1
#define _CLCnGLS1_G2D3T_MASK                                0x20
#define _CLCnGLS1_G2D4N_POSN                                0x6
#define _CLCnGLS1_G2D4N_POSITION                            0x6
#define _CLCnGLS1_G2D4N_SIZE                                0x1
#define _CLCnGLS1_G2D4N_LENGTH                              0x1
#define _CLCnGLS1_G2D4N_MASK                                0x40
#define _CLCnGLS1_G2D4T_POSN                                0x7
#define _CLCnGLS1_G2D4T_POSITION                            0x7
#define _CLCnGLS1_G2D4T_SIZE                                0x1
#define _CLCnGLS1_G2D4T_LENGTH                              0x1
#define _CLCnGLS1_G2D4T_MASK                                0x80

// Register: CLCnGLS2
#define CLCnGLS2 CLCnGLS2
extern volatile unsigned char           CLCnGLS2            __at(0x1AD);
#ifndef _LIB_BUILD
asm("CLCnGLS2 equ 01ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G3D1N                  :1;
        unsigned G3D1T                  :1;
        unsigned G3D2N                  :1;
        unsigned G3D2T                  :1;
        unsigned G3D3N                  :1;
        unsigned G3D3T                  :1;
        unsigned G3D4N                  :1;
        unsigned G3D4T                  :1;
    };
} CLCnGLS2bits_t;
