garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: ADCG1B
#define ADCG1B ADCG1B
extern volatile unsigned char           ADCG1B              __at(0x238);
#ifndef _LIB_BUILD
asm("ADCG1B equ 0238h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CGB5                   :1;
        unsigned CGB6                   :1;
        unsigned CGB7                   :1;
    };
} ADCG1Bbits_t;
extern volatile ADCG1Bbits_t ADCG1Bbits __at(0x238);
// bitfield macros
#define _ADCG1B_CGB5_POSN                                   0x5
#define _ADCG1B_CGB5_POSITION                               0x5
#define _ADCG1B_CGB5_SIZE                                   0x1
#define _ADCG1B_CGB5_LENGTH                                 0x1
#define _ADCG1B_CGB5_MASK                                   0x20
#define _ADCG1B_CGB6_POSN                                   0x6
#define _ADCG1B_CGB6_POSITION                               0x6
#define _ADCG1B_CGB6_SIZE                                   0x1
#define _ADCG1B_CGB6_LENGTH                                 0x1
#define _ADCG1B_CGB6_MASK                                   0x40
#define _ADCG1B_CGB7_POSN                                   0x7
#define _ADCG1B_CGB7_POSITION                               0x7
#define _ADCG1B_CGB7_SIZE                                   0x1
#define _ADCG1B_CGB7_LENGTH                                 0x1
#define _ADCG1B_CGB7_MASK                                   0x80

// Register: ADCG1C
#define ADCG1C ADCG1C
extern volatile unsigned char           ADCG1C              __at(0x239);
#ifndef _LIB_BUILD
asm("ADCG1C equ 0239h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGC0                   :1;
        unsigned CGC1                   :1;
        unsigned                        :1;
        unsigned CGC3                   :1;
        unsigned CGC4                   :1;
        unsigned CGC5                   :1;
        unsigned CGC6                   :1;
        unsigned CGC7                   :1;
    };
} ADCG1Cbits_t;
extern volatile ADCG1Cbits_t ADCG1Cbits __at(0x239);
// bitfield macros
#define _ADCG1C_CGC0_POSN                                   0x0
#define _ADCG1C_CGC0_POSITION                               0x0
#define _ADCG1C_CGC0_SIZE                                   0x1
#define _ADCG1C_CGC0_LENGTH                                 0x1
#define _ADCG1C_CGC0_MASK                                   0x1
#define _ADCG1C_CGC1_POSN                                   0x1
#define _ADCG1C_CGC1_POSITION                               0x1
#define _ADCG1C_CGC1_SIZE                                   0x1
#define _ADCG1C_CGC1_LENGTH                                 0x1
#define _ADCG1C_CGC1_MASK                                   0x2
#define _ADCG1C_CGC3_POSN                                   0x3
#define _ADCG1C_CGC3_POSITION                               0x3
#define _ADCG1C_CGC3_SIZE                                   0x1
#define _ADCG1C_CGC3_LENGTH                                 0x1
#define _ADCG1C_CGC3_MASK                                   0x8
#define _ADCG1C_CGC4_POSN                                   0x4
#define _ADCG1C_CGC4_POSITION                               0x4
#define _ADCG1C_CGC4_SIZE                                   0x1
#define _ADCG1C_CGC4_LENGTH                                 0x1
#define _ADCG1C_CGC4_MASK                                   0x10
#define _ADCG1C_CGC5_POSN                                   0x5
#define _ADCG1C_CGC5_POSITION                               0x5
#define _ADCG1C_CGC5_SIZE                                   0x1
#define _ADCG1C_CGC5_LENGTH                                 0x1
#define _ADCG1C_CGC5_MASK                                   0x20
#define _ADCG1C_CGC6_POSN                                   0x6
#define _ADCG1C_CGC6_POSITION                               0x6
#define _ADCG1C_CGC6_SIZE                                   0x1
#define _ADCG1C_CGC6_LENGTH                                 0x1
#define _ADCG1C_CGC6_MASK                                   0x40
#define _ADCG1C_CGC7_POSN                                   0x7
#define _ADCG1C_CGC7_POSITION                               0x7
#define _ADCG1C_CGC7_SIZE                                   0x1
#define _ADCG1C_CGC7_LENGTH                                 0x1
#define _ADCG1C_CGC7_MASK                                   0x80

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x300);
#ifndef _LIB_BUILD
asm("PMD0 equ 0300h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1MD                 :1;
        unsigned DMA2MD                 :1;
        unsigned DMA3MD                 :1;
        unsigned DMA4MD                 :1;
        unsigned                        :1;
        unsigned CRCMD                  :1;
        unsigned SCANMD                 :1;
        unsigned SYSCMD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x300);
// bitfield macros
#define _PMD0_DMA1MD_POSN                                   0x0
#define _PMD0_DMA1MD_POSITION                               0x0
#define _PMD0_DMA1MD_SIZE                                   0x1
#define _PMD0_DMA1MD_LENGTH                                 0x1
#define _PMD0_DMA1MD_MASK                                   0x1
#define _PMD0_DMA2MD_POSN                                   0x1
#define _PMD0_DMA2MD_POSITION                               0x1
#define _PMD0_DMA2MD_SIZE                                   0x1
#define _PMD0_DMA2MD_LENGTH                                 0x1
#define _PMD0_DMA2MD_MASK                                   0x2
#define _PMD0_DMA3MD_POSN                                   0x2
#define _PMD0_DMA3MD_POSITION                               0x2
#define _PMD0_DMA3MD_SIZE                                   0x1
#define _PMD0_DMA3MD_LENGTH                                 0x1
#define _PMD0_DMA3MD_MASK                                   0x4
#define _PMD0_DMA4MD_POSN                                   0x3
#define _PMD0_DMA4MD_POSITION                               0x3
#define _PMD0_DMA4MD_SIZE                                   0x1
#define _PMD0_DMA4MD_LENGTH                                 0x1
#define _PMD0_DMA4MD_MASK                                   0x8
#define _PMD0_CRCMD_POSN                                    0x5
#define _PMD0_CRCMD_POSITION                                0x5
#define _PMD0_CRCMD_SIZE                                    0x1
#define _PMD0_CRCMD_LENGTH                                  0x1
#define _PMD0_CRCMD_MASK                                    0x20
#define _PMD0_SCANMD_POSN                                   0x6
#define _PMD0_SCANMD_POSITION                               0x6
#define _PMD0_SCANMD_SIZE                                   0x1
#define _PMD0_SCANMD_LENGTH                                 0x1
#define _PMD0_SCANMD_MASK                                   0x40
#define _PMD0_SYSCMD_POSN                                   0x7
#define _PMD0_SYSCMD_POSITION                               0x7
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x301);
#ifndef _LIB_BUILD
asm("PMD1 equ 0301h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACTMD                  :1;
        unsigned PORTWMD                :1;
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR4MD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x301);
// bitfield macros
#define _PMD1_ACTMD_POSN                                    0x0
#define _PMD1_ACTMD_POSITION                                0x0
#define _PMD1_ACTMD_SIZE                                    0x1
#define _PMD1_ACTMD_LENGTH                                  0x1
#define _PMD1_ACTMD_MASK                                    0x1
#define _PMD1_PORTWMD_POSN                                  0x1
#define _PMD1_PORTWMD_POSITION                              0x1
#define _PMD1_PORTWMD_SIZE                                  0x1
#define _PMD1_PORTWMD_LENGTH                                0x1
#define _PMD1_PORTWMD_MASK                                  0x2
#define _PMD1_IOCMD_POSN                                    0x2
#define _PMD1_IOCMD_POSITION                                0x2
#define _PMD1_IOCMD_SIZE                                    0x1
#define _PMD1_IOCMD_LENGTH                                  0x1
#define _PMD1_IOCMD_MASK                                    0x4
#define _PMD1_CLKRMD_POSN                                   0x3
#define _PMD1_CLKRMD_POSITION                               0x3
#define _PMD1_CLKRMD_SIZE                                   0x1
#define _PMD1_CLKRMD_LENGTH                                 0x1
#define _PMD1_CLKRMD_MASK                                   0x8
#define _PMD1_TMR0MD_POSN                                   0x4
#define _PMD1_TMR0MD_POSITION                               0x4
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x10
#define _PMD1_TMR1MD_POSN                                   0x5
#define _PMD1_TMR1MD_POSITION                               0x5
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x20
#define _PMD1_TMR2MD_POSN                                   0x6
#define _PMD1_TMR2MD_POSITION                               0x6
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x40
#define _PMD1_TMR4MD_POSN                                   0x7
#define _PMD1_TMR4MD_POSITION                               0x7
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x80

