garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: PCLATU_SHAD
#define PCLATU_SHAD PCLATU_SHAD
extern volatile unsigned char           PCLATU_SHAD         __at(0x37B);
#ifndef _LIB_BUILD
asm("PCLATU_SHAD equ 037Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCU                    :5;
    };
} PCLATU_SHADbits_t;
extern volatile PCLATU_SHADbits_t PCLATU_SHADbits __at(0x37B);
// bitfield macros
#define _PCLATU_SHAD_PCU_POSN                               0x0
#define _PCLATU_SHAD_PCU_POSITION                           0x0
#define _PCLATU_SHAD_PCU_SIZE                               0x5
#define _PCLATU_SHAD_PCU_LENGTH                             0x5
#define _PCLATU_SHAD_PCU_MASK                               0x1F

// Register: FSR0_SHAD
#define FSR0_SHAD FSR0_SHAD
extern volatile unsigned short          FSR0_SHAD           __at(0x37C);
#ifndef _LIB_BUILD
asm("FSR0_SHAD equ 037Ch");
#endif

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
extern volatile unsigned char           FSR0L_SHAD          __at(0x37C);
#ifndef _LIB_BUILD
asm("FSR0L_SHAD equ 037Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L                  :8;
    };
} FSR0L_SHADbits_t;
extern volatile FSR0L_SHADbits_t FSR0L_SHADbits __at(0x37C);
// bitfield macros
#define _FSR0L_SHAD_FSR0L_POSN                              0x0
#define _FSR0L_SHAD_FSR0L_POSITION                          0x0
#define _FSR0L_SHAD_FSR0L_SIZE                              0x8
#define _FSR0L_SHAD_FSR0L_LENGTH                            0x8
#define _FSR0L_SHAD_FSR0L_MASK                              0xFF

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
extern volatile unsigned char           FSR0H_SHAD          __at(0x37D);
#ifndef _LIB_BUILD
asm("FSR0H_SHAD equ 037Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0H                  :6;
    };
} FSR0H_SHADbits_t;
extern volatile FSR0H_SHADbits_t FSR0H_SHADbits __at(0x37D);
// bitfield macros
#define _FSR0H_SHAD_FSR0H_POSN                              0x0
#define _FSR0H_SHAD_FSR0H_POSITION                          0x0
#define _FSR0H_SHAD_FSR0H_SIZE                              0x6
#define _FSR0H_SHAD_FSR0H_LENGTH                            0x6
#define _FSR0H_SHAD_FSR0H_MASK                              0x3F

// Register: FSR1_SHAD
#define FSR1_SHAD FSR1_SHAD
extern volatile unsigned short          FSR1_SHAD           __at(0x37E);
#ifndef _LIB_BUILD
asm("FSR1_SHAD equ 037Eh");
#endif

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
extern volatile unsigned char           FSR1L_SHAD          __at(0x37E);
#ifndef _LIB_BUILD
asm("FSR1L_SHAD equ 037Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1L                  :8;
    };
} FSR1L_SHADbits_t;
extern volatile FSR1L_SHADbits_t FSR1L_SHADbits __at(0x37E);
// bitfield macros
#define _FSR1L_SHAD_FSR1L_POSN                              0x0
#define _FSR1L_SHAD_FSR1L_POSITION                          0x0
#define _FSR1L_SHAD_FSR1L_SIZE                              0x8
#define _FSR1L_SHAD_FSR1L_LENGTH                            0x8
#define _FSR1L_SHAD_FSR1L_MASK                              0xFF

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
extern volatile unsigned char           FSR1H_SHAD          __at(0x37F);
#ifndef _LIB_BUILD
asm("FSR1H_SHAD equ 037Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1H                  :6;
    };
} FSR1H_SHADbits_t;
extern volatile FSR1H_SHADbits_t FSR1H_SHADbits __at(0x37F);
// bitfield macros
#define _FSR1H_SHAD_FSR1H_POSN                              0x0
#define _FSR1H_SHAD_FSR1H_POSITION                          0x0
#define _FSR1H_SHAD_FSR1H_SIZE                              0x6
#define _FSR1H_SHAD_FSR1H_LENGTH                            0x6
#define _FSR1H_SHAD_FSR1H_MASK                              0x3F

// Register: FSR2_SHAD
#define FSR2_SHAD FSR2_SHAD
extern volatile unsigned short          FSR2_SHAD           __at(0x380);
#ifndef _LIB_BUILD
asm("FSR2_SHAD equ 0380h");
#endif

// Register: FSR2L_SHAD
#define FSR2L_SHAD FSR2L_SHAD
extern volatile unsigned char           FSR2L_SHAD          __at(0x380);
#ifndef _LIB_BUILD
asm("FSR2L_SHAD equ 0380h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2L_SHADbits_t;
extern volatile FSR2L_SHADbits_t FSR2L_SHADbits __at(0x380);
// bitfield macros
#define _FSR2L_SHAD_FSR2L_POSN                              0x0
#define _FSR2L_SHAD_FSR2L_POSITION                          0x0
#define _FSR2L_SHAD_FSR2L_SIZE                              0x8
#define _FSR2L_SHAD_FSR2L_LENGTH                            0x8
#define _FSR2L_SHAD_FSR2L_MASK                              0xFF

// Register: FSR2H_SHAD
#define FSR2H_SHAD FSR2H_SHAD
extern volatile unsigned char           FSR2H_SHAD          __at(0x381);
#ifndef _LIB_BUILD
asm("FSR2H_SHAD equ 0381h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2H                  :6;
    };
} FSR2H_SHADbits_t;
extern volatile FSR2H_SHADbits_t FSR2H_SHADbits __at(0x381);
// bitfield macros
#define _FSR2H_SHAD_FSR2H_POSN                              0x0
#define _FSR2H_SHAD_FSR2H_POSITION                          0x0
#define _FSR2H_SHAD_FSR2H_SIZE                              0x6
#define _FSR2H_SHAD_FSR2H_LENGTH                            0x6
#define _FSR2H_SHAD_FSR2H_MASK                              0x3F

// Register: PROD_SHAD
#define PROD_SHAD PROD_SHAD
extern volatile unsigned short          PROD_SHAD           __at(0x382);
#ifndef _LIB_BUILD
asm("PROD_SHAD equ 0382h");
#endif

// Register: PRODL_SHAD
#define PRODL_SHAD PRODL_SHAD
extern volatile unsigned char           PRODL_SHAD          __at(0x382);
#ifndef _LIB_BUILD
asm("PRODL_SHAD equ 0382h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODL                  :8;
    };
} PRODL_SHADbits_t;
extern volatile PRODL_SHADbits_t PRODL_SHADbits __at(0x382);
// bitfield macros
#define _PRODL_SHAD_PRODL_POSN                              0x0
#define _PRODL_SHAD_PRODL_POSITION                          0x0
#define _PRODL_SHAD_PRODL_SIZE                              0x8
#define _PRODL_SHAD_PRODL_LENGTH                            0x8
#define _PRODL_SHAD_PRODL_MASK                              0xFF

// Register: PRODH_SHAD
#define PRODH_SHAD PRODH_SHAD
extern volatile unsigned char           PRODH_SHAD          __at(0x383);
#ifndef _LIB_BUILD
asm("PRODH_SHAD equ 0383h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODH                  :8;
    };
} PRODH_SHADbits_t;
extern volatile PRODH_SHADbits_t PRODH_SHADbits __at(0x383);
// bitfield macros
#define _PRODH_SHAD_PRODH_POSN                              0x0
#define _PRODH_SHAD_PRODH_POSITION                          0x0
#define _PRODH_SHAD_PRODH_SIZE                              0x8
#define _PRODH_SHAD_PRODH_LENGTH                            0x8
#define _PRODH_SHAD_PRODH_MASK                              0xFF

