garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: IOCCN
#define IOCCN IOCCN
extern volatile unsigned char           IOCCN               __at(0x430);
#ifndef _LIB_BUILD
asm("IOCCN equ 0430h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCCN0                 :1;
        unsigned IOCCN1                 :1;
        unsigned                        :1;
        unsigned IOCCN3                 :1;
        unsigned IOCCN4                 :1;
        unsigned IOCCN5                 :1;
        unsigned IOCCN6                 :1;
        unsigned IOCCN7                 :1;
    };
} IOCCNbits_t;
extern volatile IOCCNbits_t IOCCNbits __at(0x430);
// bitfield macros
#define _IOCCN_IOCCN0_POSN                                  0x0
#define _IOCCN_IOCCN0_POSITION                              0x0
#define _IOCCN_IOCCN0_SIZE                                  0x1
#define _IOCCN_IOCCN0_LENGTH                                0x1
#define _IOCCN_IOCCN0_MASK                                  0x1
#define _IOCCN_IOCCN1_POSN                                  0x1
#define _IOCCN_IOCCN1_POSITION                              0x1
#define _IOCCN_IOCCN1_SIZE                                  0x1
#define _IOCCN_IOCCN1_LENGTH                                0x1
#define _IOCCN_IOCCN1_MASK                                  0x2
#define _IOCCN_IOCCN3_POSN                                  0x3
#define _IOCCN_IOCCN3_POSITION                              0x3
#define _IOCCN_IOCCN3_SIZE                                  0x1
#define _IOCCN_IOCCN3_LENGTH                                0x1
#define _IOCCN_IOCCN3_MASK                                  0x8
#define _IOCCN_IOCCN4_POSN                                  0x4
#define _IOCCN_IOCCN4_POSITION                              0x4
#define _IOCCN_IOCCN4_SIZE                                  0x1
#define _IOCCN_IOCCN4_LENGTH                                0x1
#define _IOCCN_IOCCN4_MASK                                  0x10
#define _IOCCN_IOCCN5_POSN                                  0x5
#define _IOCCN_IOCCN5_POSITION                              0x5
#define _IOCCN_IOCCN5_SIZE                                  0x1
#define _IOCCN_IOCCN5_LENGTH                                0x1
#define _IOCCN_IOCCN5_MASK                                  0x20
#define _IOCCN_IOCCN6_POSN                                  0x6
#define _IOCCN_IOCCN6_POSITION                              0x6
#define _IOCCN_IOCCN6_SIZE                                  0x1
#define _IOCCN_IOCCN6_LENGTH                                0x1
#define _IOCCN_IOCCN6_MASK                                  0x40
#define _IOCCN_IOCCN7_POSN                                  0x7
#define _IOCCN_IOCCN7_POSITION                              0x7
#define _IOCCN_IOCCN7_SIZE                                  0x1
#define _IOCCN_IOCCN7_LENGTH                                0x1
#define _IOCCN_IOCCN7_MASK                                  0x80

// Register: IOCCF
#define IOCCF IOCCF
extern volatile unsigned char           IOCCF               __at(0x431);
#ifndef _LIB_BUILD
asm("IOCCF equ 0431h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCCF0                 :1;
        unsigned IOCCF1                 :1;
        unsigned                        :1;
        unsigned IOCCF3                 :1;
        unsigned IOCCF4                 :1;
        unsigned IOCCF5                 :1;
        unsigned IOCCF6                 :1;
        unsigned IOCCF7                 :1;
    };
} IOCCFbits_t;
extern volatile IOCCFbits_t IOCCFbits __at(0x431);
// bitfield macros
#define _IOCCF_IOCCF0_POSN                                  0x0
#define _IOCCF_IOCCF0_POSITION                              0x0
#define _IOCCF_IOCCF0_SIZE                                  0x1
#define _IOCCF_IOCCF0_LENGTH                                0x1
#define _IOCCF_IOCCF0_MASK                                  0x1
#define _IOCCF_IOCCF1_POSN                                  0x1
#define _IOCCF_IOCCF1_POSITION                              0x1
#define _IOCCF_IOCCF1_SIZE                                  0x1
#define _IOCCF_IOCCF1_LENGTH                                0x1
#define _IOCCF_IOCCF1_MASK                                  0x2
#define _IOCCF_IOCCF3_POSN                                  0x3
#define _IOCCF_IOCCF3_POSITION                              0x3
#define _IOCCF_IOCCF3_SIZE                                  0x1
#define _IOCCF_IOCCF3_LENGTH                                0x1
#define _IOCCF_IOCCF3_MASK                                  0x8
#define _IOCCF_IOCCF4_POSN                                  0x4
#define _IOCCF_IOCCF4_POSITION                              0x4
#define _IOCCF_IOCCF4_SIZE                                  0x1
#define _IOCCF_IOCCF4_LENGTH                                0x1
#define _IOCCF_IOCCF4_MASK                                  0x10
#define _IOCCF_IOCCF5_POSN                                  0x5
#define _IOCCF_IOCCF5_POSITION                              0x5
#define _IOCCF_IOCCF5_SIZE                                  0x1
#define _IOCCF_IOCCF5_LENGTH                                0x1
#define _IOCCF_IOCCF5_MASK                                  0x20
#define _IOCCF_IOCCF6_POSN                                  0x6
#define _IOCCF_IOCCF6_POSITION                              0x6
#define _IOCCF_IOCCF6_SIZE                                  0x1
#define _IOCCF_IOCCF6_LENGTH                                0x1
#define _IOCCF_IOCCF6_MASK                                  0x40
#define _IOCCF_IOCCF7_POSN                                  0x7
#define _IOCCF_IOCCF7_POSITION                              0x7
#define _IOCCF_IOCCF7_SIZE                                  0x1
#define _IOCCF_IOCCF7_LENGTH                                0x1
#define _IOCCF_IOCCF7_MASK                                  0x80

// Register: IOCWP
#define IOCWP IOCWP
extern volatile unsigned char           IOCWP               __at(0x457);
#ifndef _LIB_BUILD
asm("IOCWP equ 0457h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWP0                 :1;
        unsigned IOCWP1                 :1;
        unsigned IOCWP2                 :1;
        unsigned IOCWP3                 :1;
        unsigned IOCWP4                 :1;
        unsigned IOCWP5                 :1;
        unsigned IOCWP6                 :1;
        unsigned IOCWP7                 :1;
    };
} IOCWPbits_t;
extern volatile IOCWPbits_t IOCWPbits __at(0x457);
// bitfield macros
#define _IOCWP_IOCWP0_POSN                                  0x0
#define _IOCWP_IOCWP0_POSITION                              0x0
#define _IOCWP_IOCWP0_SIZE                                  0x1
#define _IOCWP_IOCWP0_LENGTH                                0x1
#define _IOCWP_IOCWP0_MASK                                  0x1
#define _IOCWP_IOCWP1_POSN                                  0x1
#define _IOCWP_IOCWP1_POSITION                              0x1
#define _IOCWP_IOCWP1_SIZE                                  0x1
#define _IOCWP_IOCWP1_LENGTH                                0x1
#define _IOCWP_IOCWP1_MASK                                  0x2
#define _IOCWP_IOCWP2_POSN                                  0x2
#define _IOCWP_IOCWP2_POSITION                              0x2
#define _IOCWP_IOCWP2_SIZE                                  0x1
#define _IOCWP_IOCWP2_LENGTH                                0x1
#define _IOCWP_IOCWP2_MASK                                  0x4
#define _IOCWP_IOCWP3_POSN                                  0x3
#define _IOCWP_IOCWP3_POSITION                              0x3
#define _IOCWP_IOCWP3_SIZE                                  0x1
#define _IOCWP_IOCWP3_LENGTH                                0x1
#define _IOCWP_IOCWP3_MASK                                  0x8
#define _IOCWP_IOCWP4_POSN                                  0x4
#define _IOCWP_IOCWP4_POSITION                              0x4
#define _IOCWP_IOCWP4_SIZE                                  0x1
#define _IOCWP_IOCWP4_LENGTH                                0x1
#define _IOCWP_IOCWP4_MASK                                  0x10
#define _IOCWP_IOCWP5_POSN                                  0x5
#define _IOCWP_IOCWP5_POSITION                              0x5
#define _IOCWP_IOCWP5_SIZE                                  0x1
#define _IOCWP_IOCWP5_LENGTH                                0x1
#define _IOCWP_IOCWP5_MASK                                  0x20
#define _IOCWP_IOCWP6_POSN                                  0x6
#define _IOCWP_IOCWP6_POSITION                              0x6
#define _IOCWP_IOCWP6_SIZE                                  0x1
#define _IOCWP_IOCWP6_LENGTH                                0x1
#define _IOCWP_IOCWP6_MASK                                  0x40
#define _IOCWP_IOCWP7_POSN                                  0x7
#define _IOCWP_IOCWP7_POSITION                              0x7
#define _IOCWP_IOCWP7_SIZE                                  0x1
#define _IOCWP_IOCWP7_LENGTH                                0x1
#define _IOCWP_IOCWP7_MASK                                  0x80

// Register: IOCWN
#define IOCWN IOCWN
extern volatile unsigned char           IOCWN               __at(0x458);
#ifndef _LIB_BUILD
asm("IOCWN equ 0458h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWN0                 :1;
        unsigned IOCWN1                 :1;
        unsigned IOCWN2                 :1;
        unsigned IOCWN3                 :1;
        unsigned IOCWN4                 :1;
        unsigned IOCWN5                 :1;
        unsigned IOCWN6                 :1;
        unsigned IOCWN7                 :1;
    };
} IOCWNbits_t;
extern volatile IOCWNbits_t IOCWNbits __at(0x458);
// bitfield macros
#define _IOCWN_IOCWN0_POSN                                  0x0
#define _IOCWN_IOCWN0_POSITION                              0x0
#define _IOCWN_IOCWN0_SIZE                                  0x1
#define _IOCWN_IOCWN0_LENGTH                                0x1
#define _IOCWN_IOCWN0_MASK                                  0x1
#define _IOCWN_IOCWN1_POSN                                  0x1
#define _IOCWN_IOCWN1_POSITION                              0x1
#define _IOCWN_IOCWN1_SIZE                                  0x1
#define _IOCWN_IOCWN1_LENGTH                                0x1
#define _IOCWN_IOCWN1_MASK                                  0x2
#define _IOCWN_IOCWN2_POSN                                  0x2
#define _IOCWN_IOCWN2_POSITION                              0x2
#define _IOCWN_IOCWN2_SIZE                                  0x1
#define _IOCWN_IOCWN2_LENGTH                                0x1
#define _IOCWN_IOCWN2_MASK                                  0x4
#define _IOCWN_IOCWN3_POSN                                  0x3
#define _IOCWN_IOCWN3_POSITION                              0x3
#define _IOCWN_IOCWN3_SIZE                                  0x1
#define _IOCWN_IOCWN3_LENGTH                                0x1
#define _IOCWN_IOCWN3_MASK                                  0x8
#define _IOCWN_IOCWN4_POSN                                  0x4
#define _IOCWN_IOCWN4_POSITION                              0x4
#define _IOCWN_IOCWN4_SIZE                                  0x1
#define _IOCWN_IOCWN4_LENGTH                                0x1
#define _IOCWN_IOCWN4_MASK                                  0x10
#define _IOCWN_IOCWN5_POSN                                  0x5
#define _IOCWN_IOCWN5_POSITION                              0x5
#define _IOCWN_IOCWN5_SIZE                                  0x1
#define _IOCWN_IOCWN5_LENGTH                                0x1
#define _IOCWN_IOCWN5_MASK                                  0x20
#define _IOCWN_IOCWN6_POSN                                  0x6
#define _IOCWN_IOCWN6_POSITION                              0x6
#define _IOCWN_IOCWN6_SIZE                                  0x1
#define _IOCWN_IOCWN6_LENGTH                                0x1
#define _IOCWN_IOCWN6_MASK                                  0x40
#define _IOCWN_IOCWN7_POSN                                  0x7
#define _IOCWN_IOCWN7_POSITION                              0x7
#define _IOCWN_IOCWN7_SIZE                                  0x1
#define _IOCWN_IOCWN7_LENGTH                                0x1
#define _IOCWN_IOCWN7_MASK                                  0x80

// Register: IOCWF
#define IOCWF IOCWF
extern volatile unsigned char           IOCWF               __at(0x459);
#ifndef _LIB_BUILD
asm("IOCWF equ 0459h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWF0                 :1;
        unsigned IOCWF1                 :1;
        unsigned IOCWF2                 :1;
        unsigned IOCWF3                 :1;
        unsigned IOCWF4                 :1;
        unsigned IOCWF5                 :1;
        unsigned IOCWF6                 :1;
        unsigned IOCWF7                 :1;
    };
} IOCWFbits_t;
