garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: INTCON1
#define INTCON1 INTCON1
extern volatile unsigned char           INTCON1             __at(0x462);
#ifndef _LIB_BUILD
asm("INTCON1 equ 0462h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned STAT                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned STAT0                  :1;
        unsigned STAT1                  :1;
    };
} INTCON1bits_t;
extern volatile INTCON1bits_t INTCON1bits __at(0x462);
// bitfield macros
#define _INTCON1_STAT_POSN                                  0x6
#define _INTCON1_STAT_POSITION                              0x6
#define _INTCON1_STAT_SIZE                                  0x2
#define _INTCON1_STAT_LENGTH                                0x2
#define _INTCON1_STAT_MASK                                  0xC0
#define _INTCON1_STAT0_POSN                                 0x6
#define _INTCON1_STAT0_POSITION                             0x6
#define _INTCON1_STAT0_SIZE                                 0x1
#define _INTCON1_STAT0_LENGTH                               0x1
#define _INTCON1_STAT0_MASK                                 0x40
#define _INTCON1_STAT1_POSN                                 0x7
#define _INTCON1_STAT1_POSITION                             0x7
#define _INTCON1_STAT1_SIZE                                 0x1
#define _INTCON1_STAT1_LENGTH                               0x1
#define _INTCON1_STAT1_MASK                                 0x80

// Register: IVTAD
#define IVTAD IVTAD
#ifndef __CCI__
extern volatile __uint24                IVTAD               __at(0x463);
#endif
#ifndef _LIB_BUILD
asm("IVTAD equ 0463h");
#endif

// Register: IVTADL
#define IVTADL IVTADL
extern volatile unsigned char           IVTADL              __at(0x463);
#ifndef _LIB_BUILD
asm("IVTADL equ 0463h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTADL                 :8;
    };
} IVTADLbits_t;
extern volatile IVTADLbits_t IVTADLbits __at(0x463);
// bitfield macros
#define _IVTADL_IVTADL_POSN                                 0x0
#define _IVTADL_IVTADL_POSITION                             0x0
#define _IVTADL_IVTADL_SIZE                                 0x8
#define _IVTADL_IVTADL_LENGTH                               0x8
#define _IVTADL_IVTADL_MASK                                 0xFF

// Register: IVTADH
#define IVTADH IVTADH
extern volatile unsigned char           IVTADH              __at(0x464);
#ifndef _LIB_BUILD
asm("IVTADH equ 0464h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTADH                 :8;
    };
} IVTADHbits_t;
extern volatile IVTADHbits_t IVTADHbits __at(0x464);
// bitfield macros
#define _IVTADH_IVTADH_POSN                                 0x0
#define _IVTADH_IVTADH_POSITION                             0x0
#define _IVTADH_IVTADH_SIZE                                 0x8
#define _IVTADH_IVTADH_LENGTH                               0x8
#define _IVTADH_IVTADH_MASK                                 0xFF

// Register: IVTADU
#define IVTADU IVTADU
extern volatile unsigned char           IVTADU              __at(0x465);
#ifndef _LIB_BUILD
asm("IVTADU equ 0465h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTADU                 :5;
    };
} IVTADUbits_t;
extern volatile IVTADUbits_t IVTADUbits __at(0x465);
// bitfield macros
#define _IVTADU_IVTADU_POSN                                 0x0
#define _IVTADU_IVTADU_POSITION                             0x0
#define _IVTADU_IVTADU_SIZE                                 0x5
#define _IVTADU_IVTADU_LENGTH                               0x5
#define _IVTADU_IVTADU_MASK                                 0x1F

// Register: IVTBASE
#define IVTBASE IVTBASE
#ifndef __CCI__
extern volatile __uint24                IVTBASE             __at(0x466);
#endif
#ifndef _LIB_BUILD
asm("IVTBASE equ 0466h");
#endif

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
extern volatile unsigned char           IVTBASEL            __at(0x466);
#ifndef _LIB_BUILD
asm("IVTBASEL equ 0466h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTBASEL               :8;
    };
} IVTBASELbits_t;
extern volatile IVTBASELbits_t IVTBASELbits __at(0x466);
// bitfield macros
#define _IVTBASEL_IVTBASEL_POSN                             0x0
#define _IVTBASEL_IVTBASEL_POSITION                         0x0
#define _IVTBASEL_IVTBASEL_SIZE                             0x8
#define _IVTBASEL_IVTBASEL_LENGTH                           0x8
#define _IVTBASEL_IVTBASEL_MASK                             0xFF

// Register: IVTBASEH
#define IVTBASEH IVTBASEH
extern volatile unsigned char           IVTBASEH            __at(0x467);
#ifndef _LIB_BUILD
asm("IVTBASEH equ 0467h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTBASEH               :8;
    };
} IVTBASEHbits_t;
extern volatile IVTBASEHbits_t IVTBASEHbits __at(0x467);
// bitfield macros
#define _IVTBASEH_IVTBASEH_POSN                             0x0
#define _IVTBASEH_IVTBASEH_POSITION                         0x0
#define _IVTBASEH_IVTBASEH_SIZE                             0x8
#define _IVTBASEH_IVTBASEH_LENGTH                           0x8
#define _IVTBASEH_IVTBASEH_MASK                             0xFF

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
extern volatile unsigned char           IVTBASEU            __at(0x468);
#ifndef _LIB_BUILD
asm("IVTBASEU equ 0468h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTBASEU               :5;
    };
} IVTBASEUbits_t;
extern volatile IVTBASEUbits_t IVTBASEUbits __at(0x468);
// bitfield macros
#define _IVTBASEU_IVTBASEU_POSN                             0x0
#define _IVTBASEU_IVTBASEU_POSITION                         0x0
#define _IVTBASEU_IVTBASEU_SIZE                             0x5
#define _IVTBASEU_IVTBASEU_LENGTH                           0x5
#define _IVTBASEU_IVTBASEU_MASK                             0x1F

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x469);
#ifndef _LIB_BUILD
asm("PIR0 equ 0469h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned INT0IF                 :1;
        unsigned INT1IF                 :1;
        unsigned INT2IF                 :1;
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
    };
} PIR0bits_t;
