garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x477);
#ifndef _LIB_BUILD
asm("PIE4 equ 0477h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR2IE                 :1;
        unsigned TMR4IE                 :1;
        unsigned TU16AIE                :1;
        unsigned TU16BIE                :1;
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned PWM1PIE                :1;
        unsigned PWM1IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x477);
// bitfield macros
#define _PIE4_TMR2IE_POSN                                   0x0
#define _PIE4_TMR2IE_POSITION                               0x0
#define _PIE4_TMR2IE_SIZE                                   0x1
#define _PIE4_TMR2IE_LENGTH                                 0x1
#define _PIE4_TMR2IE_MASK                                   0x1
#define _PIE4_TMR4IE_POSN                                   0x1
#define _PIE4_TMR4IE_POSITION                               0x1
#define _PIE4_TMR4IE_SIZE                                   0x1
#define _PIE4_TMR4IE_LENGTH                                 0x1
#define _PIE4_TMR4IE_MASK                                   0x2
#define _PIE4_TU16AIE_POSN                                  0x2
#define _PIE4_TU16AIE_POSITION                              0x2
#define _PIE4_TU16AIE_SIZE                                  0x1
#define _PIE4_TU16AIE_LENGTH                                0x1
#define _PIE4_TU16AIE_MASK                                  0x4
#define _PIE4_TU16BIE_POSN                                  0x3
#define _PIE4_TU16BIE_POSITION                              0x3
#define _PIE4_TU16BIE_SIZE                                  0x1
#define _PIE4_TU16BIE_LENGTH                                0x1
#define _PIE4_TU16BIE_MASK                                  0x8
#define _PIE4_CCP1IE_POSN                                   0x4
#define _PIE4_CCP1IE_POSITION                               0x4
#define _PIE4_CCP1IE_SIZE                                   0x1
#define _PIE4_CCP1IE_LENGTH                                 0x1
#define _PIE4_CCP1IE_MASK                                   0x10
#define _PIE4_CCP2IE_POSN                                   0x5
#define _PIE4_CCP2IE_POSITION                               0x5
#define _PIE4_CCP2IE_SIZE                                   0x1
#define _PIE4_CCP2IE_LENGTH                                 0x1
#define _PIE4_CCP2IE_MASK                                   0x20
#define _PIE4_PWM1PIE_POSN                                  0x6
#define _PIE4_PWM1PIE_POSITION                              0x6
#define _PIE4_PWM1PIE_SIZE                                  0x1
#define _PIE4_PWM1PIE_LENGTH                                0x1
#define _PIE4_PWM1PIE_MASK                                  0x40
#define _PIE4_PWM1IE_POSN                                   0x7
#define _PIE4_PWM1IE_POSITION                               0x7
#define _PIE4_PWM1IE_SIZE                                   0x1
#define _PIE4_PWM1IE_LENGTH                                 0x1
#define _PIE4_PWM1IE_MASK                                   0x80

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x478);
#ifndef _LIB_BUILD
asm("PIE5 equ 0478h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2PIE                :1;
        unsigned PWM2IE                 :1;
        unsigned CWG1IE                 :1;
        unsigned CLC1IE                 :1;
        unsigned CLC2IE                 :1;
        unsigned CLC3IE                 :1;
        unsigned CLC4IE                 :1;
        unsigned IOCSRIE                :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x478);
// bitfield macros
#define _PIE5_PWM2PIE_POSN                                  0x0
#define _PIE5_PWM2PIE_POSITION                              0x0
#define _PIE5_PWM2PIE_SIZE                                  0x1
#define _PIE5_PWM2PIE_LENGTH                                0x1
#define _PIE5_PWM2PIE_MASK                                  0x1
#define _PIE5_PWM2IE_POSN                                   0x1
#define _PIE5_PWM2IE_POSITION                               0x1
#define _PIE5_PWM2IE_SIZE                                   0x1
#define _PIE5_PWM2IE_LENGTH                                 0x1
#define _PIE5_PWM2IE_MASK                                   0x2
#define _PIE5_CWG1IE_POSN                                   0x2
#define _PIE5_CWG1IE_POSITION                               0x2
#define _PIE5_CWG1IE_SIZE                                   0x1
#define _PIE5_CWG1IE_LENGTH                                 0x1
#define _PIE5_CWG1IE_MASK                                   0x4
#define _PIE5_CLC1IE_POSN                                   0x3
#define _PIE5_CLC1IE_POSITION                               0x3
#define _PIE5_CLC1IE_SIZE                                   0x1
#define _PIE5_CLC1IE_LENGTH                                 0x1
#define _PIE5_CLC1IE_MASK                                   0x8
#define _PIE5_CLC2IE_POSN                                   0x4
#define _PIE5_CLC2IE_POSITION                               0x4
#define _PIE5_CLC2IE_SIZE                                   0x1
#define _PIE5_CLC2IE_LENGTH                                 0x1
#define _PIE5_CLC2IE_MASK                                   0x10
#define _PIE5_CLC3IE_POSN                                   0x5
#define _PIE5_CLC3IE_POSITION                               0x5
#define _PIE5_CLC3IE_SIZE                                   0x1
#define _PIE5_CLC3IE_LENGTH                                 0x1
#define _PIE5_CLC3IE_MASK                                   0x20
#define _PIE5_CLC4IE_POSN                                   0x6
#define _PIE5_CLC4IE_POSITION                               0x6
#define _PIE5_CLC4IE_SIZE                                   0x1
#define _PIE5_CLC4IE_LENGTH                                 0x1
#define _PIE5_CLC4IE_MASK                                   0x40
#define _PIE5_IOCSRIE_POSN                                  0x7
#define _PIE5_IOCSRIE_POSITION                              0x7
#define _PIE5_IOCSRIE_SIZE                                  0x1
#define _PIE5_IOCSRIE_LENGTH                                0x1
#define _PIE5_IOCSRIE_MASK                                  0x80

