garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile LATBbits_t LATBbits __at(0x494);
// bitfield macros
#define _LATB_LATB5_POSN                                    0x5
#define _LATB_LATB5_POSITION                                0x5
#define _LATB_LATB5_SIZE                                    0x1
#define _LATB_LATB5_LENGTH                                  0x1
#define _LATB_LATB5_MASK                                    0x20
#define _LATB_LATB6_POSN                                    0x6
#define _LATB_LATB6_POSITION                                0x6
#define _LATB_LATB6_SIZE                                    0x1
#define _LATB_LATB6_LENGTH                                  0x1
#define _LATB_LATB6_MASK                                    0x40
#define _LATB_LATB7_POSN                                    0x7
#define _LATB_LATB7_POSITION                                0x7
#define _LATB_LATB7_SIZE                                    0x1
#define _LATB_LATB7_LENGTH                                  0x1
#define _LATB_LATB7_MASK                                    0x80

// Register: LATC
#define LATC LATC
extern volatile unsigned char           LATC                __at(0x495);
#ifndef _LIB_BUILD
asm("LATC equ 0495h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATC0                  :1;
        unsigned LATC1                  :1;
        unsigned                        :1;
        unsigned LATC3                  :1;
        unsigned LATC4                  :1;
        unsigned LATC5                  :1;
        unsigned LATC6                  :1;
        unsigned LATC7                  :1;
    };
} LATCbits_t;
extern volatile LATCbits_t LATCbits __at(0x495);
// bitfield macros
#define _LATC_LATC0_POSN                                    0x0
#define _LATC_LATC0_POSITION                                0x0
#define _LATC_LATC0_SIZE                                    0x1
#define _LATC_LATC0_LENGTH                                  0x1
#define _LATC_LATC0_MASK                                    0x1
#define _LATC_LATC1_POSN                                    0x1
#define _LATC_LATC1_POSITION                                0x1
#define _LATC_LATC1_SIZE                                    0x1
#define _LATC_LATC1_LENGTH                                  0x1
#define _LATC_LATC1_MASK                                    0x2
#define _LATC_LATC3_POSN                                    0x3
#define _LATC_LATC3_POSITION                                0x3
#define _LATC_LATC3_SIZE                                    0x1
#define _LATC_LATC3_LENGTH                                  0x1
#define _LATC_LATC3_MASK                                    0x8
#define _LATC_LATC4_POSN                                    0x4
#define _LATC_LATC4_POSITION                                0x4
#define _LATC_LATC4_SIZE                                    0x1
#define _LATC_LATC4_LENGTH                                  0x1
#define _LATC_LATC4_MASK                                    0x10
#define _LATC_LATC5_POSN                                    0x5
#define _LATC_LATC5_POSITION                                0x5
#define _LATC_LATC5_SIZE                                    0x1
#define _LATC_LATC5_LENGTH                                  0x1
#define _LATC_LATC5_MASK                                    0x20
#define _LATC_LATC6_POSN                                    0x6
#define _LATC_LATC6_POSITION                                0x6
#define _LATC_LATC6_SIZE                                    0x1
#define _LATC_LATC6_LENGTH                                  0x1
#define _LATC_LATC6_MASK                                    0x40
#define _LATC_LATC7_POSN                                    0x7
#define _LATC_LATC7_POSITION                                0x7
#define _LATC_LATC7_SIZE                                    0x1
#define _LATC_LATC7_LENGTH                                  0x1
#define _LATC_LATC7_MASK                                    0x80

// Register: PORTW
#define PORTW PORTW
extern volatile unsigned char           PORTW               __at(0x499);
#ifndef _LIB_BUILD
asm("PORTW equ 0499h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RW0                    :1;
        unsigned RW1                    :1;
        unsigned RW2                    :1;
        unsigned RW3                    :1;
        unsigned RW4                    :1;
        unsigned RW5                    :1;
        unsigned RW6                    :1;
        unsigned RW7                    :1;
    };
} PORTWbits_t;
extern volatile PORTWbits_t PORTWbits __at(0x499);
// bitfield macros
#define _PORTW_RW0_POSN                                     0x0
#define _PORTW_RW0_POSITION                                 0x0
#define _PORTW_RW0_SIZE                                     0x1
#define _PORTW_RW0_LENGTH                                   0x1
#define _PORTW_RW0_MASK                                     0x1
#define _PORTW_RW1_POSN                                     0x1
#define _PORTW_RW1_POSITION                                 0x1
#define _PORTW_RW1_SIZE                                     0x1
#define _PORTW_RW1_LENGTH                                   0x1
#define _PORTW_RW1_MASK                                     0x2
#define _PORTW_RW2_POSN                                     0x2
#define _PORTW_RW2_POSITION                                 0x2
#define _PORTW_RW2_SIZE                                     0x1
#define _PORTW_RW2_LENGTH                                   0x1
#define _PORTW_RW2_MASK                                     0x4
#define _PORTW_RW3_POSN                                     0x3
#define _PORTW_RW3_POSITION                                 0x3
#define _PORTW_RW3_SIZE                                     0x1
#define _PORTW_RW3_LENGTH                                   0x1
#define _PORTW_RW3_MASK                                     0x8
#define _PORTW_RW4_POSN                                     0x4
#define _PORTW_RW4_POSITION                                 0x4
#define _PORTW_RW4_SIZE                                     0x1
#define _PORTW_RW4_LENGTH                                   0x1
#define _PORTW_RW4_MASK                                     0x10
#define _PORTW_RW5_POSN                                     0x5
#define _PORTW_RW5_POSITION                                 0x5
#define _PORTW_RW5_SIZE                                     0x1
#define _PORTW_RW5_LENGTH                                   0x1
#define _PORTW_RW5_MASK                                     0x20
#define _PORTW_RW6_POSN                                     0x6
#define _PORTW_RW6_POSITION                                 0x6
#define _PORTW_RW6_SIZE                                     0x1
#define _PORTW_RW6_LENGTH                                   0x1
#define _PORTW_RW6_MASK                                     0x40
#define _PORTW_RW7_POSN                                     0x7
#define _PORTW_RW7_POSITION                                 0x7
#define _PORTW_RW7_SIZE                                     0x1
#define _PORTW_RW7_LENGTH                                   0x1
#define _PORTW_RW7_MASK                                     0x80

// Register: LATW
#define LATW LATW
extern volatile unsigned char           LATW                __at(0x49A);
#ifndef _LIB_BUILD
asm("LATW equ 049Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATW0                  :1;
        unsigned LATW1                  :1;
        unsigned LATW2                  :1;
        unsigned LATW3                  :1;
        unsigned LATW4                  :1;
        unsigned LATW5                  :1;
        unsigned LATW6                  :1;
        unsigned LATW7                  :1;
    };
} LATWbits_t;
