garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile __bit                   DMA3SCNTIE          __at(0x23A4);	// @ (0x474 * 8 + 4)
#define                                 DMA3SCNTIE_bit      _BIT_ACCESS(PIE1,4)
// PIR1<DMA3SCNTIF>
extern volatile __bit                   DMA3SCNTIF          __at(0x2354);	// @ (0x46A * 8 + 4)
#define                                 DMA3SCNTIF_bit      _BIT_ACCESS(PIR1,4)
// IPR1<DMA3SCNTIP>
extern volatile __bit                   DMA3SCNTIP          __at(0x23F4);	// @ (0x47E * 8 + 4)
#define                                 DMA3SCNTIP_bit      _BIT_ACCESS(IPR1,4)
// PIE2<DMA4AIE>
extern volatile __bit                   DMA4AIE             __at(0x23AB);	// @ (0x475 * 8 + 3)
#define                                 DMA4AIE_bit         _BIT_ACCESS(PIE2,3)
// PIR2<DMA4AIF>
extern volatile __bit                   DMA4AIF             __at(0x235B);	// @ (0x46B * 8 + 3)
#define                                 DMA4AIF_bit         _BIT_ACCESS(PIR2,3)
// IPR2<DMA4AIP>
extern volatile __bit                   DMA4AIP             __at(0x23FB);	// @ (0x47F * 8 + 3)
#define                                 DMA4AIP_bit         _BIT_ACCESS(IPR2,3)
// PIE2<DMA4DCNTIE>
extern volatile __bit                   DMA4DCNTIE          __at(0x23A9);	// @ (0x475 * 8 + 1)
#define                                 DMA4DCNTIE_bit      _BIT_ACCESS(PIE2,1)
// PIR2<DMA4DCNTIF>
extern volatile __bit                   DMA4DCNTIF          __at(0x2359);	// @ (0x46B * 8 + 1)
#define                                 DMA4DCNTIF_bit      _BIT_ACCESS(PIR2,1)
// IPR2<DMA4DCNTIP>
extern volatile __bit                   DMA4DCNTIP          __at(0x23F9);	// @ (0x47F * 8 + 1)
#define                                 DMA4DCNTIP_bit      _BIT_ACCESS(IPR2,1)
// PMD0<DMA4MD>
extern volatile __bit                   DMA4MD              __at(0x1803);	// @ (0x300 * 8 + 3)
#define                                 DMA4MD_bit          _BIT_ACCESS(PMD0,3)
// PIE2<DMA4ORIE>
extern volatile __bit                   DMA4ORIE            __at(0x23AA);	// @ (0x475 * 8 + 2)
#define                                 DMA4ORIE_bit        _BIT_ACCESS(PIE2,2)
// PIR2<DMA4ORIF>
extern volatile __bit                   DMA4ORIF            __at(0x235A);	// @ (0x46B * 8 + 2)
#define                                 DMA4ORIF_bit        _BIT_ACCESS(PIR2,2)
// IPR2<DMA4ORIP>
extern volatile __bit                   DMA4ORIP            __at(0x23FA);	// @ (0x47F * 8 + 2)
#define                                 DMA4ORIP_bit        _BIT_ACCESS(IPR2,2)
// DMA4PR<DMA4PR0>
extern volatile __bit                   DMA4PR0             __at(0x1F0);	// @ (0x3E * 8 + 0)
#define                                 DMA4PR0_bit         _BIT_ACCESS(DMA4PR,0)
// DMA4PR<DMA4PR1>
extern volatile __bit                   DMA4PR1             __at(0x1F1);	// @ (0x3E * 8 + 1)
#define                                 DMA4PR1_bit         _BIT_ACCESS(DMA4PR,1)
// DMA4PR<DMA4PR2>
extern volatile __bit                   DMA4PR2             __at(0x1F2);	// @ (0x3E * 8 + 2)
#define                                 DMA4PR2_bit         _BIT_ACCESS(DMA4PR,2)
// PIE2<DMA4SCNTIE>
extern volatile __bit                   DMA4SCNTIE          __at(0x23A8);	// @ (0x475 * 8 + 0)
#define                                 DMA4SCNTIE_bit      _BIT_ACCESS(PIE2,0)
// PIR2<DMA4SCNTIF>
extern volatile __bit                   DMA4SCNTIF          __at(0x2358);	// @ (0x46B * 8 + 0)
#define                                 DMA4SCNTIF_bit      _BIT_ACCESS(PIR2,0)
// IPR2<DMA4SCNTIP>
extern volatile __bit                   DMA4SCNTIP          __at(0x23F8);	// @ (0x47F * 8 + 0)
#define                                 DMA4SCNTIP_bit      _BIT_ACCESS(IPR2,0)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x2794);	// @ (0x4F2 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1178);	// @ (0x22F * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x2790);	// @ (0x4F2 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x2791);	// @ (0x4F2 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x2792);	// @ (0x4F2 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x2796);	// @ (0x4F2 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// DMAnDPTRL<DPTR0>
extern volatile __bit                   DPTR0               __at(0x220);	// @ (0x44 * 8 + 0)
#define                                 DPTR0_bit           _BIT_ACCESS(DMAnDPTRL,0)
// DMAnDPTRL<DPTR1>
extern volatile __bit                   DPTR1               __at(0x221);	// @ (0x44 * 8 + 1)
#define                                 DPTR1_bit           _BIT_ACCESS(DMAnDPTRL,1)
// DMAnDPTRH<DPTR10>
extern volatile __bit                   DPTR10              __at(0x22A);	// @ (0x45 * 8 + 2)
#define                                 DPTR10_bit          _BIT_ACCESS(DMAnDPTRH,2)
// DMAnDPTRH<DPTR11>
extern volatile __bit                   DPTR11              __at(0x22B);	// @ (0x45 * 8 + 3)
#define                                 DPTR11_bit          _BIT_ACCESS(DMAnDPTRH,3)
// DMAnDPTRH<DPTR12>
extern volatile __bit                   DPTR12              __at(0x22C);	// @ (0x45 * 8 + 4)
#define                                 DPTR12_bit          _BIT_ACCESS(DMAnDPTRH,4)
// DMAnDPTRH<DPTR13>
extern volatile __bit                   DPTR13              __at(0x22D);	// @ (0x45 * 8 + 5)
#define                                 DPTR13_bit          _BIT_ACCESS(DMAnDPTRH,5)
// DMAnDPTRH<DPTR14>
extern volatile __bit                   DPTR14              __at(0x22E);	// @ (0x45 * 8 + 6)
#define                                 DPTR14_bit          _BIT_ACCESS(DMAnDPTRH,6)
// DMAnDPTRH<DPTR15>
extern volatile __bit                   DPTR15              __at(0x22F);	// @ (0x45 * 8 + 7)
#define                                 DPTR15_bit          _BIT_ACCESS(DMAnDPTRH,7)
// DMAnDPTRL<DPTR2>
extern volatile __bit                   DPTR2               __at(0x222);	// @ (0x44 * 8 + 2)
#define                                 DPTR2_bit           _BIT_ACCESS(DMAnDPTRL,2)
// DMAnDPTRL<DPTR3>
extern volatile __bit                   DPTR3               __at(0x223);	// @ (0x44 * 8 + 3)
#define                                 DPTR3_bit           _BIT_ACCESS(DMAnDPTRL,3)
// DMAnDPTRL<DPTR4>
extern volatile __bit                   DPTR4               __at(0x224);	// @ (0x44 * 8 + 4)
#define                                 DPTR4_bit           _BIT_ACCESS(DMAnDPTRL,4)
// DMAnDPTRL<DPTR5>
extern volatile __bit                   DPTR5               __at(0x225);	// @ (0x44 * 8 + 5)
#define                                 DPTR5_bit           _BIT_ACCESS(DMAnDPTRL,5)
// DMAnDPTRL<DPTR6>
extern volatile __bit                   DPTR6               __at(0x226);	// @ (0x44 * 8 + 6)
#define                                 DPTR6_bit           _BIT_ACCESS(DMAnDPTRL,6)
// DMAnDPTRL<DPTR7>
extern volatile __bit                   DPTR7               __at(0x227);	// @ (0x44 * 8 + 7)
#define                                 DPTR7_bit           _BIT_ACCESS(DMAnDPTRL,7)
// DMAnDPTRH<DPTR8>
extern volatile __bit                   DPTR8               __at(0x228);	// @ (0x45 * 8 + 0)
#define                                 DPTR8_bit           _BIT_ACCESS(DMAnDPTRH,0)
// DMAnDPTRH<DPTR9>
extern volatile __bit                   DPTR9               __at(0x229);	// @ (0x45 * 8 + 1)
#define                                 DPTR9_bit           _BIT_ACCESS(DMAnDPTRH,1)
// DMAnDSAL<DSA0>
extern volatile __bit                   DSA0                __at(0x240);	// @ (0x48 * 8 + 0)
#define                                 DSA0_bit            _BIT_ACCESS(DMAnDSAL,0)
// DMAnDSAL<DSA1>
extern volatile __bit                   DSA1                __at(0x241);	// @ (0x48 * 8 + 1)
#define                                 DSA1_bit            _BIT_ACCESS(DMAnDSAL,1)
// DMAnDSAH<DSA10>
extern volatile __bit                   DSA10               __at(0x24A);	// @ (0x49 * 8 + 2)
#define                                 DSA10_bit           _BIT_ACCESS(DMAnDSAH,2)
// DMAnDSAH<DSA11>
extern volatile __bit                   DSA11               __at(0x24B);	// @ (0x49 * 8 + 3)
#define                                 DSA11_bit           _BIT_ACCESS(DMAnDSAH,3)
// DMAnDSAH<DSA12>
extern volatile __bit                   DSA12               __at(0x24C);	// @ (0x49 * 8 + 4)
#define                                 DSA12_bit           _BIT_ACCESS(DMAnDSAH,4)
// DMAnDSAH<DSA13>
extern volatile __bit                   DSA13               __at(0x24D);	// @ (0x49 * 8 + 5)
#define                                 DSA13_bit           _BIT_ACCESS(DMAnDSAH,5)
// DMAnDSAH<DSA14>
extern volatile __bit                   DSA14               __at(0x24E);	// @ (0x49 * 8 + 6)
#define                                 DSA14_bit           _BIT_ACCESS(DMAnDSAH,6)
// DMAnDSAH<DSA15>
extern volatile __bit                   DSA15               __at(0x24F);	// @ (0x49 * 8 + 7)
#define                                 DSA15_bit           _BIT_ACCESS(DMAnDSAH,7)
// DMAnDSAL<DSA2>
extern volatile __bit                   DSA2                __at(0x242);	// @ (0x48 * 8 + 2)
#define                                 DSA2_bit            _BIT_ACCESS(DMAnDSAL,2)
// DMAnDSAL<DSA3>
extern volatile __bit                   DSA3                __at(0x243);	// @ (0x48 * 8 + 3)
#define                                 DSA3_bit            _BIT_ACCESS(DMAnDSAL,3)
// DMAnDSAL<DSA4>
extern volatile __bit                   DSA4                __at(0x244);	// @ (0x48 * 8 + 4)
#define                                 DSA4_bit            _BIT_ACCESS(DMAnDSAL,4)
// DMAnDSAL<DSA5>
extern volatile __bit                   DSA5                __at(0x245);	// @ (0x48 * 8 + 5)
#define                                 DSA5_bit            _BIT_ACCESS(DMAnDSAL,5)
// DMAnDSAL<DSA6>
extern volatile __bit                   DSA6                __at(0x246);	// @ (0x48 * 8 + 6)
#define                                 DSA6_bit            _BIT_ACCESS(DMAnDSAL,6)
// DMAnDSAL<DSA7>
extern volatile __bit                   DSA7                __at(0x247);	// @ (0x48 * 8 + 7)
#define                                 DSA7_bit            _BIT_ACCESS(DMAnDSAL,7)
// DMAnDSAH<DSA8>
extern volatile __bit                   DSA8                __at(0x248);	// @ (0x49 * 8 + 0)
#define                                 DSA8_bit            _BIT_ACCESS(DMAnDSAH,0)
// DMAnDSAH<DSA9>
extern volatile __bit                   DSA9                __at(0x249);	// @ (0x49 * 8 + 1)
#define                                 DSA9_bit            _BIT_ACCESS(DMAnDSAH,1)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1180);	// @ (0x230 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// DMAnCON1<DSTP>
extern volatile __bit                   DSTP                __at(0x2AD);	// @ (0x55 * 8 + 5)
#define                                 DSTP_bit            _BIT_ACCESS(DMAnCON1,5)
// DMAnDSZL<DSZ0>
extern volatile __bit                   DSZ0                __at(0x230);	// @ (0x46 * 8 + 0)
#define                                 DSZ0_bit            _BIT_ACCESS(DMAnDSZL,0)
// DMAnDSZL<DSZ1>
extern volatile __bit                   DSZ1                __at(0x231);	// @ (0x46 * 8 + 1)
#define                                 DSZ1_bit            _BIT_ACCESS(DMAnDSZL,1)
// DMAnDSZH<DSZ10>
extern volatile __bit                   DSZ10               __at(0x23A);	// @ (0x47 * 8 + 2)
#define                                 DSZ10_bit           _BIT_ACCESS(DMAnDSZH,2)
// DMAnDSZH<DSZ11>
extern volatile __bit                   DSZ11               __at(0x23B);	// @ (0x47 * 8 + 3)
#define                                 DSZ11_bit           _BIT_ACCESS(DMAnDSZH,3)
// DMAnDSZL<DSZ2>
extern volatile __bit                   DSZ2                __at(0x232);	// @ (0x46 * 8 + 2)
#define                                 DSZ2_bit            _BIT_ACCESS(DMAnDSZL,2)
// DMAnDSZL<DSZ3>
extern volatile __bit                   DSZ3                __at(0x233);	// @ (0x46 * 8 + 3)
#define                                 DSZ3_bit            _BIT_ACCESS(DMAnDSZL,3)
// DMAnDSZL<DSZ4>
extern volatile __bit                   DSZ4                __at(0x234);	// @ (0x46 * 8 + 4)
#define                                 DSZ4_bit            _BIT_ACCESS(DMAnDSZL,4)
// DMAnDSZL<DSZ5>
extern volatile __bit                   DSZ5                __at(0x235);	// @ (0x46 * 8 + 5)
#define                                 DSZ5_bit            _BIT_ACCESS(DMAnDSZL,5)
// DMAnDSZL<DSZ6>
extern volatile __bit                   DSZ6                __at(0x236);	// @ (0x46 * 8 + 6)
#define                                 DSZ6_bit            _BIT_ACCESS(DMAnDSZL,6)
// DMAnDSZL<DSZ7>
extern volatile __bit                   DSZ7                __at(0x237);	// @ (0x46 * 8 + 7)
#define                                 DSZ7_bit            _BIT_ACCESS(DMAnDSZL,7)
// DMAnDSZH<DSZ8>
extern volatile __bit                   DSZ8                __at(0x238);	// @ (0x47 * 8 + 0)
#define                                 DSZ8_bit            _BIT_ACCESS(DMAnDSZH,0)
// DMAnDSZH<DSZ9>
extern volatile __bit                   DSZ9                __at(0x239);	// @ (0x47 * 8 + 1)
#define                                 DSZ9_bit            _BIT_ACCESS(DMAnDSZH,1)
// SPI1INTE<EOSIE>
extern volatile __bit                   EOSIE               __at(0xF14);	// @ (0x1E2 * 8 + 4)
#define                                 EOSIE_bit           _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<EOSIF>
extern volatile __bit                   EOSIF               __at(0xF0C);	// @ (0x1E1 * 8 + 4)
#define                                 EOSIF_bit           _BIT_ACCESS(SPI1INTF,4)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x10C8);	// @ (0x219 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x10C9);	// @ (0x219 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x10D2);	// @ (0x21A * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x10D3);	// @ (0x21A * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x10D4);	// @ (0x21A * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x10D5);	// @ (0x21A * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x10D6);	// @ (0x21A * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x10D7);	// @ (0x21A * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x10CA);	// @ (0x219 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x10CB);	// @ (0x219 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x10CC);	// @ (0x219 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x10CD);	// @ (0x219 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x10CE);	// @ (0x219 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x10CF);	// @ (0x219 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x10D0);	// @ (0x21A * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x10D1);	// @ (0x21A * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x3F7);	// @ (0x7E * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x3EF);	// @ (0x7D * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0x10E8);	// @ (0x21D * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0x10E9);	// @ (0x21D * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0x10F2);	// @ (0x21E * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0x10F3);	// @ (0x21E * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0x10F4);	// @ (0x21E * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0x10F5);	// @ (0x21E * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0x10F6);	// @ (0x21E * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0x10F7);	// @ (0x21E * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0x10EA);	// @ (0x21D * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0x10EB);	// @ (0x21D * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0x10EC);	// @ (0x21D * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0x10ED);	// @ (0x21D * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0x10EE);	// @ (0x21D * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0x10EF);	// @ (0x21D * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0x10F0);	// @ (0x21E * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0x10F1);	// @ (0x21E * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0x117A);	// @ (0x22F * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// I2C1CON3<FME0>
extern volatile __bit                   FME0                __at(0xF4A);	// @ (0x1E9 * 8 + 2)
#define                                 FME0_bit            _BIT_ACCESS(I2C1CON3,2)
// I2C1CON3<FME1>
extern volatile __bit                   FME1                __at(0xF4B);	// @ (0x1E9 * 8 + 3)
#define                                 FME1_bit            _BIT_ACCESS(I2C1CON3,3)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x400);	// @ (0x80 * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x401);	// @ (0x80 * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x402);	// @ (0x80 * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<FRQ3>
extern volatile __bit                   FRQ3                __at(0x403);	// @ (0x80 * 8 + 3)
#define                                 FRQ3_bit            _BIT_ACCESS(OSCFRQ,3)
// FSCMCON<FSCMFEV>
extern volatile __bit                   FSCMFEV             __at(0x410);	// @ (0x82 * 8 + 0)
#define                                 FSCMFEV_bit         _BIT_ACCESS(FSCMCON,0)
// FSCMCON<FSCMFFI>
extern volatile __bit                   FSCMFFI             __at(0x411);	// @ (0x82 * 8 + 1)
#define                                 FSCMFFI_bit         _BIT_ACCESS(FSCMCON,1)
// FSCMCON<FSCMPEV>
extern volatile __bit                   FSCMPEV             __at(0x412);	// @ (0x82 * 8 + 2)
#define                                 FSCMPEV_bit         _BIT_ACCESS(FSCMCON,2)
// FSCMCON<FSCMPFI>
extern volatile __bit                   FSCMPFI             __at(0x413);	// @ (0x82 * 8 + 3)
#define                                 FSCMPFI_bit         _BIT_ACCESS(FSCMCON,3)
// FSCMCON<FSCMSEV>
extern volatile __bit                   FSCMSEV             __at(0x414);	// @ (0x82 * 8 + 4)
#define                                 FSCMSEV_bit         _BIT_ACCESS(FSCMCON,4)
// FSCMCON<FSCMSFI>
extern volatile __bit                   FSCMSFI             __at(0x415);	// @ (0x82 * 8 + 5)
#define                                 FSCMSFI_bit         _BIT_ACCESS(FSCMCON,5)
// SPI1CON1<FST>
extern volatile __bit                   FST                 __at(0xEE4);	// @ (0x1DC * 8 + 4)
#define                                 FST_bit             _BIT_ACCESS(SPI1CON1,4)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x100F);	// @ (0x201 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD4<FVRMD>
