garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
#define                                 I2C1SCLPPS2_bit     _BIT_ACCESS(I2C1SCLPPS,2)
// I2C1SCLPPS<I2C1SCLPPS3>
extern volatile __bit                   I2C1SCLPPS3         __at(0x1D6B);	// @ (0x3AD * 8 + 3)
#define                                 I2C1SCLPPS3_bit     _BIT_ACCESS(I2C1SCLPPS,3)
// I2C1SCLPPS<I2C1SCLPPS4>
extern volatile __bit                   I2C1SCLPPS4         __at(0x1D6C);	// @ (0x3AD * 8 + 4)
#define                                 I2C1SCLPPS4_bit     _BIT_ACCESS(I2C1SCLPPS,4)
// I2C1SDAPPS<I2C1SDAPPS0>
extern volatile __bit                   I2C1SDAPPS0         __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 I2C1SDAPPS0_bit     _BIT_ACCESS(I2C1SDAPPS,0)
// I2C1SDAPPS<I2C1SDAPPS1>
extern volatile __bit                   I2C1SDAPPS1         __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 I2C1SDAPPS1_bit     _BIT_ACCESS(I2C1SDAPPS,1)
// I2C1SDAPPS<I2C1SDAPPS2>
extern volatile __bit                   I2C1SDAPPS2         __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 I2C1SDAPPS2_bit     _BIT_ACCESS(I2C1SDAPPS,2)
// I2C1SDAPPS<I2C1SDAPPS3>
extern volatile __bit                   I2C1SDAPPS3         __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 I2C1SDAPPS3_bit     _BIT_ACCESS(I2C1SDAPPS,3)
// I2C1SDAPPS<I2C1SDAPPS4>
extern volatile __bit                   I2C1SDAPPS4         __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 I2C1SDAPPS4_bit     _BIT_ACCESS(I2C1SDAPPS,4)
// PIE7<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x23D4);	// @ (0x47A * 8 + 4)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE7,4)
// PIR7<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x2384);	// @ (0x470 * 8 + 4)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR7,4)
// IPR7<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x2424);	// @ (0x484 * 8 + 4)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR7,4)
// I2C1BTOC<I2CBTOC0>
extern volatile __bit                   I2CBTOC0            __at(0xFD0);	// @ (0x1FA * 8 + 0)
#define                                 I2CBTOC0_bit        _BIT_ACCESS(I2C1BTOC,0)
// I2C1BTOC<I2CBTOC1>
extern volatile __bit                   I2CBTOC1            __at(0xFD1);	// @ (0x1FA * 8 + 1)
#define                                 I2CBTOC1_bit        _BIT_ACCESS(I2C1BTOC,1)
// I2C1BTOC<I2CBTOC2>
extern volatile __bit                   I2CBTOC2            __at(0xFD2);	// @ (0x1FA * 8 + 2)
#define                                 I2CBTOC2_bit        _BIT_ACCESS(I2C1BTOC,2)
// I2C1CLK<I2CCLK0>
extern volatile __bit                   I2CCLK0             __at(0xFC8);	// @ (0x1F9 * 8 + 0)
#define                                 I2CCLK0_bit         _BIT_ACCESS(I2C1CLK,0)
// I2C1CLK<I2CCLK1>
extern volatile __bit                   I2CCLK1             __at(0xFC9);	// @ (0x1F9 * 8 + 1)
#define                                 I2CCLK1_bit         _BIT_ACCESS(I2C1CLK,1)
// I2C1CLK<I2CCLK2>
extern volatile __bit                   I2CCLK2             __at(0xFCA);	// @ (0x1F9 * 8 + 2)
#define                                 I2CCLK2_bit         _BIT_ACCESS(I2C1CLK,2)
// I2C1CLK<I2CCLK3>
extern volatile __bit                   I2CCLK3             __at(0xFCB);	// @ (0x1F9 * 8 + 3)
#define                                 I2CCLK3_bit         _BIT_ACCESS(I2C1CLK,3)
// I2C1CON0<I2CEN>
extern volatile __bit                   I2CEN               __at(0xF37);	// @ (0x1E6 * 8 + 7)
#define                                 I2CEN_bit           _BIT_ACCESS(I2C1CON0,7)
// PIE8<I3C1EIE>
extern volatile __bit                   I3C1EIE             __at(0x23DB);	// @ (0x47B * 8 + 3)
#define                                 I3C1EIE_bit         _BIT_ACCESS(PIE8,3)
// PIR8<I3C1EIF>
extern volatile __bit                   I3C1EIF             __at(0x238B);	// @ (0x471 * 8 + 3)
#define                                 I3C1EIF_bit         _BIT_ACCESS(PIR8,3)
// IPR8<I3C1EIP>
extern volatile __bit                   I3C1EIP             __at(0x242B);	// @ (0x485 * 8 + 3)
#define                                 I3C1EIP_bit         _BIT_ACCESS(IPR8,3)
// PIE8<I3C1IE>
extern volatile __bit                   I3C1IE              __at(0x23DA);	// @ (0x47B * 8 + 2)
#define                                 I3C1IE_bit          _BIT_ACCESS(PIE8,2)
// PIR8<I3C1IF>
extern volatile __bit                   I3C1IF              __at(0x238A);	// @ (0x471 * 8 + 2)
#define                                 I3C1IF_bit          _BIT_ACCESS(PIR8,2)
// IPR8<I3C1IP>
extern volatile __bit                   I3C1IP              __at(0x242A);	// @ (0x485 * 8 + 2)
#define                                 I3C1IP_bit          _BIT_ACCESS(IPR8,2)
// PMD3<I3C1MD>
extern volatile __bit                   I3C1MD              __at(0x181F);	// @ (0x303 * 8 + 7)
#define                                 I3C1MD_bit          _BIT_ACCESS(PMD3,7)
// PIE8<I3C1RIE>
extern volatile __bit                   I3C1RIE             __at(0x23DC);	// @ (0x47B * 8 + 4)
#define                                 I3C1RIE_bit         _BIT_ACCESS(PIE8,4)
// PIR8<I3C1RIF>
extern volatile __bit                   I3C1RIF             __at(0x238C);	// @ (0x471 * 8 + 4)
#define                                 I3C1RIF_bit         _BIT_ACCESS(PIR8,4)
// IPR8<I3C1RIP>
extern volatile __bit                   I3C1RIP             __at(0x242C);	// @ (0x485 * 8 + 4)
#define                                 I3C1RIP_bit         _BIT_ACCESS(IPR8,4)
// PIE8<I3C1RXIE>
extern volatile __bit                   I3C1RXIE            __at(0x23D8);	// @ (0x47B * 8 + 0)
#define                                 I3C1RXIE_bit        _BIT_ACCESS(PIE8,0)
// PIR8<I3C1RXIF>
extern volatile __bit                   I3C1RXIF            __at(0x2388);	// @ (0x471 * 8 + 0)
#define                                 I3C1RXIF_bit        _BIT_ACCESS(PIR8,0)
// IPR8<I3C1RXIP>
extern volatile __bit                   I3C1RXIP            __at(0x2428);	// @ (0x485 * 8 + 0)
#define                                 I3C1RXIP_bit        _BIT_ACCESS(IPR8,0)
// PIE8<I3C1TXIE>
extern volatile __bit                   I3C1TXIE            __at(0x23D9);	// @ (0x47B * 8 + 1)
#define                                 I3C1TXIE_bit        _BIT_ACCESS(PIE8,1)
// PIR8<I3C1TXIF>
extern volatile __bit                   I3C1TXIF            __at(0x2389);	// @ (0x471 * 8 + 1)
#define                                 I3C1TXIF_bit        _BIT_ACCESS(PIR8,1)
// IPR8<I3C1TXIP>
extern volatile __bit                   I3C1TXIP            __at(0x2429);	// @ (0x485 * 8 + 1)
#define                                 I3C1TXIP_bit        _BIT_ACCESS(IPR8,1)
// PIE9<I3C2EIE>
extern volatile __bit                   I3C2EIE             __at(0x23E3);	// @ (0x47C * 8 + 3)
#define                                 I3C2EIE_bit         _BIT_ACCESS(PIE9,3)
// PIR9<I3C2EIF>
extern volatile __bit                   I3C2EIF             __at(0x2393);	// @ (0x472 * 8 + 3)
#define                                 I3C2EIF_bit         _BIT_ACCESS(PIR9,3)
// IPR9<I3C2EIP>
extern volatile __bit                   I3C2EIP             __at(0x2433);	// @ (0x486 * 8 + 3)
#define                                 I3C2EIP_bit         _BIT_ACCESS(IPR9,3)
// PIE9<I3C2IE>
extern volatile __bit                   I3C2IE              __at(0x23E2);	// @ (0x47C * 8 + 2)
#define                                 I3C2IE_bit          _BIT_ACCESS(PIE9,2)
// PIR9<I3C2IF>
extern volatile __bit                   I3C2IF              __at(0x2392);	// @ (0x472 * 8 + 2)
#define                                 I3C2IF_bit          _BIT_ACCESS(PIR9,2)
// IPR9<I3C2IP>
extern volatile __bit                   I3C2IP              __at(0x2432);	// @ (0x486 * 8 + 2)
#define                                 I3C2IP_bit          _BIT_ACCESS(IPR9,2)
// PMD4<I3C2MD>
extern volatile __bit                   I3C2MD              __at(0x1820);	// @ (0x304 * 8 + 0)
#define                                 I3C2MD_bit          _BIT_ACCESS(PMD4,0)
// PIE9<I3C2RIE>
extern volatile __bit                   I3C2RIE             __at(0x23E4);	// @ (0x47C * 8 + 4)
#define                                 I3C2RIE_bit         _BIT_ACCESS(PIE9,4)
// PIR9<I3C2RIF>
extern volatile __bit                   I3C2RIF             __at(0x2394);	// @ (0x472 * 8 + 4)
#define                                 I3C2RIF_bit         _BIT_ACCESS(PIR9,4)
// IPR9<I3C2RIP>
extern volatile __bit                   I3C2RIP             __at(0x2434);	// @ (0x486 * 8 + 4)
#define                                 I3C2RIP_bit         _BIT_ACCESS(IPR9,4)
// PIE9<I3C2RXIE>
extern volatile __bit                   I3C2RXIE            __at(0x23E0);	// @ (0x47C * 8 + 0)
#define                                 I3C2RXIE_bit        _BIT_ACCESS(PIE9,0)
// PIR9<I3C2RXIF>
extern volatile __bit                   I3C2RXIF            __at(0x2390);	// @ (0x472 * 8 + 0)
#define                                 I3C2RXIF_bit        _BIT_ACCESS(PIR9,0)
// IPR9<I3C2RXIP>
extern volatile __bit                   I3C2RXIP            __at(0x2430);	// @ (0x486 * 8 + 0)
#define                                 I3C2RXIP_bit        _BIT_ACCESS(IPR9,0)
// PIE9<I3C2TXIE>
extern volatile __bit                   I3C2TXIE            __at(0x23E1);	// @ (0x47C * 8 + 1)
#define                                 I3C2TXIE_bit        _BIT_ACCESS(PIE9,1)
// PIR9<I3C2TXIF>
extern volatile __bit                   I3C2TXIF            __at(0x2391);	// @ (0x472 * 8 + 1)
#define                                 I3C2TXIF_bit        _BIT_ACCESS(PIR9,1)
// IPR9<I3C2TXIP>
extern volatile __bit                   I3C2TXIP            __at(0x2431);	// @ (0x486 * 8 + 1)
#define                                 I3C2TXIP_bit        _BIT_ACCESS(IPR9,1)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x2797);	// @ (0x4F2 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0xCF5);	// @ (0x19E * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x20D0);	// @ (0x41A * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x20D1);	// @ (0x41A * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x20D2);	// @ (0x41A * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x20D3);	// @ (0x41A * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x20D4);	// @ (0x41A * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x20D5);	// @ (0x41A * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x2125);	// @ (0x424 * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x2126);	// @ (0x424 * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x2127);	// @ (0x424 * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x2170);	// @ (0x42E * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x2171);	// @ (0x42E * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x2173);	// @ (0x42E * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x2174);	// @ (0x42E * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x2175);	// @ (0x42E * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x2176);	// @ (0x42E * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x2177);	// @ (0x42E * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INTCON0<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x2308);	// @ (0x461 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON0,0)
// PIE0<INT0IE>
extern volatile __bit                   INT0IE              __at(0x2399);	// @ (0x473 * 8 + 1)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<INT0IF>
extern volatile __bit                   INT0IF              __at(0x2349);	// @ (0x469 * 8 + 1)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR0,1)
// IPR0<INT0IP>
extern volatile __bit                   INT0IP              __at(0x23E9);	// @ (0x47D * 8 + 1)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR0,1)
// INT0PPS<INT0PPS0>
extern volatile __bit                   INT0PPS0            __at(0x1A90);	// @ (0x352 * 8 + 0)
#define                                 INT0PPS0_bit        _BIT_ACCESS(INT0PPS,0)
// INT0PPS<INT0PPS1>
extern volatile __bit                   INT0PPS1            __at(0x1A91);	// @ (0x352 * 8 + 1)
#define                                 INT0PPS1_bit        _BIT_ACCESS(INT0PPS,1)
// INT0PPS<INT0PPS2>
extern volatile __bit                   INT0PPS2            __at(0x1A92);	// @ (0x352 * 8 + 2)
#define                                 INT0PPS2_bit        _BIT_ACCESS(INT0PPS,2)
// INT0PPS<INT0PPS3>
extern volatile __bit                   INT0PPS3            __at(0x1A93);	// @ (0x352 * 8 + 3)
#define                                 INT0PPS3_bit        _BIT_ACCESS(INT0PPS,3)
// INT0PPS<INT0PPS4>
extern volatile __bit                   INT0PPS4            __at(0x1A94);	// @ (0x352 * 8 + 4)
#define                                 INT0PPS4_bit        _BIT_ACCESS(INT0PPS,4)
// INTCON0<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x2309);	// @ (0x461 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON0,1)
// PIE0<INT1IE>
extern volatile __bit                   INT1IE              __at(0x239A);	// @ (0x473 * 8 + 2)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE0,2)
// PIR0<INT1IF>
extern volatile __bit                   INT1IF              __at(0x234A);	// @ (0x469 * 8 + 2)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR0,2)
// IPR0<INT1IP>
extern volatile __bit                   INT1IP              __at(0x23EA);	// @ (0x47D * 8 + 2)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR0,2)
// INT1PPS<INT1PPS0>
extern volatile __bit                   INT1PPS0            __at(0x1A98);	// @ (0x353 * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x1A99);	// @ (0x353 * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x1A9A);	// @ (0x353 * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x1A9B);	// @ (0x353 * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INT1PPS<INT1PPS4>
extern volatile __bit                   INT1PPS4            __at(0x1A9C);	// @ (0x353 * 8 + 4)
#define                                 INT1PPS4_bit        _BIT_ACCESS(INT1PPS,4)
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x230A);	// @ (0x461 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON0,2)
// PIE0<INT2IE>
extern volatile __bit                   INT2IE              __at(0x239B);	// @ (0x473 * 8 + 3)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE0,3)
// PIR0<INT2IF>
extern volatile __bit                   INT2IF              __at(0x234B);	// @ (0x469 * 8 + 3)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR0,3)
// IPR0<INT2IP>
extern volatile __bit                   INT2IP              __at(0x23EB);	// @ (0x47D * 8 + 3)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR0,3)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x1AA0);	// @ (0x354 * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x1AA1);	// @ (0x354 * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x1AA2);	// @ (0x354 * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x1AA3);	// @ (0x354 * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// INT2PPS<INT2PPS4>
extern volatile __bit                   INT2PPS4            __at(0x1AA4);	// @ (0x354 * 8 + 4)
#define                                 INT2PPS4_bit        _BIT_ACCESS(INT2PPS,4)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x1011);	// @ (0x202 * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x1010);	// @ (0x202 * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// CLCnCON<INTN>
extern volatile __bit                   INTN                __at(0xD2B);	// @ (0x1A5 * 8 + 3)
#define                                 INTN_bit            _BIT_ACCESS(CLCnCON,3)
// CLCnCON<INTP>
extern volatile __bit                   INTP                __at(0xD2C);	// @ (0x1A5 * 8 + 4)
#define                                 INTP_bit            _BIT_ACCESS(CLCnCON,4)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x20E8);	// @ (0x41D * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x20E9);	// @ (0x41D * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x20EA);	// @ (0x41D * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x20EB);	// @ (0x41D * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x20EC);	// @ (0x41D * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x20ED);	// @ (0x41D * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x20E0);	// @ (0x41C * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x20E1);	// @ (0x41C * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x20E2);	// @ (0x41C * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x20E3);	// @ (0x41C * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x20E4);	// @ (0x41C * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x20E5);	// @ (0x41C * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x20D8);	// @ (0x41B * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x20D9);	// @ (0x41B * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x20DA);	// @ (0x41B * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x20DB);	// @ (0x41B * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x20DC);	// @ (0x41B * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x20DD);	// @ (0x41B * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x213D);	// @ (0x427 * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x213E);	// @ (0x427 * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x213F);	// @ (0x427 * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x2135);	// @ (0x426 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x2136);	// @ (0x426 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
