garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.h
extern volatile __bit                   TU16ACR30           __at(0x99E);	// @ (0x133 * 8 + 6)
#define                                 TU16ACR30_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACR31>
extern volatile __bit                   TU16ACR31           __at(0x99F);	// @ (0x133 * 8 + 7)
#define                                 TU16ACR31_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16ACRL<TU16ACR4>
extern volatile __bit                   TU16ACR4            __at(0x984);	// @ (0x130 * 8 + 4)
#define                                 TU16ACR4_bit        _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACR5>
extern volatile __bit                   TU16ACR5            __at(0x985);	// @ (0x130 * 8 + 5)
#define                                 TU16ACR5_bit        _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACR6>
extern volatile __bit                   TU16ACR6            __at(0x986);	// @ (0x130 * 8 + 6)
#define                                 TU16ACR6_bit        _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACR7>
extern volatile __bit                   TU16ACR7            __at(0x987);	// @ (0x130 * 8 + 7)
#define                                 TU16ACR7_bit        _BIT_ACCESS(TU16ACRL,7)
// TU16ACRH<TU16ACR8>
extern volatile __bit                   TU16ACR8            __at(0x988);	// @ (0x131 * 8 + 0)
#define                                 TU16ACR8_bit        _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACR9>
extern volatile __bit                   TU16ACR9            __at(0x989);	// @ (0x131 * 8 + 1)
#define                                 TU16ACR9_bit        _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH0>
extern volatile __bit                   TU16ACRH0           __at(0x988);	// @ (0x131 * 8 + 0)
#define                                 TU16ACRH0_bit       _BIT_ACCESS(TU16ACRH,0)
// TU16ACRH<TU16ACRH1>
extern volatile __bit                   TU16ACRH1           __at(0x989);	// @ (0x131 * 8 + 1)
#define                                 TU16ACRH1_bit       _BIT_ACCESS(TU16ACRH,1)
// TU16ACRH<TU16ACRH2>
extern volatile __bit                   TU16ACRH2           __at(0x98A);	// @ (0x131 * 8 + 2)
#define                                 TU16ACRH2_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACRH3>
extern volatile __bit                   TU16ACRH3           __at(0x98B);	// @ (0x131 * 8 + 3)
#define                                 TU16ACRH3_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACRH4>
extern volatile __bit                   TU16ACRH4           __at(0x98C);	// @ (0x131 * 8 + 4)
#define                                 TU16ACRH4_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACRH5>
extern volatile __bit                   TU16ACRH5           __at(0x98D);	// @ (0x131 * 8 + 5)
#define                                 TU16ACRH5_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACRH6>
extern volatile __bit                   TU16ACRH6           __at(0x98E);	// @ (0x131 * 8 + 6)
#define                                 TU16ACRH6_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACRH7>
extern volatile __bit                   TU16ACRH7           __at(0x98F);	// @ (0x131 * 8 + 7)
#define                                 TU16ACRH7_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACRL0>
extern volatile __bit                   TU16ACRL0           __at(0x980);	// @ (0x130 * 8 + 0)
#define                                 TU16ACRL0_bit       _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACRL1>
extern volatile __bit                   TU16ACRL1           __at(0x981);	// @ (0x130 * 8 + 1)
#define                                 TU16ACRL1_bit       _BIT_ACCESS(TU16ACRL,1)
// TU16ACRL<TU16ACRL2>
extern volatile __bit                   TU16ACRL2           __at(0x982);	// @ (0x130 * 8 + 2)
#define                                 TU16ACRL2_bit       _BIT_ACCESS(TU16ACRL,2)
// TU16ACRL<TU16ACRL3>
extern volatile __bit                   TU16ACRL3           __at(0x983);	// @ (0x130 * 8 + 3)
#define                                 TU16ACRL3_bit       _BIT_ACCESS(TU16ACRL,3)
// TU16ACRL<TU16ACRL4>
extern volatile __bit                   TU16ACRL4           __at(0x984);	// @ (0x130 * 8 + 4)
#define                                 TU16ACRL4_bit       _BIT_ACCESS(TU16ACRL,4)
// TU16ACRL<TU16ACRL5>
extern volatile __bit                   TU16ACRL5           __at(0x985);	// @ (0x130 * 8 + 5)
#define                                 TU16ACRL5_bit       _BIT_ACCESS(TU16ACRL,5)
// TU16ACRL<TU16ACRL6>
extern volatile __bit                   TU16ACRL6           __at(0x986);	// @ (0x130 * 8 + 6)
#define                                 TU16ACRL6_bit       _BIT_ACCESS(TU16ACRL,6)
// TU16ACRL<TU16ACRL7>
extern volatile __bit                   TU16ACRL7           __at(0x987);	// @ (0x130 * 8 + 7)
#define                                 TU16ACRL7_bit       _BIT_ACCESS(TU16ACRL,7)
// TU16ACRT<TU16ACRT0>
extern volatile __bit                   TU16ACRT0           __at(0x998);	// @ (0x133 * 8 + 0)
#define                                 TU16ACRT0_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACRT1>
extern volatile __bit                   TU16ACRT1           __at(0x999);	// @ (0x133 * 8 + 1)
#define                                 TU16ACRT1_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACRT2>
extern volatile __bit                   TU16ACRT2           __at(0x99A);	// @ (0x133 * 8 + 2)
#define                                 TU16ACRT2_bit       _BIT_ACCESS(TU16ACRT,2)
// TU16ACRT<TU16ACRT3>
extern volatile __bit                   TU16ACRT3           __at(0x99B);	// @ (0x133 * 8 + 3)
#define                                 TU16ACRT3_bit       _BIT_ACCESS(TU16ACRT,3)
// TU16ACRT<TU16ACRT4>
extern volatile __bit                   TU16ACRT4           __at(0x99C);	// @ (0x133 * 8 + 4)
#define                                 TU16ACRT4_bit       _BIT_ACCESS(TU16ACRT,4)
// TU16ACRT<TU16ACRT5>
extern volatile __bit                   TU16ACRT5           __at(0x99D);	// @ (0x133 * 8 + 5)
#define                                 TU16ACRT5_bit       _BIT_ACCESS(TU16ACRT,5)
// TU16ACRT<TU16ACRT6>
extern volatile __bit                   TU16ACRT6           __at(0x99E);	// @ (0x133 * 8 + 6)
#define                                 TU16ACRT6_bit       _BIT_ACCESS(TU16ACRT,6)
// TU16ACRT<TU16ACRT7>
extern volatile __bit                   TU16ACRT7           __at(0x99F);	// @ (0x133 * 8 + 7)
#define                                 TU16ACRT7_bit       _BIT_ACCESS(TU16ACRT,7)
// TU16AHLT<TU16ACSYNC>
extern volatile __bit                   TU16ACSYNC          __at(0x976);	// @ (0x12E * 8 + 6)
#define                                 TU16ACSYNC_bit      _BIT_ACCESS(TU16AHLT,6)
// TU16AHLT<TU16AEPOL>
extern volatile __bit                   TU16AEPOL           __at(0x977);	// @ (0x12E * 8 + 7)
#define                                 TU16AEPOL_bit       _BIT_ACCESS(TU16AHLT,7)
// TU16AERS<TU16AERS0>
extern volatile __bit                   TU16AERS0           __at(0x9C8);	// @ (0x139 * 8 + 0)
#define                                 TU16AERS0_bit       _BIT_ACCESS(TU16AERS,0)
// TU16AERS<TU16AERS1>
extern volatile __bit                   TU16AERS1           __at(0x9C9);	// @ (0x139 * 8 + 1)
#define                                 TU16AERS1_bit       _BIT_ACCESS(TU16AERS,1)
// TU16AERS<TU16AERS2>
extern volatile __bit                   TU16AERS2           __at(0x9CA);	// @ (0x139 * 8 + 2)
#define                                 TU16AERS2_bit       _BIT_ACCESS(TU16AERS,2)
// TU16AERS<TU16AERS3>
extern volatile __bit                   TU16AERS3           __at(0x9CB);	// @ (0x139 * 8 + 3)
#define                                 TU16AERS3_bit       _BIT_ACCESS(TU16AERS,3)
// TU16AERS<TU16AERS4>
extern volatile __bit                   TU16AERS4           __at(0x9CC);	// @ (0x139 * 8 + 4)
#define                                 TU16AERS4_bit       _BIT_ACCESS(TU16AERS,4)
// TU16AERS<TU16AERS5>
extern volatile __bit                   TU16AERS5           __at(0x9CD);	// @ (0x139 * 8 + 5)
#define                                 TU16AERS5_bit       _BIT_ACCESS(TU16AERS,5)
// PIE4<TU16AIE>
extern volatile __bit                   TU16AIE             __at(0x23BA);	// @ (0x477 * 8 + 2)
#define                                 TU16AIE_bit         _BIT_ACCESS(PIE4,2)
// PIR4<TU16AIF>
extern volatile __bit                   TU16AIF             __at(0x236A);	// @ (0x46D * 8 + 2)
#define                                 TU16AIF_bit         _BIT_ACCESS(PIR4,2)
// IPR4<TU16AIP>
extern volatile __bit                   TU16AIP             __at(0x240A);	// @ (0x481 * 8 + 2)
#define                                 TU16AIP_bit         _BIT_ACCESS(IPR4,2)
// TU16ACON1<TU16ALIMIT>
extern volatile __bit                   TU16ALIMIT          __at(0x96C);	// @ (0x12D * 8 + 4)
#define                                 TU16ALIMIT_bit      _BIT_ACCESS(TU16ACON1,4)
// PMD2<TU16AMD>
extern volatile __bit                   TU16AMD             __at(0x1810);	// @ (0x302 * 8 + 0)
#define                                 TU16AMD_bit         _BIT_ACCESS(PMD2,0)
// TU16ACON0<TU16AOM>
extern volatile __bit                   TU16AOM             __at(0x965);	// @ (0x12C * 8 + 5)
#define                                 TU16AOM_bit         _BIT_ACCESS(TU16ACON0,5)
// TU16ACON0<TU16AON>
extern volatile __bit                   TU16AON             __at(0x967);	// @ (0x12C * 8 + 7)
#define                                 TU16AON_bit         _BIT_ACCESS(TU16ACON0,7)
// TU16ACON0<TU16AOPOL>
extern volatile __bit                   TU16AOPOL           __at(0x964);	// @ (0x12C * 8 + 4)
#define                                 TU16AOPOL_bit       _BIT_ACCESS(TU16ACON0,4)
// TU16APRL<TU16APR0>
extern volatile __bit                   TU16APR0            __at(0x9A0);	// @ (0x134 * 8 + 0)
#define                                 TU16APR0_bit        _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APR1>
extern volatile __bit                   TU16APR1            __at(0x9A1);	// @ (0x134 * 8 + 1)
#define                                 TU16APR1_bit        _BIT_ACCESS(TU16APRL,1)
// TU16APRH<TU16APR10>
extern volatile __bit                   TU16APR10           __at(0x9AA);	// @ (0x135 * 8 + 2)
#define                                 TU16APR10_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APR11>
extern volatile __bit                   TU16APR11           __at(0x9AB);	// @ (0x135 * 8 + 3)
#define                                 TU16APR11_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APR12>
extern volatile __bit                   TU16APR12           __at(0x9AC);	// @ (0x135 * 8 + 4)
#define                                 TU16APR12_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APR13>
extern volatile __bit                   TU16APR13           __at(0x9AD);	// @ (0x135 * 8 + 5)
#define                                 TU16APR13_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APR14>
extern volatile __bit                   TU16APR14           __at(0x9AE);	// @ (0x135 * 8 + 6)
#define                                 TU16APR14_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APR15>
extern volatile __bit                   TU16APR15           __at(0x9AF);	// @ (0x135 * 8 + 7)
#define                                 TU16APR15_bit       _BIT_ACCESS(TU16APRH,7)
// TU16APRL<TU16APR2>
extern volatile __bit                   TU16APR2            __at(0x9A2);	// @ (0x134 * 8 + 2)
#define                                 TU16APR2_bit        _BIT_ACCESS(TU16APRL,2)
// TU16APRT<TU16APR24>
extern volatile __bit                   TU16APR24           __at(0x9B8);	// @ (0x137 * 8 + 0)
#define                                 TU16APR24_bit       _BIT_ACCESS(TU16APRT,0)
// TU16APRT<TU16APR25>
extern volatile __bit                   TU16APR25           __at(0x9B9);	// @ (0x137 * 8 + 1)
#define                                 TU16APR25_bit       _BIT_ACCESS(TU16APRT,1)
// TU16APRT<TU16APR26>
extern volatile __bit                   TU16APR26           __at(0x9BA);	// @ (0x137 * 8 + 2)
#define                                 TU16APR26_bit       _BIT_ACCESS(TU16APRT,2)
// TU16APRT<TU16APR27>
extern volatile __bit                   TU16APR27           __at(0x9BB);	// @ (0x137 * 8 + 3)
#define                                 TU16APR27_bit       _BIT_ACCESS(TU16APRT,3)
// TU16APRT<TU16APR28>
extern volatile __bit                   TU16APR28           __at(0x9BC);	// @ (0x137 * 8 + 4)
#define                                 TU16APR28_bit       _BIT_ACCESS(TU16APRT,4)
// TU16APRT<TU16APR29>
extern volatile __bit                   TU16APR29           __at(0x9BD);	// @ (0x137 * 8 + 5)
#define                                 TU16APR29_bit       _BIT_ACCESS(TU16APRT,5)
// TU16APRL<TU16APR3>
extern volatile __bit                   TU16APR3            __at(0x9A3);	// @ (0x134 * 8 + 3)
#define                                 TU16APR3_bit        _BIT_ACCESS(TU16APRL,3)
// TU16APRT<TU16APR30>
extern volatile __bit                   TU16APR30           __at(0x9BE);	// @ (0x137 * 8 + 6)
#define                                 TU16APR30_bit       _BIT_ACCESS(TU16APRT,6)
// TU16APRT<TU16APR31>
extern volatile __bit                   TU16APR31           __at(0x9BF);	// @ (0x137 * 8 + 7)
#define                                 TU16APR31_bit       _BIT_ACCESS(TU16APRT,7)
// TU16APRL<TU16APR4>
extern volatile __bit                   TU16APR4            __at(0x9A4);	// @ (0x134 * 8 + 4)
#define                                 TU16APR4_bit        _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APR5>
extern volatile __bit                   TU16APR5            __at(0x9A5);	// @ (0x134 * 8 + 5)
#define                                 TU16APR5_bit        _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APR6>
extern volatile __bit                   TU16APR6            __at(0x9A6);	// @ (0x134 * 8 + 6)
#define                                 TU16APR6_bit        _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APR7>
extern volatile __bit                   TU16APR7            __at(0x9A7);	// @ (0x134 * 8 + 7)
#define                                 TU16APR7_bit        _BIT_ACCESS(TU16APRL,7)
// TU16APRH<TU16APR8>
extern volatile __bit                   TU16APR8            __at(0x9A8);	// @ (0x135 * 8 + 0)
#define                                 TU16APR8_bit        _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APR9>
extern volatile __bit                   TU16APR9            __at(0x9A9);	// @ (0x135 * 8 + 1)
#define                                 TU16APR9_bit        _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH0>
extern volatile __bit                   TU16APRH0           __at(0x9A8);	// @ (0x135 * 8 + 0)
#define                                 TU16APRH0_bit       _BIT_ACCESS(TU16APRH,0)
// TU16APRH<TU16APRH1>
extern volatile __bit                   TU16APRH1           __at(0x9A9);	// @ (0x135 * 8 + 1)
#define                                 TU16APRH1_bit       _BIT_ACCESS(TU16APRH,1)
// TU16APRH<TU16APRH2>
extern volatile __bit                   TU16APRH2           __at(0x9AA);	// @ (0x135 * 8 + 2)
#define                                 TU16APRH2_bit       _BIT_ACCESS(TU16APRH,2)
// TU16APRH<TU16APRH3>
extern volatile __bit                   TU16APRH3           __at(0x9AB);	// @ (0x135 * 8 + 3)
#define                                 TU16APRH3_bit       _BIT_ACCESS(TU16APRH,3)
// TU16APRH<TU16APRH4>
extern volatile __bit                   TU16APRH4           __at(0x9AC);	// @ (0x135 * 8 + 4)
#define                                 TU16APRH4_bit       _BIT_ACCESS(TU16APRH,4)
// TU16APRH<TU16APRH5>
extern volatile __bit                   TU16APRH5           __at(0x9AD);	// @ (0x135 * 8 + 5)
#define                                 TU16APRH5_bit       _BIT_ACCESS(TU16APRH,5)
// TU16APRH<TU16APRH6>
extern volatile __bit                   TU16APRH6           __at(0x9AE);	// @ (0x135 * 8 + 6)
#define                                 TU16APRH6_bit       _BIT_ACCESS(TU16APRH,6)
// TU16APRH<TU16APRH7>
extern volatile __bit                   TU16APRH7           __at(0x9AF);	// @ (0x135 * 8 + 7)
#define                                 TU16APRH7_bit       _BIT_ACCESS(TU16APRH,7)
// TU16ACON0<TU16APRIE>
extern volatile __bit                   TU16APRIE           __at(0x962);	// @ (0x12C * 8 + 2)
#define                                 TU16APRIE_bit       _BIT_ACCESS(TU16ACON0,2)
// TU16ACON1<TU16APRIF>
extern volatile __bit                   TU16APRIF           __at(0x96A);	// @ (0x12D * 8 + 2)
#define                                 TU16APRIF_bit       _BIT_ACCESS(TU16ACON1,2)
// TU16APRL<TU16APRL0>
extern volatile __bit                   TU16APRL0           __at(0x9A0);	// @ (0x134 * 8 + 0)
#define                                 TU16APRL0_bit       _BIT_ACCESS(TU16APRL,0)
// TU16APRL<TU16APRL1>
extern volatile __bit                   TU16APRL1           __at(0x9A1);	// @ (0x134 * 8 + 1)
#define                                 TU16APRL1_bit       _BIT_ACCESS(TU16APRL,1)
// TU16APRL<TU16APRL2>
extern volatile __bit                   TU16APRL2           __at(0x9A2);	// @ (0x134 * 8 + 2)
#define                                 TU16APRL2_bit       _BIT_ACCESS(TU16APRL,2)
// TU16APRL<TU16APRL3>
extern volatile __bit                   TU16APRL3           __at(0x9A3);	// @ (0x134 * 8 + 3)
#define                                 TU16APRL3_bit       _BIT_ACCESS(TU16APRL,3)
// TU16APRL<TU16APRL4>
extern volatile __bit                   TU16APRL4           __at(0x9A4);	// @ (0x134 * 8 + 4)
#define                                 TU16APRL4_bit       _BIT_ACCESS(TU16APRL,4)
// TU16APRL<TU16APRL5>
extern volatile __bit                   TU16APRL5           __at(0x9A5);	// @ (0x134 * 8 + 5)
#define                                 TU16APRL5_bit       _BIT_ACCESS(TU16APRL,5)
// TU16APRL<TU16APRL6>
extern volatile __bit                   TU16APRL6           __at(0x9A6);	// @ (0x134 * 8 + 6)
#define                                 TU16APRL6_bit       _BIT_ACCESS(TU16APRL,6)
// TU16APRL<TU16APRL7>
extern volatile __bit                   TU16APRL7           __at(0x9A7);	// @ (0x134 * 8 + 7)
#define                                 TU16APRL7_bit       _BIT_ACCESS(TU16APRL,7)
// TU16APRT<TU16APRT0>
extern volatile __bit                   TU16APRT0           __at(0x9B8);	// @ (0x137 * 8 + 0)
#define                                 TU16APRT0_bit       _BIT_ACCESS(TU16APRT,0)
// TU16APRT<TU16APRT1>
extern volatile __bit                   TU16APRT1           __at(0x9B9);	// @ (0x137 * 8 + 1)
#define                                 TU16APRT1_bit       _BIT_ACCESS(TU16APRT,1)
// TU16APRT<TU16APRT2>
extern volatile __bit                   TU16APRT2           __at(0x9BA);	// @ (0x137 * 8 + 2)
#define                                 TU16APRT2_bit       _BIT_ACCESS(TU16APRT,2)
// TU16APRT<TU16APRT3>
extern volatile __bit                   TU16APRT3           __at(0x9BB);	// @ (0x137 * 8 + 3)
#define                                 TU16APRT3_bit       _BIT_ACCESS(TU16APRT,3)
// TU16APRT<TU16APRT4>
extern volatile __bit                   TU16APRT4           __at(0x9BC);	// @ (0x137 * 8 + 4)
#define                                 TU16APRT4_bit       _BIT_ACCESS(TU16APRT,4)
// TU16APRT<TU16APRT5>
extern volatile __bit                   TU16APRT5           __at(0x9BD);	// @ (0x137 * 8 + 5)
#define                                 TU16APRT5_bit       _BIT_ACCESS(TU16APRT,5)
// TU16APRT<TU16APRT6>
extern volatile __bit                   TU16APRT6           __at(0x9BE);	// @ (0x137 * 8 + 6)
#define                                 TU16APRT6_bit       _BIT_ACCESS(TU16APRT,6)
// TU16APRT<TU16APRT7>
extern volatile __bit                   TU16APRT7           __at(0x9BF);	// @ (0x137 * 8 + 7)
#define                                 TU16APRT7_bit       _BIT_ACCESS(TU16APRT,7)
// TU16APS<TU16APS0>
extern volatile __bit                   TU16APS0            __at(0x978);	// @ (0x12F * 8 + 0)
#define                                 TU16APS0_bit        _BIT_ACCESS(TU16APS,0)
// TU16APS<TU16APS1>
extern volatile __bit                   TU16APS1            __at(0x979);	// @ (0x12F * 8 + 1)
#define                                 TU16APS1_bit        _BIT_ACCESS(TU16APS,1)
// TU16APS<TU16APS2>
extern volatile __bit                   TU16APS2            __at(0x97A);	// @ (0x12F * 8 + 2)
#define                                 TU16APS2_bit        _BIT_ACCESS(TU16APS,2)
// TU16APS<TU16APS3>
extern volatile __bit                   TU16APS3            __at(0x97B);	// @ (0x12F * 8 + 3)
#define                                 TU16APS3_bit        _BIT_ACCESS(TU16APS,3)
// TU16APS<TU16APS4>
extern volatile __bit                   TU16APS4            __at(0x97C);	// @ (0x12F * 8 + 4)
#define                                 TU16APS4_bit        _BIT_ACCESS(TU16APS,4)
// TU16APS<TU16APS5>
extern volatile __bit                   TU16APS5            __at(0x97D);	// @ (0x12F * 8 + 5)
#define                                 TU16APS5_bit        _BIT_ACCESS(TU16APS,5)
// TU16APS<TU16APS6>
extern volatile __bit                   TU16APS6            __at(0x97E);	// @ (0x12F * 8 + 6)
#define                                 TU16APS6_bit        _BIT_ACCESS(TU16APS,6)
// TU16APS<TU16APS7>
extern volatile __bit                   TU16APS7            __at(0x97F);	// @ (0x12F * 8 + 7)
#define                                 TU16APS7_bit        _BIT_ACCESS(TU16APS,7)
// TU16ACON0<TU16ARDSEL>
extern volatile __bit                   TU16ARDSEL          __at(0x963);	// @ (0x12C * 8 + 3)
#define                                 TU16ARDSEL_bit      _BIT_ACCESS(TU16ACON0,3)
// TU16AHLT<TU16ARESET0>
extern volatile __bit                   TU16ARESET0         __at(0x972);	// @ (0x12E * 8 + 2)
#define                                 TU16ARESET0_bit     _BIT_ACCESS(TU16AHLT,2)
// TU16AHLT<TU16ARESET1>
extern volatile __bit                   TU16ARESET1         __at(0x973);	// @ (0x12E * 8 + 3)
#define                                 TU16ARESET1_bit     _BIT_ACCESS(TU16AHLT,3)
// TU16ACON1<TU16ARUN>
extern volatile __bit                   TU16ARUN            __at(0x96F);	// @ (0x12D * 8 + 7)
#define                                 TU16ARUN_bit        _BIT_ACCESS(TU16ACON1,7)
// TU16AHLT<TU16ASTART0>
extern volatile __bit                   TU16ASTART0         __at(0x974);	// @ (0x12E * 8 + 4)
#define                                 TU16ASTART0_bit     _BIT_ACCESS(TU16AHLT,4)
// TU16AHLT<TU16ASTART1>
extern volatile __bit                   TU16ASTART1         __at(0x975);	// @ (0x12E * 8 + 5)
#define                                 TU16ASTART1_bit     _BIT_ACCESS(TU16AHLT,5)
// TU16AHLT<TU16ASTOP0>
extern volatile __bit                   TU16ASTOP0          __at(0x970);	// @ (0x12E * 8 + 0)
#define                                 TU16ASTOP0_bit      _BIT_ACCESS(TU16AHLT,0)
// TU16AHLT<TU16ASTOP1>
extern volatile __bit                   TU16ASTOP1          __at(0x971);	// @ (0x12E * 8 + 1)
#define                                 TU16ASTOP1_bit      _BIT_ACCESS(TU16AHLT,1)
// TU16ATMRL<TU16ATMR0>
extern volatile __bit                   TU16ATMR0           __at(0x980);	// @ (0x130 * 8 + 0)
#define                                 TU16ATMR0_bit       _BIT_ACCESS(TU16ATMRL,0)
// TU16ATMRL<TU16ATMR1>
extern volatile __bit                   TU16ATMR1           __at(0x981);	// @ (0x130 * 8 + 1)
#define                                 TU16ATMR1_bit       _BIT_ACCESS(TU16ATMRL,1)
// TU16ATMRH<TU16ATMR10>
extern volatile __bit                   TU16ATMR10          __at(0x98A);	// @ (0x131 * 8 + 2)
#define                                 TU16ATMR10_bit      _BIT_ACCESS(TU16ATMRH,2)
// TU16ATMRH<TU16ATMR11>
extern volatile __bit                   TU16ATMR11          __at(0x98B);	// @ (0x131 * 8 + 3)
#define                                 TU16ATMR11_bit      _BIT_ACCESS(TU16ATMRH,3)
// TU16ATMRH<TU16ATMR12>
extern volatile __bit                   TU16ATMR12          __at(0x98C);	// @ (0x131 * 8 + 4)
#define                                 TU16ATMR12_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMR13>
extern volatile __bit                   TU16ATMR13          __at(0x98D);	// @ (0x131 * 8 + 5)
